[{"History":"Archer Heights was originally inhabited by Native American tribes, but they had little use for its swampy prairies. Starting in the nineteenth-century, land speculators and farmers sparked interest in the swampy lands. The land became a primary focus for real-estate developers and manufacturers. It gained exceptional interest from William B. Archer, an Illinois & Michigan Canal commissioner and land speculator from whom Archer Heights gained its name.\nAfter speculators came in in 1900 and developed the southern sections of Archer Heights for residential use, railroads sustained control of the north side real estate. Due to horse cars in the late 1890s, and electric streetcars gaining popularity in the early 1900s, immigrant laborers started to pour into Archer Heights. Starting in the 1920s and 1930s, Archer Heights had its largest population growth coming from the Polish, Italian, Czech, and Russian Jewish communities. During this time modern urban groundwork and two Catholic parishes, St. Bruno's (1925) and St. Richard's (1938), helped stimulate population growth.\nAfter World War II population began to make a comeback; between 1930 and 1950, the Archer Heights community grew from 8,120 to 8,675. In the following years the population sprouted to 10,584, peaking by 1970 at 11,143. However, by 1980, the population fell off to 9,708, and continued to do so in 1990 falling to 9,227.\nFor over 90 years, the Archer Heights community has been predominantly white (96 percent in 1990), with a large contingent of foreign-born residents (27 percent in 1990), and a strong Polish cohort. In the 1990s, Hispanics, and primarily Mexicans, rose to 8 percent of the population. \"While Archer Heights continues to be home to a large Polish community, since 2000 it became the latest swath of the Southwest Side bungalow belt where Hispanics have become the majority.\"At the end of the twentieth century, approximately 60 percent of the area was dedicated to manufacturing and bulk transportation facilities, 30 percent to residences, and 10 percent to commerce.","Services":"","Education":"","CPS District-Run Schools":"","CPS Charter Schools":"","Catholic schools":"","Library":"Archer Heights Public Library\nThe Archer Heights public library is a 6 million dollar, 14,000 sq\/ft building located at 5055 S. Archer Ave. Chicago Illinois. The library is home to over 49,000 materials ranging from books, magazines, book tapes, and newspapers.\nLink\n\nhttp:\/\/www.chipublib.org\/locations\/4\/","Houses of Worship":"","Transportation":"Historically, transportation between downtown Chicago and the Southwest Side was limited to express buses that traveled down the Stevenson Expressway. The Orange Line was created in 1993 to solve this issue. Pulaski station was built as an Orange Line stop at the corner of Pulaski Road and 51st Street near Archer Avenue.","Politics":"The Archer Heights community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, the Archer Heights cast 2,803 votes for Hillary Clinton and cast 527 votes for Donald Trump (81.22% to 15.27%). In the 2012 presidential election, Archer Heights cast 2,140 votes for Barack Obama and cast 494 votes for Mitt Romney (80.03% to 18.47%).","Non-Profit Organizations":"","Archer Heights Civic Association":"","Others":"","Local parks":"","Honored residents":"48th Street and Harding Avenue dedicated an honorary street sign to recognize Henry J. \"Hank\" Rutkowski Sr. \"Rutkowski is a decorated World War II veteran and former prisoner of war\", he received the Good Conduct Medal, the Air Medal, the European Theatre of War Medal, and the Prisoner of War Medal. Following the war he worked for 40 years for Schulze & Birch, he retired in 1993.\n47th Street and Keeler Avenue dedicated a street sign for Omar Torres. \"Private First Class Omar E. Torres died in combat in Iraq, 2007.\" Torres was one of three children, his sister Oralia and brother, Oscar Jr. Where raised by Doris and Oscar Torres Sr.","Events":"St. Bruno Catholic Church Carnival\nSt. Richard Family Fest and Carnival and Rocket Run 5k\nhttp:\/\/www.strichardrocketrun.com\/\nhttps:\/\/web.archive.org\/web\/20151008061438\/http:\/\/strichard.wix.com\/carnival","Government":"Archer Heights is split by two United States congressional districts, these districts are the 3rd and 4th. Marie Newman (3rd district) serves the South West, and Jesús \"Chuy\" García serves the North East Side of Archer Heights.Alderman Edward M. Burke has been serving the 14th ward for over 50 years. Alderman Ricardo Muñoz serves the 22nd ward of Chicago. Michael R. Zalewski is the Alderman for the 23rd ward.\nArcher Heights is also represented in the 1st district of the Illinois Senate and House, their Senator is Assistant Majority Leader, Democrat Antonio Munoz and their House Rep. is Assistant Majority Leader, Democrat Daniel J. Burke.Jeffery R. Tobolski was elected as the Cook County Commissioner from the 16th District on November 2, 2010. Tobolski is the Vice-Chairman of the Labor Committee; also at the Cook County Board he chairs the Homeland Security committee, Veterans Committee, as well as the Preserve's Zoo Committee.John P. Daley is the Cook County Commissioner of the 11th District. He serves on the Cook County Board Committee as the Audit and Finance Chairman.","politics":null,"Newspapers":"","South Chicago Post":"http:\/\/www.swchicagopost.com","Southwest news Herald":"http:\/\/swnewsherald.com","References":"","External links":"Archer Heights neighborhood map & guide on ExploreChicago.org\nOfficial City of Chicago Archer Heights Community Map"}]