[{"Geography":"Armour Square is bounded by 18th Street to the north, Pershing Road to the south, the Union Pacific railroad tracks on the west and the Dan Ryan Expressway to the east.","Neighborhood demographics":"Armour Square has historically been a predominantly white, working-class neighborhood with a particularly significant population of both Italian-Americans and Croatian-Americans. With its location being immediately south of Chinatown, today the neighborhood also has a large Asian population as well. A 2014 survey found that 46.6% of the neighborhood speaks Chinese at home. The 3406 census tract in the south of Armour Square  is 99% black or African American.","Buildings and structures":"Armour Square's most recognizable landmarks are the historic Armour Square Park and nearby Guaranteed Rate Field, which sits at the southeast corner of W.35th and Shields Avenue, on the neighborhood's southernmost end. Guaranteed Rate is home to the Major League Baseball franchise, the Chicago White Sox. There are three Catholic parishes in Armour Square: Santa Lucia, St. Therese Catholic Community at 218 W. Alexander St., and St. Jerome Croatian Catholic Church. \nHistorical images of Armour Square can be found in  Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.In September 2022, the Chicago Plan Commission approved  a plan to renovate a vacant Armour Square   warehouse building  into 47 solar-powered apartments.The Chicago Housing Authority operates a 392-unit residential building for seniors age 62 and up \nin Armour Square on Wentworth Avenue.","Chicago White Sox":"In 1900, Charles Comiskey moved his St. Paul Saints to Chicago, where they became the team now known as the Chicago White Sox. They began play at the South Side Park on 39th Street in Armour Square, and have remained in the neighborhood ever since. No other major professional sports franchise has played in the same neighborhood longer than the White Sox. In 1910, Comiskey Park opened just 4 blocks north of South Side Park on a site that was formerly a junkyard. The Park remained the home of the Sox until 1990, when it was the oldest park in Major League Baseball.  The new Comiskey Park, currently known as Guaranteed Rate Field, opened in 1991 across 35th Street from the old ballpark.  Comiskey Park was then demolished in 1991 and converted into a parking lot. A plaque embedded in the asphalt marks the spot where home plate was on the original field.","Chinatown":"Chicago's Chinatown is located in the Armour Square community area centered on and around Cermak and Wentworth Avenues, and is an example of an American Chinatown, or ethnic-Chinese neighborhood.\nThe Chinatown in the Armour Square community area is not to be confused with the  West Argyle Street Historic District, sometimes called \"New Chinatown\", which is on the North Side of Chicago in and around Argyle Street and hosts Chinese, Vietnamese, Filipino, Thai and other Southeast Asian homes and businesses.","Politics":"The Armour Square community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Armour Square cast 2,892 votes for Hillary Clinton and cast 761 votes for Donald Trump (76.67% to 20.17%). In the 2012 presidential election, Armour Square cast 2,581 votes for Barack Obama and cast 575 votes for Mitt Romney (81.01% to 18.05%).","Mass transit stations":"Armour Square is served by the Dan Ryan branch of the Chicago Transit Authority's Red Line, with stops at Cermak-Chinatown and Sox-35th. It is also served by Metra on the Rock Island Line via the 35th Street station.","Education":"Chicago Public Schools serves residents of the community area; K-8 schools serving Armour Square include Haines and J. Ward. Residents are zoned to Phillips Academy High School.","References":"","External links":"Official City of Chicago Armour Square Community Map"}]