[{"History":"Ashburn, which got its name as the dumping site for the city's ashes, was slow to experience growth at the beginning of the 20th century. In 1893, the \"Clarkdale\" subdivision was planned near 83rd and Central Park Avenue along the new Chicago and Grand Trunk Railway, with only 19 homes built in the first 50 years. The early residents were Dutch, Swedish and Irish.  Ashburn opened Ashburn Flying Field, the first airfield in Chicago, in 1916, becoming the home to the E. M. Laird Airplane Company.  The marshy airfield closed in 1939.  The post-World War II economic boom, the industrial boom of Ford City, and the baby boom all contributed to population growth in the 1950s and 1960s.  Affordable home prices and proximity to the Chicago Loop helped the boom. Before Bogan High School was built, and before the area west of Pulaski Road was developed, ash 'heaps' were visible in the area south of Ford City but north of 79th Street.Along the southern edge of Ashburn, the square mile to the west is known as Scottsdale (due to the developer naming the area after his son, Scott) or St. Bede Parish. The center square mile is known as Ashburn or St. Denis Parish (which includes the now-defunct St. Denis Grammar School), and the easternmost square mile is known as Wrightwood, St. Thomas More Parish. The population of Greater Ashburn was predominantly Irish-Catholic until the 1990s when the area began to diversify with the migration of the African Americans moving in and the whites moving out. The economic landscape of the community began to suffer when the whites relocated, taking establishments that they often owned, out of the community.  In the 1950s, St. Denis Grammar School served more than 2,000 children, many of whom were in classrooms of 40+ students each. Classes during the 1959 White Sox 1959 World Series were held in the basement of the school due to overcrowding.  There were also two shifts of school grades for grade 4. The pastors at St. Denis (Father Doyle, Father Hanley and Father Fullmer) were devoted to expanding the facilities and serving the Catholics, but could never have enough classrooms to house all the Catholic children in the classrooms in the mid to late 1950s.  There was a satellite school at Springfield Avenue & 82nd Place in the early 1950s, and Dawes Elementary was filled, so much so that new schools, Carroll and Hancock, were built shortly after Dawes Elementary.In 1999, The New York Times did an article on the Ashburn neighborhood as a case study in the difficulties of neighborhood integration in Chicago.  Wrightwood, to the east, was the first section of the neighborhood to integrate, becoming predominantly African-American.  Ashburn experienced a significant transition to a racially blended middle-class population of firefighters, police officers, teachers, and other city workers. Scottsdale, to the west, has remained predominately white.A WBEZ report  conducted in July 2017 regarding Ashburn's continued segregation issues of becoming more segregated in time indicated, \"Ashburn has seen a lot of racial change since 1990 and appears to be integrated - at least on paper.\"  It further states that Ashburn is the only neighborhood in Chicago with a dominant middle class black population, to add black residents from 2000 - 2010, at a time when black people have been leaving the city in droves.","Neighborhoods":"","Beverly View":"Beverly view is located in the far eastern section of Ashburn. The population was 996 and the racial makeup was 82.4% African American, 14.3% White, 1.1% Hispanic or Latino, 1.1% Asian, and 1.1% of Mixed Race. Beverly View is bounded by West 79th Street to the north, 81st Street to the south and east, and Western Avenue to the west.","Wrightwood":"Wrightwood is located in the eastern section of Ashburn in Chicago. The most recent population for Wrightwood was 9,540 and the racial makeup for the neighborhood was 87.7% African American, 4.6% Hispanic or Latino, 4.1% of Mixed Race, and 3.6% White. Wrightwood is bounded by West Columbus Avenue to the north, 87th Street to the south, Western Avenue to the east, and Kedzie Avenue to the west.","Marycrest":"Marycrest is located in the east central portion of Ashburn in Chicago. The most recent population for Marycrest was 541 and the racial makeup was 80.6% African American, 16.4% Hispanic or Latino, and 3.0% White. Marycrest is bounded by West 85th Street to the north, 87th Street to the south, Kedzie Avenue to the east, and Central Park Avenue to the West.","Parkview":"Parkview is located in the central portion of Ashburn in Chicago. The most recent population for Parkview was 1,463 and the racial makeup was 54.1 African American, 31% Hispanic or Latino, 14.2% White, and 0.7% Asian. Parkview is bounded by West Columbus Ave to the northwest, Central Park Avenue to the east, Pulaski Avenue to the west, 87th Street to the south.","Scottsdale":"Scottsdale is located in the far western portion of Ashburn in Chicago. The most recent population for Scottsdale was 14,207 and the racial makeup was 62.7 Hispanic or Latino, 22.7% White, 12.7% African American, 1.2% Asian, and 0.5% of Mixed Race. Scottsdale is bounded by Cicero Avenue to the west, Pulaski Avenue to the east, 77th Street to the north, and 87th Street to the south.","GADA":"In 2016, the Greater Ashburn Development Association (GADA) was created to replace the now defunct Greater Ashburn Planning Association (GAPA). They were created to bring the entire Ashburn community back together through concerted efforts of multi-organizational support.  Its mission: to foster strategic relationships between the businesses and residents to create economic prosperity while partnering with surrounding communities and organizations to strengthen the forces against the challenges of potential blight, while continuing to seek a resolution to the mechanisms of gradual succession.As a result of the formulation of GADA, Ashburn had its first Summer Extravaganza, turning out over 500 community residents, business owners, sponsors and supporters. In 2017, because of the efforts of GADA and the Ashburn community's online neighborhood platform (NEXTdoor\/Ashburn), they were the only predominantly African American community in Chicago to receive the Good Neighbor Award from the NEXTdoor organization, a nonprofit company whose mission is to support neighborhoods in becoming stronger advocates for themselves. Jen Burke, NEXTdoor staff writer, writes, \"Every day, we come across incredible stories of how neighbors are using Nextdoor to improve each other’s lives and their larger community - one neighborhood on the South Side of Chicago, Ashburn, has done just that – in a big way\".","Transportation":"METRA's SouthWest Service provides Monday–Saturday rail service at the Ashburn and Wrightwood railroad stations.","Politics":"Ashburn has strongly supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Ashburn cast 14,929 votes for Hillary Clinton and cast 1,690 votes for Donald Trump. In the 2012 presidential election, Ashburn Park cast 15,436 votes for Barack Obama and cast 1,718 votes for Mitt Romney.Since at least the 1980s, the majority of Ashburn has been located in the 18th ward. As of the 2023-2033 decennial reapportionment of ward boundaries, Ashubrn is located entirely within the 18th ward. Derrick Curtis is currently Alderman of the 18th ward. Curtis also serves as the ward's Democratic committeeperson. His Republican counterpart is Devin Jones.","Notable people":"John Martin Daley (1923–2015), politician. Daley resided at 8125 South Talman Avenue during his time in the Illinois House of Representatives.\nEd Farmer (1949–2020), radio sports announcer and former MLB player\nTim McCarthy (born 1949) , retired member of the United States Secret Service. He was shot in the chest while defending President Ronald Reagan during an assassination attempt in 1981.\nAndrew J. McGann (1925–2008), member of the Illinois House of Representatives from 1983 to 1993. He resided in Wrightwood until moving to Oak Lawn, Illinois after the 1991 redistricting.\nTom Tunney (born 1967), member of the Chicago City Council from the 44th ward on the north side of Chicago. He was raised in Ashburn.\nJim Zulevic (1965–2006), actor and comedian","Schools":"The Ashburn area serves as a home to many schools such as Ashburn Community Elementary School, CICS Wrightwood, Carroll Elementary School, Dawes Elementary School, Durkin Park Elementary School, Stevenson Elementary School,  Lionel Hampton Fine & Performing Arts School, Owens Scholastic Academy, Ashburn Lutheran School, St. Bede the Venerable Catholic School, Sarah E. Goode STEM Academy, St. Rita of Cascia High School, and William J. Bogan High School.","References":""}]