[{"Development":"Auburn Gresham's development as a community dates back to the early nineteenth century, when the area was defined primarily by small German and Dutch settlements. A later influx of Irish railroad workers and others lured to the South Side by newly extended city services in the late nineteenth century led to further residential and commercial growth. In the 1920s, the population increased nearly threefold, from 19,558 to 57,381. The plethora of bungalow-style housing and brick two-flat apartment buildings throughout Auburn Gresham serves as lasting evidence of the community's formative years. Like most other Southside communities, Auburn Gresham suffered from blockbusting, rising crime, and white flight during the 1960s: the neighborhood was nearly 100% white in 1960, but flipped to being 69% black by the 1970 census.","Transportation":"Auburn Gresham is serviced by a Metra commuter rail stop at W. 87th St. and Vincennes Ave., which provides daily inbound service to LaSalle Street Station in Chicago and outbound service to Joliet. Community leaders have long encouraged the construction of an additional Metra rail stop at W. 79th St. In 2014, the City of Chicago obtained a half-acre parcel of land on which to construct the station. CTA red line stops at 79th St. and 87th St. are also available along the Dan Ryan Expressway in nearby Chatham.","Landmarks":"Chicago Public Library operates the Thurgood Marshall Branch in Auburn Gresham at W. 75th St. and S. Racine Ave. The 13,500 square foot library, which features a 125-seat auditorium, reading garden, and several artworks, opened in April 1994.St. Sabina Church is located in the community, headed by Rev. Michael Pfleger. The church and its priest have been pivotal in helping transform Auburn Gresham, with new housing and store fronts opening up in the neighborhood. One of the largest new single-family home developments in Chicago is nearly complete at W. 87th St. and S. Parnell Ave., in the southeast corner of Auburn Gresham.\nAuburn Gresham is home to the St. Leo Campus for Veterans, which includes the Catholic Charities' St. Leo's Residence, the Auburn Gresham Community Based Outpatient Clinic, the St. Leo's Veteran's Garden, and the Pope John Paul II Residence. The community is also home to Perspectives Leadership Academy and Perspectives Technology Academy which are a part of the Renaissance 2010 program. Both schools are housed in the same building that was home to the former Calumet High School in the Auburn Gresham community. Calumet High School   was one of Chicago's oldest high schools opening its doors to Auburn Gresham neighborhood students in 1919.  The Auburn Gresham community is also home to the first urban S.O.S. Children's Village in the U.S.","Demographics":"","Politics":"The Auburn Gresham community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Auburn Gresham cast 19,286 votes for Hillary Clinton and cast 272 votes for Donald Trump (97.29% to 1.37%). In the 2012 presidential election, Auburn Gresham cast 24,782 votes for Barack Obama and cast 130 votes for Mitt Romney (99.34% to 0.52%).","Notable people":"Philip K. Dick (1928–1982), science fiction writer. Dick was born at 7812 South Emerald Avenue.\nMichael Flatley (born 1958), an Irish step dancer. He grew up near 79th and Ashland.\nJohn Lyle (1920–2019), pilot and member of the Tuskegee Airmen. He was a resident of Auburn Gresham.\nMinyon Moore (born 1958), White House Political Director for President Bill Clinton. She was raised at West 78th Street and South Honore Street.","References":"","External links":"Official City of Chicago Auburn Gresham Community Map"}]