[{"History":"","Early development":"In 1835, Henry DeKoven purchased prairie land in the region. In 1857, a group of citizens formed the Town of Cicero, a ten-member local governing body that covered modern day Cicero, Oak Park, Berwyn and Austin. Eight years later, DeKoven's land was bought by Henry W. Austin. Austin, a businessman and real estate speculator, developed the namesake Austinville subdivision. Its population grew exponentially as the area's attractive amenities and access to suburban railroad service drew in population. In 1870, the Town of Cicero placed its town hall in Austin. However, by the 1890s, the heavily populated Austin area dominated town politics, but did not constitute a majority of voters. The Austin-controlled township government allowed the Lake Street Elevated to extend into Oak Park. Outraged, the other residents of Cicero Township voted to allow Chicago to annex the Austin area in an 1899 referendum. The residents of Austin voted against the referendum.","Neighborhood growth":"After its annexation, Austin continued to maintain an independent, suburban identity. By the 1920s, the area had developed significant street railways to serve its commuter population. This infrastructure attracted a large group of European immigrants to the community. In 1926, it was estimated the area had approximately 140,000 residents. In 1923, Austin Hospital opened. In 1938, the hospital, now called William Temperance Hospital, was taken over by Sisters of Saint Casimir who operated the hospital as Loretto Hospital.In 1949, construction began on the Eisenhower Expressway which bisected the southern portion of Austin.","African-American migration, white flight and economic decline":"After World War II, African-Americans increasingly moved into the surrounding community areas of East Garfield Park, North Lawndale, and West Garfield Park. After the arrival of African Americans during the Great Migration, race related prejudices such as a case of the white flight movement, with a dramatic decrease in white residents, white-owned businesses, equal city services support and resources, racially motivated realtor practices, and  industrial jobs. By 1970, the Austin community was 32% black. A decade later, it was 73% black. These trends of a decline in city services and resources and jobs, would continue for the rest of the twentieth century with Austin.The Austin community became known for violence after the loss of free flowing capital during white flight when prostitution, drug dealing, gang-activity, and shoot-outs became commonplace in the Austin neighborhood. Many trace the problems that impacted this community to the crack cocaine epidemic, as well as the opioid crisis, mass incarceration, and the HIV epidemic, which resulted in further economic decline and the loss of many social safety nets. This led to many middle and upper middle class African Americans leaving for the suburbs. In 1992, the 15th District (Austin) of the Chicago Police Department located at 5327 West Chicago Avenue at the time recorded about 48 homicides which covers most of the Austin neighborhood, making the Austin District the 4th Deadliest Police District at the time, before the 11th District (Harrison) which had 93 Homicides, 7th District (Englewood) which had 80 Homicides, & the 2nd District (Wentworth) which had 69 Homicides.\nThe latter half of the twentieth century further municipal saw significant divestment from the community. The Central station of the Chicago Transportation Agency's Congress Line was closed on September 2, 1973. In 1988, West Side Health Authority was formed after the closure of St. Anne's Hospital. In 1991, the Sisters of Saint Casimir gave control of Loretto Hospital to a management company.","21st century":"In 1999, developers agreed to turn the abandoned Galewood rail yard into an industrial park.\nDuring the development of the property, then-Alderman Ike Carothers solicited a bribe to allow the permitting process and zoning changes to move forward. The subsequent trials created a political scandal, and ended with the conviction of the developer and Carothers on various felony charges. The $60 million development ultimately brought new homes and a movie theater to the neighborhood.","Neighborhoods":"Austin is Chicago's second largest community area both by population and by land area. The Austin community area is made up of four neighborhoods; Galewood, The Island, North Austin and South Austin.","Galewood":"Galewood is named for Abram Gale who bought a farm on the area in 1838. The neighborhood is bordered by the Milwaukee District \/ West Line to the north, Harlem Avenue to the west, North Avenue to the south and Narragansett Avenue to the east. The area is a historically Italian-American community with a sizable population of Chicago city employees. Since the 1980s, it has seen an increase in African American and Latino residents, but this integration has occurred peacefully in contrast with other areas of Chicago.Galewood has two stations on the Milwaukee District West Line. The first station, Mars station functions as a stop for employees of the nearby Mars, Incorporated factory, closing in 2024, and Shriners Hospitals for Children, the latter of which is located in Montclare. The Mars station only stops during traditional commuting hours. The second, Galewood station is located east of Mars station and is a regular service station. Canadian Pacific (which operates in the U.S. Midwest as the Soo Line Railroad) operates freight trains on the line via trackage rights.\nThe neighborhood has strong ties with neighboring Montclare, including sharing a namesake library in the Chicago Public Library system, and is sometimes considered as part of that neighborhood and not the Austin community.Galewood is significantly whiter than the remainder of Austin. Galewood is 22.51% White, 50.17% African American, and 1.77% from two or more races. Residents who self-identify as Hispanic or Latino of any race were 23.96% of the total Galewood population with the western half of Galewood being 36% white and 31% African American.","The Island":"The Island neighborhood is located in the southwest corner of the Austin community. It has a population of approximately 1,700 residents. It encompasses roughly a square mile and its western and southern borders are to the suburbs of Oak Park and Cicero respectively. It is further isolated from the rest of Austin by an industrial corridor to its east and railroad tracks and Interstate 290 to the north. It is only accessible from Austin Boulevard & Roosevelt Road.The Island was the last of Austin's neighborhoods to integrate. In the 1980s, when the rest of Austin was over 70% African-American, the Island did not have a single African-American family. In 1984, when an African-American family attempted to move in on Roosevelt Road, they were met with violent resistance and shortly moved out. Politically, the area went heavily for Jane Byrne in the Democratic primary and for Edward Vrdolyak against Harold Washington in the 1987 mayoral election that broke down on racial lines. Today, the Island is an integrated community.The area, once industrial, has a diverse economy. Chicago Studio City, the largest film studio in the Midwestern United States, is located here. The films Transformers: Dark of the Moon, The Dark Knight and Public Enemies were partially filmed in The Island as were episodes of Empire and Shameless.","North Austin":"One of Austin's neighborhoods is North Austin, its boundaries starts north at Milwaukee District\/West Line and Armitage Avenue, Western boundaries are Austin Avenue or Austin Boulevard south of North Avenue, Eastern boundaries to Cicero Avenue, and Southern boundaries to Division Street. The Robert LeFlore Jr. Post Office at 5001 West Division Street is in this neighborhood.","South Austin":"South Austin is the area's largest neighborhood. It is bordered by Division Street to the north, Austin Boulevard to the west, Roosevelt Road to the south and Cicero Avenue to the east. During the Austin area's transition from a predominantly white community to a predominantly African-American community, the South Austin neighborhood was the first neighborhood to become African-American majority. The neighborhood is characterized by its numerous historic buildings. The neighborhood is home to six landmarks on the National Register of Historic Places; Austin Historic District, Midway Park, Austin Town Hall Park Historic District, Columbus Park, First Congregational Church of Austin, Joseph J. Walser House and the Seth Warner House. Austin Town Hall Park, modeled after Philadelphia's Independence Hall, is also in this neighborhood.\nIt is also home to an additional seven Chicago Landmarks not listed on the National Register of Historic Places: Beeson House and Coach House, Hitchcock House, Laramie State Bank Building, Schlect House, F. R. Schock House, Marie Schock House and the Third Unitarian Church.","Demographics":"According to a 2016 analysis by the Chicago Metropolitan Agency for Planning, there were 99,711 people and 32,277 households residing in the area.The racial makeup of the area was 4.20% White, 84.20% African American, 0.50% Asian, 0.80% from other races. Hispanic or Latino of any race were 10.30% of the population.In the area, the population was spread out, with 30.50% under the age of 19, 20.80% from 20 to 34, 18.70% from 35 to 49, 18.40% from 50 to 64, and 11.60% who were 65 years of age or older. The media age was 33.9.The median household income for the area was $31,435 as opposed to $47,831 for the city. The area's residents were disproportionately lower income with 41.0% of residents earned less than $25,000, 27.6% of residents earned between $25,000 and $49,999, 14.1% earned between $50,000 and $74,999, 8.0% earned between $75,000 and $99,999, 6.4% earned between $100,000 and $149,999, 2.9% earned $150,000 or more.\nThere were 41,807 residents in the labor force. 18.9% of workers were employed in the healthcare industry, 11.3% were employed in retail, 11% were employed in administration, 8.4% worked in education, and 8.3% worked in hospitality and food services. The area had an unemployment rate of 22.1%.","Crime":"According to the Chicago Tribune \"Crime in Chicagoland\" page, the Austin neighborhood ranked 11th out of 77 community areas in Chicago in violent crime, 25th among Chicago community areas in property crimes, and 5th out of 100 for quality of life crimes.","Education":"Austin Community Academy High School closed after spring 2007. New smaller schools have replaced Austin Community Academy High School: Austin Business and Entrepreneurship Academy, which opened in 2006, and Austin Polytechnical Academy, which opened in September 2007.Other portions of the community area are zoned to Manley High School, Marshall H.S., and Orr Campus.","Media":"Austin is served by three free weekly newspapers. The West Suburban Journal, founded in 2004, published by black-owned press Trottie Publishing Group, based in the West Cook County suburb of Westchester.  L. Nicole Trottie, founder and publisher of West Suburban Journal, is the first black woman in Illinois' 190 year history to found an accredited weekly newspaper.  Trottie is also the first African American woman ever elected to serve on the Illinois Press Association's Executive Board of Directors in its 150-year newspaper-rich history. The Austin Voice has been published in Austin since 1988. The Austin Weekly News, founded in 2005, is published by The Wednesday Journal, a publisher of free weekly newspapers based in Oak Park, Illinois. Both papers are published on Wednesdays and distributed in stores, office buildings and recreational venues throughout the community. Austin is also served by Austin Talks, an online publication maintained by journalism students at Chicago's Columbia College and underwritten in part by the Chicago Community Trust.","Politics":"Austin is a stronghold for the Democratic Party. In the 2016 presidential election, Austin cast 37,492 votes for Hillary Clinton and cast 1,280 votes for Donald Trump. Despite this landslide victory, it was Clinton's 23rd largest margin of victory by percentage points in the 76 community areas she won. In the 2012 presidential election, Austin cast 44,734 votes for Barack Obama and 965 votes for Mitt Romney. It was Obama's 24th largest margin of victory by percentage points in the 76 community areas he won.At the local level, Austin is located in Chicago's 28th, 29th, and 37th represented by Democrats Jason Ervin, Chris Taliaferro, and Emma Mitts respectively.","Notable residents":"William J.P. Banks, longtime Alderman from Chicago's 36th ward. He resided in Galewood while on the Chicago City Council.\nDanny Boy, hip-hop artist with Death Row Records.\nHannibal Buress, stand-up comedian, actor and television writer\nPeter M. Callan (1894–1965), member of the Illinois House of Representatives from 1959-1965. During his time in the legislature, he resided at 5567 West Gladys Avenue.\nRalph Capone, member of the Chicago Outfit and brother of Al Capone. He lived in the Island before moving to Wisconsin.\nIke Carothers, Alderman from Chicago's 29th ward from 1999 until his resignation in 2010. He lives in South Austin.\nCrucial Conflict, Chicago-based hip-hop group, famous for their 1996 single \"Hay\". They started at North Long Avenue & West Bloomingdale Avenue.\nDanny K. Davis, member of the United States House of Representatives from Illinois' 7th congressional district since 1999. He resides in South Austin.\nSam DeStefano (1909−1973), member of the Chicago Outfit. He resided on the 1600 block of Sayre in Galewood.\nLa Shawn K. Ford, member of the Illinois House of Representatives. He resides in Austin.\nBud Freeman and the Austin High School Gang.\nSam Giancana (1908–1975), member of the Chicago Outfit. He lived in the Island before moving to the suburbs.\nDeborah Graham, member of the Chicago City Council from the 29th ward from 2010 to 2015.\nAndrew Greeley (1928–2013), Roman Catholic priest, sociologist, journalist and popular novelist. He was a childhood resident of the Austin community area.\nJohn Marshall Hamilton (1847–1905), 18th Governor of Illinois (1883–1885). He resided at 4720 West Madison Avenue at the time of his death.\nEdward Hanrahan (1921–2009), Cook County State's Attorney from 1968 to 1972, infamous for his role in the murder of Fred Hampton. He resided in Galewood during his political career.\nSteve Harris, actor (Diary of a Mad Black Woman, The Practice). He attended Resurrection Elementary School in Austin.\nWood Harris, actor (The Wire, Remember the Titans, Creed). He attended Resurrection Elementary School in Austin.\nHugh Hefner, founder and longtime editor-in-chief of Playboy. He was raised in the Galewood neighborhood and attended Sayre Elementary School.\nBrandon Johnson (born 1976), current Mayor of Chicago.\nRoberta Karmel (born 1937), first female Commissioner of the U.S. Securities and Exchange Commission.\nCamille Y. Lilly, member of the Illinois House of Representatives. She lives in Galewood.\nRobert F. McPartlin (1926–1987), member of the Illinois House of Representatives from 1960 until his bribery indictment in 1976. During his time in the legislature, he resided at 5100 West Adams Street.\nEmma Mitts, Alderman from the 37th ward. She lives in South Austin.\nThomas J. O'Brien, member of the United States House of Representatives from Illinois's 6th congressional district. He resided in South Austin while in Congress.\nPat Quinn, former Governor of Illinois. As of 2020, he lives in Galewood.\nJohn Rice (1968–2015), Alderman from the 36th ward from 2009 to 2011. He resided in Galewood while on the Chicago City Council.\nPhilip J. Rock, President of the Illinois Senate from 1979 to 1993. He lived in the Midway Park neighborhood until he relocated to suburban Oak Park in 1977.\nSaba, rapper and record producer. He grew up in Austin.\nNick Sposato, Alderman from Chicago's 36th ward from 2011 to 2015. He lived in Galewood until moving to the 38th ward after redistricting moved Galewood to the 29th ward.\nJim Tobin (1945–2021), economist and founder of anti-tax advocacy group Taxpayers United of America.\nRobert Townsend\nLois Weisberg, Commissioner of Cultural Affairs for the City of Chicago noted by Malcolm Gladwell in The Tipping Point for her expansive social network. She was born and raised in Austin.\nErick Williams, chef\nBobby Wilson, defensive tackle for the Washington Redskins of the National Football League. He attended high school in Austin.\nFrank Peter Witek (1921-1944), U.S. Marine and awardee of the Medal of Honor. He resided at 1342 North Parkside Avenue.\nViolet Bidwill Wolfner (1900–1962), owner of the Chicago Cardinals of the National Football League. She and her husband, Walter Wolfner, resided at 5825 West Washington Boulevard in 1951.\nAbe Woodson (1934–2014), American football cornerback and kick returner who played nine seasons in the National Football League, mainly with the San Francisco 49ers. He was raised and attended high school in Austin.","Notes":"","References":"","External links":"Austin Weekly News, local newspaper\nDirectory of Community Organizations Serving Austin, Chicago"}]