[{"History":"Early settlers included German and Irish railroad workers in the 1880s who built homes on stilts to raise them above the often flooded marshlands. Some maps show a Hog Lake occupying the area of the present day park. Johnathon Pierce began to develop the area under the name \"Pierce's Park\" in 1888. The Avalon Park Community Church (founded in 1896) led an effort to change the name of the area, and in 1910 the name was changed to Avalon Park. A sewer system created in 1910 helped to drain the area and facilitate further development.Avalon Park experienced a major demographic change in the 1960s. In the 1960 census, Avalon Park was 0% African American (only six of 12,710 residents). A decade later, Avalon Park was 83% African American, according to the 1970 census. The African American population continued to increase, making up 98% of the residents by 1990.","Demographics":"According to data collected by the Chicago Metropolitan Agency for Planning, there were 9,985 people and 3,880 households in Avalon Park. The racial makeup of the area was 0.6% White, 97.2% African American, 0.4% Asian, 1.2% from other races. Hispanic or Latino of any race were 0.7% of the population. In the area, the population was spread out, with 23.3% under the age of 19, 17.6% from 20 to 34, 15.7% from 35 to 49, 23.1% from 50 to 64, and \n20.3% who were 65 years of age or older. The median age was 44 years compared to a citywide median age of 34 years.","Health and healthcare":"According to the Pritzker School of Medicine, 12% of residents are uninsured, though 92% report having a consistent primary care provider. The current life-expectancy in Avalon Park is 75 years which compares to a citywide average of 77 years. The infant mortality rate is three times higher than the citywide average. The obesity rate is 56% and 15% of residents are diabetic.","Politics":"Avalon Park is a stronghold for the Democratic Party in presidential elections. In the 2016 presidential election, Avalon Park cast 5,510 votes for Hillary Clinton and cast 87 votes Donald Trump. In the 2012 presidential election, Avalon Park cast 6,294 votes for Barack Obama and cast 49 votes for Mitt Romney.In the Illinois Senate, Avalon Park is divided between the 3rd and 17th Legislative Districts and is currently represented by Democrats Mattie Hunter and Elgie Sims. In the Illinois House of Representatives, Avalon Park is divided between the 5th and 33rd House Districts represented by Democrats Lamont Robinson and Marcus C. Evans Jr.At the local level, Avalon Park is located in the 8th Ward and represented on the Chicago City Council by Michelle A. Harris, who is also the Ward's Democratic Committeewoman. Her Republican counterpart is Lynn Franco.","Notable people":"Muhammad Ali (1942–2016), professional boxer, activist, entertainer, poet and philanthropist. He resided at 8500 South Jeffery Avenue for a time.\nLee Bey (born 1965), architect and writer. He was raised in Avalon Park.\nMarcus Evans, member of the Illinois House of Representatives since April 2012. He is a resident of Avalon Park","References":"","External links":"Official City of Chicago Avalon Park Community Map"}]