[{"History":"","Etymology":"In 1889, when the Rock Island Railroad realigned its suburban tracks, it expanded service north of 99th Street. The new station on 91st Street was named \"91st Street–Beverly Hills station\". By the late 1910s, the telephone network established a Beverly exchange. The exact significance of the name \"Beverly Hills\" is no longer known. Many speculate it is named after Beverly, Massachusetts, at the suggestion of Alice Helm French, a prominent resident and wife of the first director of the Art Institute of Chicago, or that the Rock Island Railroad simply named it after the hilly terrain. It is likely not named after Beverly Hills, California, which was named after the city in Massachusetts and received its name nearly 20 years after the 91st Street Station was named.","19th century":"Beverly and the surrounding area was sparsely populated by the Potawatomi and some white settlers until 1833, when the indigenous people ceded their land rights to the United States under Indian removal. The earliest known non-indigenous inhabitants of the area were DeWitt Lane, who settled near 103rd Street and Seeley Avenue in 1832, and Norman Rexford, who opened a tavern near 91st Street and Pleasant Avenue. The area famously became a dry settlement, prohibiting saloons and the sale of liquor. A permanent settlement was established with the sale of the land to John Blackstone in 1839. In 1844, Blackstone sold the land along the Blue Island Ridge from 91st to 115th Streets to Thomas Morgan, after whom Morgan Park is named.The transformation of the area to a suburban community began in 1869 when the descendants of Thomas Morgan sold his lands to the Blue Island Land and Building Company. The area, which was at the intersection of the Rock Island Railroad and the Panhandle Route, saw a substantial period of growth sustained by Chicagoans displaced by the Great Chicago Fire in 1871. It became an attractive community with the establishment of several schools in the 1870s. In 1874, much of Beverly and the area to the east was incorporated as the Village of Washington Heights. In 1890, the section of modern-day Beverly north of 95th Street was annexed to the City of Chicago. The section west of Western Avenue and south of 99th Street was added to Washington Heights.","Geography":"Beverly Hills is community area #72. It is on Chicago's far south side, 12 miles (19 km) from the Loop. Its northern border is 87th Street and its southern border is 107th Street. Its western border runs along Western Avenue from the northern border to 99th Street, then along Fairfield Avenue to 103rd Street, and finally along the rail line to the southern border. Its eastern border runs along Vincennes Avenue from 107th to 103rd Street, then along Beverly Avenue up to the northern border. The community covers an area of 3.19 square miles (8.3 km2). Beverly is connected to the Interstate system via I-57, located immediately to the east.Beverly, Morgan Park, Mount Greenwood, Washington Heights, and the City of Blue Island are considered part of the Blue Island Ridge. The prehistoric glacial ridge was once an island in a lake and later part of its western shore. The distinct geological history is the most significant in Chicago, being the point of highest elevation at nearly 100 feet (30 m) above the water line of Lake Michigan. It was named for its color, due to atmospheric conditions or its blue wildflowers. As of 2013, the area had 1,043.6 acres (422.3 ha) of single-family housing, 58.8 acres (23.8 ha) of multifamily housing, 66.1 acres (26.7 ha) of commercial development, 42.7 acres (17.3 ha) of institutional development, 9.9 acres (4.0 ha) of mixed-use development, and 257.6 acres (104.2 ha) of open space. An additional 548.9 acres (222.1 ha) was defined as \"transportation and other\".As of 2018 over three-quarters of the housing stock, 77.7 percent, in Beverly consists of single-family detached homes. Most of the houses were built before 1969 (44.9 percent between 1940 and 1969 and 47.1 percent before 1940). The median number of rooms in an area house is 7.2, compared to 4.8 rooms citywide. About 95 percent of the housing units were occupied. Of the total number of units, 77.6 percent were owner-occupied and 16.3 percent were renter-occupied. No multifamily buildings in the area were considered affordable according to a 2016 study conducted by the U.S. Department of Housing and Urban Development.","Demographics":"Prior to European American settlement, the area was home to Potawatomi people, who in 1833, after the Black Hawk War, were forcibly moved west of the Mississippi River by the federal government. Beverly's early Caucasian settlement was largely English and Protestant, but by the early 20th century, a large influx of Irish Americans began to arrive in the neighborhood and the construction of several Roman Catholic church parishes and business establishments saw Beverly develop into a stronghold of the city's South Side Irish community.\nIn 2018, 20,437 people in 7,557 households lived in Beverly. This represents an increase of 2.0 percent from the 2010 U.S. Census, which in turn had represented a 8.9 percent decline from the 2000 U.S. Census. The area's racial composition was 56.7 percent white, 34.9 percent black, 0.9 percent Asian and 2.1 percent other racial categories. Hispanics or Latinos of any race made up 5.4 percent of the population. Along with being known for its Irish American community identity, Beverly is also known for being one of the most racially integrated neighborhoods in Chicago with one of the city's highest percentage of black residents among white-majority neighborhoods. The age range in 2018 was broad, with 25.2 percent under the age of 19, 13.8 percent aged 20 to 34, 20.3 percent aged 35 to 49, 24.4 percent aged 50 to 64, 10.3 percent aged 65 to 74, 4.2 percent 75 to 84, and 1.7 percent 85 and older. The median age was 43. English was the only language spoken by 93.5 percent of the population aged five and older, compared to a citywide figure of 64 percent.The median household income was $98,416, compared to the citywide median income of $55,198. Eight percent of households earned less than $25,000 annually; 14.4 percent earned between $25,000 and $49,999; 13.2 percent earned between $50,000 and $74,999; 15.4 percent earned between $75,000 and $99,999; 17.2 percent earned between $100,000 and $149,999, and 31.9 percent earned more than $150,000. This compares with a citywide distribution of 25.4 percent, 20.5 percent, 15.6 percent, 11.0 percent, 13.2 percent and 14.3 percent respectively. As of September 2015, the western census tracts in the area had a median household income of over $86,900; the eastern tracts had a median household income between $57,900 and $86,900. The entire area placed above the U.S. Department of Housing and Urban Development's low-income limit.The hardship index is a metric used by the City of Chicago which considers six indicators of public health to quantify the relative amount of hardship in a community area: the percentage of occupied housing units with more than one person per room; the percentage of households living below the federal poverty level; the percentage of persons in the labor force over the age of 16 years that are unemployed; the percentage of persons over the age of 25 years without a high school diploma; the percentage of the population under 18 or over 64 years of age; and per capita income. The index is represented as a score from 1 to 100, with a higher score indicating greater hardship. With data from 2006 to 2010, Beverly's hardship index was 12.","Economy and employment":"As of 2018, 66.7 percent of Beverly's population was in the labor force; the unemployment rate was 4.3 percent, compared to the citywide rate of 8.9 percent. Of those employed, a plurality (36.5 percent) worked outside Chicago; 32.9 percent worked in the Loop, 5.0 percent on the Near North Side, and 4.6 percent on the Near West Side. About 9.7 percent of those employed in Beverly lived there; nearly half lived outside Chicago.Among Beverly residents, education was the leading employer, accounting for 19.1 percent of the population. The next two major industries of employment were health care (13.1 percent) and public administration (12.1 percent). Within the community area, professional employment, accommodation and food service, retail trade, and health care were the top four employer industries, accounting for 16.3, 15.7 14.1, and 11.8 percent, respectively.Western Avenue and 95 Street are zoned for business, as well as the intersection of 99th Street and Longwood Drive (i.e. the area surrounding the 99th Street station) and the intersection of 103rd Street and Longwood Drive (i.e. the area surrounding the 103rd Street station).","Politics":"","Local":"In the Chicago City Council, Beverly is located entirely within the 19th Ward, represented by Democrat Matthew O'Shea. A long-time resident of the community area, he has represented the ward since 2011. In the Cook County Board of Commissioners, it is contained within the 11th district, represented by John P. Daley since the district was established in 1994.","State":"In the Illinois House of Representatives, most of Beverly lies within the 35th district. Small portions at the edges of the community area (along 107th Street and Beverly Avenue) are a part of the 27th district, and other portions north of 95th Street lie within the 36th district. The respective representatives of the three districts are Democrats Frances Ann Hurley (since 2013), Justin Slaughter (since 2017), and Kelly M. Burke (since 2011). In the Illinois Senate, most of Beverly lies within the 18th district and small portions at the edges of the community area (along 107th Street and Beverly Avenue) are a part of the 14th district. The respective senators of the two districts are Democrats Bill Cunningham (since 2013) and Emil Jones III (since 2009).","Federal":"Most of Beverly lies within Illinois's 3rd congressional district. Portions of Beverly just north of 99th Street and east of Western Avenue as well as the east side of Longwood Drive is part of the 1st congressional district. The respective representatives of the two districts are Democrats Marie Newman (since 2021) and Bobby Rush (since 1993). In 2017, the Cook Partisan Voting Index rated the two districts at D+6 and D+28, respectively. Beverly, with the rest of Illinois, is represented in the United States Senate by Democratic senators Dick Durbin (since 1997) and Tammy Duckworth (since 2017).In the 2016 presidential election, Beverly cast 6,384 votes for Hillary Clinton and 1,850 votes Donald Trump. In the 2012 presidential election, Beverly cast 8,437 votes for Barack Obama and 2,914 votes for Mitt Romney.","Government":"","Courts and governance":"All of Beverly is in the third subcircuit of the Circuit Court of Cook County, with the exception of the area between 104th and 107th Streets east of Prospect Avenue, which is in the second subcircuit. With the rest of Chicago, the community area is part of the Circuit Court's first municipal district,\nand with the rest of Cook County, it is in the first judicial district of the Supreme Court of Illinois and the state's appellate courts. All of Beverly east of Western Avenue is in Calumet Township in Cook County. The area west of Western Avenue is in Worth Township. Townships in Chicago were abolished for governmental purposes in 1902, but are still used for property assessment.","Public safety":"Beverly is in the Chicago Police Department's 22nd district, whose headquarters is nearby in Morgan Park. Chicago Fire Department Engine 121 \/ Truck 40 is located at 1724 West 95th Street.","Postal service":"Beverly's ZIP Codes are 60620, 60643, and 60655. One U.S. Post Office is located in the community at 10238 South Vincennes Avenue, and some are located in nearby Auburn Gresham, Roseland, and Morgan Park community areas.","Transportation":"","Public transportation":"Within Beverly, Metra operates five stations on the Rock Island District line, providing daily inbound commuter-rail service to LaSalle Street Station in Chicago and outbound service to the Joliet Transportation Center. The line stops approximately every four blocks in a distinct difference between other regions it services: the 91st Street station, 95th Street station, 99th Street station, 103rd Street station, and the 107th Street station. All stations are in Zone C for fare-collection purposes.The 95th\/Dan Ryan station on the Chicago Transit Authority (CTA)'s Red Line, the 14th busiest rapid-transit station on the Chicago \"L\" in June 2019, is in nearby Roseland. Local buses include the CTA 95, 103, and 112 routes with full-time service, and part-time service on the 9 CTA route and the 349 and 381 Pace routes.","Private transportation":"As of 2018, a plurality of occupied housing units (41.9 percent) have two vehicles available; 37.4 percent of units have one vehicle available. Three or more vehicles are available in 16.8 percent of housing units; 3.9 percent of units have none. Most workers 16 years and older (70.2 percent) drive alone to work. The rest use other means of transportation; 20.8 percent take transit (compared to 23.5 percent citywide), 6.1 percent carpool, 2.0 percent walk or bicycle, and 0.9 percent use other modes. Highly-walkable areas account for over 95 percent of residents and jobs; the Chicago Metropolitan Agency for Planning defines such areas by population density, city-block length, tree-canopy cover, fatalities (or serious injuries) to pedestrians and bicyclists, density at intersections, and nearby amenities.","Education":"In the Chicago Public Schools system, Beverly contains Elizabeth H. Sutherland, Alice L. Barnard, and Kate Starr Kellogg elementary schools. It is also home to Vanderpoel Magnet Elementary School. The community is home to three private Catholic elementary schools: St. Barnabas, St. John Fisher and Christ the King. In 2018 a plurality (28.1 percent) held a bachelor's degree. 28.0 percent held a graduate or professional degree, 18.3 percent had some college education without a degree, 13.3 percent held a high school diploma or equivalency, 8.7 percent held an associate's degree, and 3.7 percent had not completed high school. Respective citywide figures were 22.7, 15.6, 17.6, 22.9, 5.7, and 15.5 percent.The Chicago Public Library opened a branch on 95th Street on June 8, 2009, featuring LEED certified design and engineering. It is home to the largest Irish heritage collection in Chicago. Artwork for the branch was funded through the Percent for Art Ordinance administered by the Chicago Public Art Program. They include a bronze sculpture entitled \"Two Lovers\" by Virginia Ferrari, a series of oil on canvas paintings entitled \"Faces of Change\" by Tim Anderson, five small and two large oil pieces on shaped birch entitled \"Clerestory Suite\" by Brian Ritchard, and two archival ink jet prints entitled \"Imaginary Play\" by Cecil McDonald Jr.","Parks and recreation":"Several of the parks within Beverly were once part of the Ridge Park District, one of 22 independent park districts in Chicago before their amalgamation in 1934 into the Chicago Park District. Beverly contains 2.0 accessible park acres (0.81 ha) per 1,000 residents, compared to a citywide figure of 2.4 acres (0.97 ha). The area includes Barnard, Ridge, Hurley, Cosme, Graver, Munroe, Beverly, Ridge Wetlands, and King-Lockhart parks.\nBarnard Park was created after Erastus A. Barnard donated 2.36 acres (0.96 ha) of land to be named in honor of his deceased daughter Amy. Alice L. Barnard, a local teacher and historian and Amy's aunt, had recently been honored with the renaming of a nearby school. The park contains a playground and open space for sports and picnicing. Ridge Park, named after the tree-studded ridge that lines the western border of the property, is a 10-acre-park (4.0 ha) established in 1908. The outdoor space contains three baseball diamonds, a playground, tennis courts, and a walking path. It also contains a set of war memorials. The park's fieldhouse was constructed in 1913 expanded in the late 1920s. It features a gymnasium, auditorium, indoor swimming pool, fitness center, woodshop, and multi-purpose rooms. The fieldhouse is also home to the Vanderpoel Memorial Art gallery, a collection of approximately 500 works by American painters and sculptors. Hurley Park is a 1.54-acre-park (0.62 ha) established in 1923 at the petition of local residents. In 1984, the park was named after Father Timothy Hurley, the founder of the St. Barnabas Catholic parish located one block south of the park. The park contains a playground at the bottom of its hill and a nature preserve at the top. Cosme Park is a 4.23-acre-park (1.71 ha) established in 1927 at the persuasion of the Beverly Hills Improvement Association. In the early 1990s, it was named in memory of Margaret Cosme, a young girl who tragically died after being struck by a moving vehicle. Her father and grandfather helped construct the park's baseball diamond in the years before her death. The park also features a playground and tennis courts. Graver Park is a 4.97-acre-park (2.01 ha) that was acquired and constructed throughout the late 1920s and early 1930s. The park's fieldhouse contains an auditorium, science lab, woodshop, and a multi-purpose room. Outside, the park offers a water park; tennis courts; a playground; and softball, baseball, and soccer fields. It was named after Philip S. Graver, vice president of the Chicago Park District from 1937 until his death in 1945. Munroe (Roy) Park is a 5.69-acre-park (2.30 ha) featuring multi-purpose field, two baseball diamonds, two playgrounds, sand volleyball and T-ball courts, and a running track. It was originally under the jurisdiction of the Village of Morgan Park's Bureau of Parks and Recreation until 1961, when it was transferred to the Chicago Park District. The significance of Roy Munroe, the park's namesake, is unknown.Beverly Park is a 13.56-acre-park (5.49 ha) which was established by the Chicago Park District in 1947 and constructed in the 1950s. It features tennis courts at the southern end, volleyball courts, a playground, and a spraypool at the northern end, a fieldhouse on the western side, and baseball diamonds in the middle of the park. These facilities are separated by large meadow expanses. Within the park is a memorial dedicated to Cpl. Conner T. Lowry, who died during combat in Afghanistan. Before his death in 2012, he asked his mother to memorialize him at Beverly Park should he not survive. On the first anniversary of his death, Mayor Rahm Emanuel dedicated the bronze statue of marine's boots, a rifle, and helmet. The 10200 block of South Maplewood Avenue adjacent to the park was designated Honorary Cpl. Conner T. Lowry way. Located less than a block away from Ridge Park, Ridge Wetlands Park was purchased from Metra in 1991 in order to save the wooded wetlands from being paved over for parking space. It totals 1.21 acres (0.49 ha). King-Lockhart Park is a 0.56-acre-park (0.23 ha) and plaza located at 10609 South Western Avenue. It is the former site of the Beverly Tire Store, which was destroyed in a fire on February 11, 1998. The park district acquired the property, which remained vacant since the fire, in 2009. The park is named after Chicago firefighters Patrick King and Anthony Lockhart, who died while battling the fire. Two pergolas mark the locations where each firefighter died.","Landmarks":"Givins Irish Castle: Arguably the most notable architectural feature in Beverly, the castle is located at the corner of 103rd Street and Longwood Drive. Robert C. Givins directed its construction in 1886 and 1887, inspired by castles from his native Ireland. He used it as his private residence until 1894. The three-story castle with its three crenellated towers has been extensively renovated over its history, though the iconic outer shell has remained unchanged. The Beverly Unitarian Church is the fifth and current \"keeper\". The castle is the only building of its kind in Chicago and is commonly claimed to be haunted.Beverly\/Morgan Railroad District: This historic district is a set of six train stations: the 91st Street, 95th Street, 99th Street, 107th Street, 111th Street and 115th Street. Of the six, the first four are located within Beverly. These stations, which were collectively constructed between 1889 and 1945, represent rare examples of late 19th to early 20th century train station architecture in Chicago. They were designated a Chicago Landmark on April 15, 1995.Longwood Drive District: The houses along Longwood Drive atop the iconic hill were built beginning in 1873 by various architects. Longwood was named for a long copse of trees that ran along the lee side of the hill where the rest of Beverly is located. Some of the community's grandest houses line the street, as it was a lofty overview for wealthy Chicagoans looking to build homes in a rural area. The houses along the street represent a mixture of different styles of architecture, such as Italianate, Carpenter Gothic, Queen Anne, Shingle, Prairie School, and Renaissance Revival. The district was designated a Chicago Landmark on November 13, 1981.\nGuy C. Smith and H. Howard Hyde Houses: These two houses are a set of American System-Built Homes located at 10410 and 10541 South Hoyne Avenue, respectively. They were constructed in 1917 and designed by Frank Lloyd Wright. The first house was intended to be the first of a subdivision of homes. Both houses are two-story, single-family units. They were designated a Chicago Landmark on July 13, 1994.William and Jessie M. Adams House: The William and Jessie M. Adams House is a Prairie school style house located at 9326 South Pleasant Avenue. The squarish two-story structure was built between 1900 and 1901 by Frank Lloyd Wright. It was designated a Chicago Landmark on June 16, 1994. In March 2014, the house sold for $980,000 after being owned by the same family since 1952.Walter Burley Griffin Place District: The district is an area along the 1600–1800 blocks of West Griffin Place containing homes built between 1909 and 1914. Seven of the homes (numbers 1666, 1712, 1724, 1727, 1731, 1736, and 1741) were built by Walter Burley Griffin, one by Spencer and Powers, and the rest by various architects. It was designated a Chicago Landmark on November 13, 1981.","Notable residents":"Lance Ten Broeck (b. 1956), professional golfer. He was raised in Beverly.\nMike Castle (b. 1989), actor best known for starring in the TBS television series Clipped. He was raised in Beverly.\nWilliam Cunningham (b. 1967), member of the Illinois Senate since 2013. He is a Beverly resident.\nCount Dante (1939–1975), American martial artist. He was born and raised in Beverly.\nRichard Duchossois (born 1921), businessman and owner of Arlington Park. He was a childhood resident of Beverly.\nElizabeth Ann Doody Gorman (born 1968), member of the Cook County Board of Commissioners from 2002 to 2015. She was a childhood resident of Beverly.\nMike Hagerty (1954–2022), actor. He was a childhood resident of Beverly and maintained strong ties to the neighborhood throughout his life.\nHenry K. Holsman (1866–1963), car manufacturer and founder of Holsman Automobile Company. He resided at 9332 South Damen Avenue.\nMichael Howlett (1914–1992), 33rd Secretary of State of Illinois. He resided at 9630 South Winchester Avenue during his political career.\nDaniel Hynes (b. 1968), 6th Illinois Comptroller. He served from 1999 until 2011. He was raised in the Beverly area.\nThomas Hynes (1938–2019), 34th President of the Illinois Senate and longtime Cook County Assessor. He is the father of Daniel Hynes.\nJohn R. Lausch Jr. (b. 1970), U.S. Attorney for the Northern District of Illinois (2017–present)\nRichard H. Lawler (1895–1982), transplant pioneer. He was a Beverly resident.\nVincent LoVerde (b. 1989), American Hockey League player. He was raised in Beverly and has played with Ontario Reign and the Manchester Monarchs.\nMorgan F. Murphy (1932–2016), Democratic member of the United States House of Representatives from 1971 to 1981, resided in Beverly.\nP. Scott Neville Jr., jurist and member of the Illinois Supreme Court.\nMatthew O'Shea (b. 1969), member of the Chicago City Council from the 19th ward. A lifelong Beverly resident, he has represented Beverly and the surrounding area on the City Council since 2011.\nCraig Robinson (b. 1971), actor and comedian, best known for the role of Darryl Philbin on the television show The Office. He was raised in North Beverly.\nEthel Spears (1903–1974), American painter. She grew up in Beverly.\nJohn Paul Stevens (1920–2019), attorney and jurist who served as Associate Justice of the Supreme Court of the United States from 1975 to 2010. He resided at 9332 South Damen Avenue at the start of his legal career.\nDaniel Sunjata (b. 1971), actor. He was raised in the Beverly neighborhood.\nMarie H. Suthers (1895–1983), longtime member of the Chicago Board of Elections from 1952 to 1983 and a member of the Illinois House of Representatives from 1951 to 1953. She was a resident of Beverly.\nDuke Tumatoe (b. 1947), American blues musician and guitarist who was a member of REO Speedwagon and is best known for his independent career. He was raised in Beverly.\nJames C. Tyree (1957–2011), chief executive officer of Mesirow Financial from 1994 until his death. He was raised in the Beverly area.\nPaul Vallas (b. 1953), superintendent of the post-Katrina, statewide Recovery School District in Louisiana. He lived in Beverly while serving as the Chief Executive Officer of the City of Chicago School District #299.\nLana (b. 1965) and Lilly Wachowski (b. 1967) (known professionally as The Wachowskis), are film directors best known for The Matrix trilogy. The two sisters were raised in Beverly.\nD. Everett Waid (1864–1939), architect who designed, among others, the Metropolitan Life North Building and the Metropolitan Life Insurance Company Hall of Records. He designed, built, and resided at 9332 South Damen Avenue.\nGeorge Wendt (b. 1948), actor and comedian, best known for the role of Norm Peterson in the television show Cheers. He was raised in Beverly.\nJamila Woods (b. 1989), poet and musician, best known for collaborations with rap artist Chance the Rapper. She was raised in Beverly, and references this in her poem Ghazal for White Hen Pantry.\nGraham Elliot (b. 1977), American Chef who co-hosted the TV series Master Chef Jr. He has been nominated three times for the James Beard Award.","Notes":"","References":"Bibliography\n\nCommunity Data Snapshot: Beverly, Chicago Community Area (PDF). cmap.illinois.gov (Report). Chicago Metropolitan Agency for Planning. June 2020. Archived (PDF) from the original on December 17, 2020. Retrieved January 17, 2021.\nPacyga, Dominic A.; Skerrett, Ellen (1996). Chicago, City of Neighborhoods: Histories and Tours. Loyola University Press. pp. 535–555. ISBN 9780829405187. OL 2538866M.\nSzucs, Loretto Dennis (1986). Chicago and Cook County sources: a genealogical and historical guide. New York, NY: Ancestry Publishing. ISBN 0916489124.\nOswald, Joseph C. (2003). Chicago's Beverly\/Morgan Park Neighborhood. Charleston, SC: Arcadia Publishing. ISBN 0738531537. OCLC 53039687.\nGrossman, James R.; Keating, Ann Durkin; Reiff, Janice L. (1996). The Encyclopedia of Chicago. Chicago: University of Chicago Press. ISBN 0226310159. OL 3289693M.\nScheu, Rachel; Garascia, Margaret (2016). \"Chicago Multifamily Market Characterization: Developing a Comprehensive Picture of the Multifamily Housing Landscape\" (PDF). Cityscape: A Journal of Policy Development and Research. Office of Policy Development and Research, U.S. Department of Housing and Urban Development. 18 (3): 265–276. Archived (PDF) from the original on June 30, 2017. Retrieved January 18, 2021.\nWagner, Robert (September 24, 1975). National Register of Historic Places Inventory - Nomination Form: Ridge Historic District (PDF) (Report). Illinois Historic Preservation Division. Archived (PDF) from the original on January 21, 2021. Retrieved January 20, 2021.","External links":"Official City of Chicago Beverly Community Map\nRidge Historical Society\nBeverly Area Planning Association"}]