[{"History":"Bridgeport was initially called the \"Portage de Checagou\" (or Portage des Chenes), and Fr. Jacques Marquette and trader Louis Joliet traveled through in 1673. It technically remained under French control until 1763, then British control until 1783 or 1795 (since British traders based out of Detroit or Canada used it).A settler named Charles Lee or Leigh came from Virginia and settled along the south fork of the Chicago River by 1804, but soon moved nearer to Lake Michigan after Fort Dearborn was completed. In April 1812, two of his tenants escaped to Fort Dearborn when visiting Winnebago proved unfriendly and massacred others at the trading post. The Leigh farm remained uninhabited as hostilities escalated into the Fort Dearborn massacre by summer's end and remained so until the U.S. Army rebuilt Fort Dearborn in 1816. Then a Detroit firm sponsored a trader, John Crafts, who rebuilt the trading post and named it \"Hardscrabble\". It grew to several cabins and a dormitory beside the trading post by the time of the Blackhawk War. Other residents who later became prominent included metis trader Alexander Robinson, schoolteacher Russell E. Heacock (who became the only dissenter to the plan to incorporate the Town of Chicago which was incorporated on August 12, 1833), and Jean Baptiste Beaubien (the second non-indigenous Chicago resident, an incorporation proponent and the town's first militia leader lived here 1840-1858).\nHeacock became a vocal proponent of the proposed Illinois and Michigan Canal, which led to the area's development in the 1830s, although others since the voyageur era had previously seen the potential replacing the portage with a canal. A limestone quarry was established in 1832 or 1833, which provided stone to improve the Chicago harbor. In 1836 the area was renamed Bridgeport, the first Chicago neighborhood.\nIn the 1830s, large numbers of immigrants from Ireland started settling in this working-class neighborhood, which became an Irish-American enclave. Many of them had earlier helped build the Erie Canal, then arrived to work on the Illinois and Michigan Canal. Funding remained a problem, and the State of Illinois began issuing \"Land Scrip\" to the workers rather than paying them with money. A large number of those Irish-Americans who received the scrip used it to purchase canal-owned land at the northern end of the canal where it meets the south branch of the Chicago River. The original Bridgeport village, named \"Hardscrabble\", was centered around what is now the section of Throop Street north of 31st Street.Bridgeport also reflects its proximity to a bridge on the Chicago River, which was too low to allow safe passage for boats, forcing cargo to be unloaded there. Finley Peter Dunne later wrote about this area in popular sketches around the turn of the 20th century. Dunne's protagonist, Mr. Dooley, lived on \"Archey Road\" (present day Archer Avenue).\nAlthough the Irish are Bridgeport's oldest and arguably most famous ethnic group, Bridgeport has also been home to many other groups. Bridgeport has also been home to many Italian-Americans, as has its smaller neighbor to the east, Armour Square. Many Lithuanian-Americans settled along Lituanica Avenue, which runs between 31st Street and 38th Place one block west of Halsted Street in what was once called \"Lithuanian Downtown\" and the center of Lithuanian settlement in Chicago. More recently, large numbers of first and second generation Mexican-Americans and Chinese-Americans arrived. Like the 19th century Irish immigrants, they found affordable housing in Bridgeport and appreciated its proximity to their work.\nBridgeport's Polish history is most visibly represented in its two churches in the Polish Cathedral style: St. Mary of Perpetual Help, and St. Barbara. The Art Institute of Chicago performed restoration work on the paintings in the Shrine Altars at St. Mary of Perpetual Help which date back to 1890, with further plans calling for restoration of the stained glass windows and to complete the painting of the interior ceilings and rotunda.\nThe Chinese influence in Bridgeport has also followed in other ethnic groups in establishing neighborhood places of worship; the Ling Shen Ching Tze (真佛宗美) Buddhist Temple on West 31st Street was established in 1992.","Politics":"Bridgeport has been the home or birthplace of five mayors of Chicago, representing all but 10 years between 1933 and 2011, illustrating the neighborhood's influence on Chicago politics for most of the 20th century. These five men were Edward Joseph Kelly, mayor of Chicago from 1933 to 1947; Martin H. Kennelly, mayor of Chicago from 1947 to 1955; Richard J. Daley, mayor of Chicago from 1955 until his death in 1976; Michael A. Bilandic, initially appointed by City Council to finish Richard J. Daley's term as mayor, the former Bridgeport alderman won the special election in 1977 and served until 1979; and Richard M. Daley, mayor of Chicago from 1989 until 2011.\nKelly, Kennelly, the elder Daley, and Bilandic comprised an unbroken, 46-year period (1933–1979) in which Bridgeport was home to the city's mayor. Richard J. Daley is widely acknowledged as being the architect of the Chicago's 'machine politics' for a large part of the 20th century. Daley's base was rooted largely in Bridgeport's working-class Irish population with the 11th Ward as his vanguard. The 11th Ward Democratic party, which is headquartered in Bridgeport near 36th Street and Halsted, remains a stronghold of the Daley family today, until recently represented by Alderman Patrick Daley Thompson and still represented on the Cook County Board of Commissioners by his uncle John P. Daley. John Daley is also the Democratic Committeeman for the 11th ward. Alderman Thompson represents the third generation of the Daley family to serve in Chicago politics. He is the grandson of Richard J. Daley and the nephew of Richard M. Daley. Thompson was sworn into office in May 2015 (serving until a criminal conviction in February 2022 disqualified him from public office).\nIn the 2016 presidential election, Bridgeport went for Hillary Clinton over Donald Trump by a two-to-one margin. Residents cast 7,471 votes for Clinton, 2,859 votes for Trump, and approximately 550 ballots for third party candidates. In 2012, Barack Obama won Bridgeport by a larger margin of nearly three-to-one. The area cast 6,988 votes for Obama, 2,352 votes for Mitt Romney, and approximately 200 votes were cast for third party candidates.Bridgeport is represented in the Illinois Senate by Tony Muñoz and in the Illinois House of Representatives by Theresa Mah.","Education":"Chicago Public Schools operates several primary schools in Bridgeport: Mark Sheridan Academy, Philip D. Armour School, Robert Healy School, Charles N. Holden School, and George B. McClellan School. Neighborhood residents are zoned to Tilden High School in the Canaryville neighborhood just south of Bridgeport.Neighborhood Parochial elementary schools in Bridgeport operate under supervision of the Archdiocese of Chicago: Bridgeport Catholic Academy, Santa Lucia School, St. Jerome School, St. Mary School and St. Therese School Bridgeport Campus (formerly St Barbara School). In 2018 the archdiocese announced that St. Barbara School would merge into St. Therese as their respective parishes were also merging. In 2019 the St. Barbara School became the St. Therese Bridgeport campus.The Richard J. Daley Branch of the Chicago Public Library system is located at 3400 South Halsted Street.","Demographics":"According to an analysis by the Chicago Metropolitan Agency for Planning, there were 33,702 people and 13,339 households in Bridgeport. The racial makeup of the area was 34.2% White non-Hispanic, 3.0% African American, 39.6% Asian, 1.3% from other races. Hispanic or Latino of any race were 21.9% of the population. In the area, the population was spread out, with 20.2% under the age of 19, 25.9% from 20 to 34, 21.1% from 35 to 49, 19.6% from 50 to 64, and 13.2% who were 65 years of age or older. The median age was 37.5 years.The median household income was $54,915 compared to a median income of $58,247 for Chicago at-large. The area had an Income distribution in which 23.0% of households earned less than $25,000 annually; 23.0% of households earned between $25,000 and $49,999; 17.4% of households earned between $50,000 and $74,999; 11.3% of households earned between $75,000 and $99,999; 13.3% of households earned between $100,000 and $149,999 and 12.0% of households earned more than $150,000. This is compared to a distribution of 24.3%, 19.9%, 15.1%, 11.2%, 13.8% and 15.7% for Chicago at large.81.9% of Bridgeport residents have graduated from high school and 33.9% of residents have graduated with a Bachelor's degree or higher.","Economy":"Due to its position on the canal, Bridgeport became a major industrial center in Chicago at the beginning of the twentieth century. A July 2016 analysis by the University of Illinois at Chicago showed there are approximately 5,200 jobs within the community area. Manufacturing remains the top employing industry sector with 31.5% of those who work in Bridgeport holding such jobs. Manufacturing is followed by accommodation and food service (10.6%), retail trade (9.2%), finance (8.7%) and wholesale trade (8.1%). 39% of people who work in the Bridgeport community area reside outside of Chicago. The top 5 employing industry sectors of community residents are accommodation and food service (15.3%), healthcare (11.5%), professional (8.5%), education (8.4%), and retail trade (7.9%).","Culture":"In 2008 the Chicago Sun-Times listed Bridgeport as one of the four most ethnically diverse neighborhoods in Chicago, alongside Albany Park, West Ridge, and Rogers Park.\nA traditionally working-class neighborhood, with a diverse ethnic heritage, Bridgeport's cultural history has left an indelible mark on Chicago cuisine. While pizza is well represented in Bridgeport, it is the breaded-steak sandwich served by most of the neighborhood's pizzerias, that the neighborhood can claim as an original. Chinese and Mexican fare are also well represented, particularly along 31st Street, Halsted Street, and Archer Avenue. Bridgeport in the early 21st century has also begun to experience an upswing in new restaurants, with a few recent additions serving a wide range of items.The neighborhood is served by the Bridgeport News, a community newspaper delivered weekly on Wednesdays to homes throughout the neighborhood.","Television":"Fictional Chicago Police  Department Sergeant Hank Voight lives in Bridgeport.","Public transit":"The West part of the area is served by the CTA's Orange Line at the Halsted and Ashland stations, although Ashland is a few blocks outside of the neighborhood.The East part of the area is served by the Red Line CTA train at the Sox\/35th stop which is at Guaranteed Rate Field.","Notable residents":"Richard J. Daley, 38th Mayor of Chicago for a total of 21 years beginning on April 20, 1955, until his death on December 20, 1976.\nRichard M. Daley, 43rd Mayor of Chicago, tenure for 22 years; from 1989 to 2011.\nBenn Jordan, composer and recording artist\nEd Marszewski, publisher, artist and entrepreneur\nMartin Felsen, architect at UrbanLab\nMorgan M. Finley, Illinois State Senator and politician\nJonathan Sadowski, movie and TV actor\nJohn Vitek, Illinois State Representative\nMichelle Wu (born 1985), 55th Mayor of Boston. She was a resident of Bridgeport for a period of her childhood.\nShanZuo and DaHuang Zhou (known professionally as the Zhou Brothers), visual artists and founders\/directors of the Zhou B Art Center on 35th Street","References":"","External links":"City of Chicago Bridgeport Community Map\nImages Of America: Bridgeport (Arcadia Press)\nBridgeport's History"}]