[{"History":"After the expulsion of the Potawatomi, the land in what is now Brighton Park was platted and subdivided in anticipation of the opening of the Illinois-Michigan Canal. In the 1850s, private investors, notably John McCaffrey bought it with the hopes of turning it into a center of commerce. In 1851, the area was incorporated as a municipality. Named Brighton to invoke livestock markets in, among other places, the Brighton neighborhood of Boston and its livestock markets. Brighton Park had an active livestock market in the late 1850s, but it was overshadowed by the Union Stock Yards in the 1860s. In 1855, Chicago mayor \"Long\" John Wentworth built the Brighton Park horse racetrack (whose name conveniently alluded to the more famous Brighton Racecourse in England) directly east of the village, in what is now the Chicago Park District's McKinley Park. The Great Chicago Fire spared Brighton Park. In 1889, after Lake Township voted to allow for annexation, Brighton Park became part of the City of Chicago.By 1871, the year of the Great Chicago Fire, Brighton Park was served by the Archer Avenue horsecar and the Alton Railroad. (Brighton Park was not affected by the fire). The railroad built a roundhouse in the neighborhood, and various factories were built. Later the streetcar was electrified and extended and interurban electric railway service was provided by the Chicago and Joliet Electric Railway until 1934. Most of the residential buildings now in Brighton Park were built in the early part of the 20th century, between 1905 and 1925, after more electric streetcar lines (on Western Ave, Kedzie Ave, 35th St and 47th St) had been extended into the neighborhood, providing cheap and quick transport to work.\nBy the turn of the century, Brighton Park was becoming a destination for many European immigrants, particularly those arriving from Italy, Poland and Lithuania. The neighborhood's Polish identity was evidenced along Archer Avenue, which became the neighborhood's main street for Polish owned businesses.","Transportation":"Chicago's role as transportation gateway has always been a major influence on the demographics and economy of Brighton Park. Two major railroad landmarks exist in Brighton Park. The Corwith Intermodal freight facility, once known as Corwith Yards, covering nearly a square mile, is one of the major industrial features of Brighton Park.\nBrighton Park crossing, near Western Avenue and Archer Avenue, is a major Chicago railroad junction and the former site of Brighton Park's railway station.\nAccess to, property values, and economic growth in the neighborhood have been improved by the 1964 opening of the Stevenson Expressway, Interstate 55, the 1993 opening of the Orange Line rapid transit line, and the revitalization of the nearby Midway International Airport.","Government and infrastructure":"The United States Postal Service operates the Elsdon Post Office at 3124 West 47th Street. Post Office is closed as of June 2010. The neighborhood branch of the Chicago Public Library is located at 4314 South Archer Avenue.","Politics":"The Brighton Park community area has supported the Democratic Party in past presidential elections. In the 2016 presidential election, the Brighton Park cast 6,930 votes for Hillary Clinton and cast\n842 votes for Donald Trump (85.63% to 10.40%). In the 2012 presidential election, Brighton Park cast 5,699 votes for Barack Obama and cast 874 votes for Mitt Romney (85.47% to 13.11%).Portions of Brighton Park are located in the 12th, 14th, and 15th wards represented on the Chicago City Council by Julia Ramirez, Jeylú Gutiérrez, and Ray Lopez respectively. Lopez serves as the Democratic Committeemen for his ward, while Cook County Board of Review Commissioner George Cardenas serves as the Democratic Committeeman for the 12th war, and State Representative Aaron Ortiz serves as the Democratic Committeeman for the 14th ward. Rosa Pritchett is Lopez's Republican counterpart in the 15th ward while the 12th and 14th ward have no Republican committeeman.","Education":"Chicago Public Schools operate the following public schools: Burroughs School, CPS Brighton Park School, Calmeca Academy, Columbia Explorers School, N. Davis School, Gunsaulus Scholastic Academy, Shields Elementary, and Shields Middle School.\nThe Acero Charter School Network operates the Sandra Cisneros School, Acero Brighton Park School and the Officer Donald J. Marquez School in Brighton Park.","Notable people":"Edward J. Moskala (1921–1945), recipient of the Medal of Honor for his actions during the Battle of Okinawa in World War II. He resided at 3120 West 38th Street at the time of his enlistment.","See also":"","References":"","External links":"Official City of Chicago Brighton Park Community Map"}]