[{"Neighborhoods and sub-areas":"Historically, the Chatham community area consisted of three neighborhoods; Avalon Highlands, Chesterfield, and Chatham Fields. The community area also contains two districts listed on the National Register of Historic Places. In addition to two residential historic districts, Chatham is also the location of the Four Nineteen Building, a building which demonstrates the domestic style of gas station architecture, in which stations were designed to resemble small houses.","Garden Homes Historic District":"The Garden Homes Historic District is a residential district bound by South Wabash Avenue to the west, East 87th Street to the north, South Indiana Avenue to the east, and East 89th Street to the south. The district was listed on the National Register of Historic Places on February 28, 2005.","West Chatham Bungalow Historic District":"The West Chatham Bungalow Historic District is a residential district bound by South Perry Avenue to the east, West 82nd Street to the south, South Stewart Avenue to the west, and West 79th Street to the north. The district includes 283 Chicago bungalows built between 1913 and 1930 along with a smaller number of other residential buildings. The district was added to the National Register of Historic Places on April 19, 2010.","Demographics":"In the 1990 census, Chatham was found to be 1.0% White, 98.7% Black, 0.5% Hispanic, 0.1% Asian and 0.3% other.In the 2000 census, Chatham was found to be 0.32% White, 98.0% Black, 0.59% Hispanic, 0.06% Asian and 1.00% other. The median income was $37,809.","Transportation":"The CTA Red Line stations at 79th street and 87th street are in the Chatham community area. The Metra Electric District, which provides daily service between downtown Chicago at Millennium Station and the southern destinations of University Park and Blue Island, runs along the eastern border of Chatham and has stops at the 79th Street station, the 83rd Street station, and the 87th Street station.","Politics":"The Chatham community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Chatham cast 14,075 votes for Hillary Clinton and cast 230 votes for Donald Trump (96.91% to 1.58%). In the 2012 presidential election, Chatham cast 16,696 votes for Barack Obama and cast 93 votes for Mitt Romney (99.27% to 0.55%).","Notable people":"Ernie Banks (1931–2015), professional baseball player for the Chicago Cubs between 1953 and 1971. Banks resided at West 82nd Street and South Rhodes Avenue during his time in Chicago.\nChance the Rapper (born 1993), rapper, record producer, activist, and actor. He was raised in West Chatham.\nTaylor Bennett (born 1996), rapper, singer, and songwriter. He was raised in West Chatham.\nKeni Burke (born 1953), singer, songwriter, record producer, and multi-instrumentalist. He and his siblings, who made up the Five Stairsteps, were childhood residents of Chatham.\nRoland Burris (born 1937), U.S. Senator from Illinois from 2009 to 2010. He is a resident of Chatham.\nCharles Chew (1922–1986), member of the Illinois Senate from 1967 to his death in 1986. He resided at 8156 S Champlain Ave. during his political career.\nThomas A. Dorsey (1899–1993), composer recognized as the Father of Gospel Music.\nJohn P. Fardy (1922–1945), Corporal in the United States Marine Corps and recipient of the Medal of Honor. He was raised in Chatham at 8144 South Calumet Avenue.\nMahalia Jackson (1911–1972), gospel singer. She lived at 8358 South Indiana Avenue from 1956 until her death in 1972.\nR. Eugene Pincham (1925–2008), attorney, civil rights activist, and  Judge of the Illinois Appellate Court. He was a resident of Chatham.\nWelton Taylor (1919–2012), microbiologist, inventor and civil rights activist. He and his wife were the first Black couple to move to Chatham.\nMichael Wilbon, sports columnist for The Washington Post and host, commentator and analyst for ESPN.\nBrandon Breaux, multi-disciplinary artist","Education":"Chicago Public Schools operates public schools serving Chatham. The following schools serve students from the Chatham neighborhood.Secondary Schools\n\nSimeon Career AcademyPrimary Schools\n\nArthur R Ashe Elementary School\nArthur Dixon Elementary School\nJames E McDade Elementary Classical School\nJane A Neil Elementary School\nJohn T Pirie Fine Arts & Academic Center ES\nMartha Ruggles Elementary School\nOliver S Westcott Elementary School\nTed Lenart Regional Gifted Center","See also":"Lem's Bar-B-Q\nList of African-American neighborhoods\nHistory of African Americans in Chicago","References":"","External links":"Chatham-South Shore travel guide from Wikivoyage\nEncyclopedia.chicagohistory.org: Chatham\nOfficial City of Chicago Chatham Community Map"}]