[{"History":"","Etymology":"Some believe the origin of the term Loop is derived from the cable car, and especially those of two lines that shared a loop, constructed in 1882, bounded by Van Buren Street, Wabash Avenue, Wells Street, and Lake \nStreet .  Other research has concluded that \"the Loop\" was not used as a proper noun until after the 1895–97 construction of the Union elevated railway loop.","19th century":"In what is now the Loop, on the south bank of the Chicago River near today's Michigan Avenue Bridge, the United States Army erected Fort Dearborn in 1803, the first settlement in the area sponsored by the United States. When Chicago was initially platted in 1830 by the surveyor James Thompson, it included what is now the Loop north of Madison Street and west of State Street. The Sauganash Hotel, the first hotel in Chicago, was built in 1831 near Wolf Point at what is now the northwestern corner of the Loop. When Cook County was incorporated in 1831, the first meeting of its government was held at Fort Dearborn with two representatives from Chicago and one from Naperville. The entirety of what is now the Loop was part of the Town of Chicago when it was initially incorporated in 1833, except for the Fort Dearborn reservation that became part of the city in 1839 and land reclaimed from Lake Michigan.\nThe area was bustling by the end of the 1830s. Lake Street started to be a center for retail at that time, until it was eclipsed by State Street in the 1850s.","20th century":"By 1948 an estimated one million people came to and went from the Loop each day. Afterwards, suburbanization caused a decrease in the area's importance. Starting in the 1960s, however, the presence of an upscale shopping district caused the area's fortunes to increase.","21st century":"The Loop's population has boomed in recent years, having a 158 percent population increase between 2000 and 2020. Between 2010 and 2014, the number of jobs in The Loop increased by nearly 63,000 jobs, or an increase of over 13%.","Economy and employment":"The Loop, along with the rest of downtown Chicago, is the second largest commercial business district in the United States after New York City's Midtown Manhattan. Its financial district near LaSalle Street is home to United Airlines, Hyatt Hotels & Resorts, and CME Group's Chicago Board of Trade and Chicago Mercantile Exchange.\nAon Corporation maintains an office in the Aon Center. Chase Tower houses the headquarters of Exelon. United Airlines has its headquarters in Willis Tower, having moved its headquarters to Chicago from suburban Elk Grove Township in early 2007. Blue Cross and Blue Shield Association has its headquarters in the Michigan Plaza complex. Sidley Austin has an office in the Loop.The Chicago Loop Alliance is located at 55 West Monroe, the Chicagoland Chamber of Commerce is located in an office in the Aon Center, the French-American Chamber of Commerce in Chicago has an office in 35 East Wacker, the Netherlands Chamber of Commerce in the United States is located in an office at 303 East Wacker Drive, and the US Mexico Chamber of Commerce Mid-America Chapter is located in an office in One Prudential Plaza.McDonald's was headquartered in the Loop until 1971, when it moved to suburban Oak Brook. When Bank One Corporation existed, its headquarters were in the Bank One Plaza, which is now Chase Tower. When Amoco existed, its headquarters were in the Amoco Building, which is now the Aon Center.In 2019, about 40 percent of Loop residents were also employed in the Loop. 26.8 percent worked outside of Chicago. Respectively 11.5, 8.0, and 2.8 percent worked in the Near North Side, the Near West Side, and Hyde Park. Conversely, 45.5 percent of the people employed in the Loop lived outside of Chicago. Lake View housed 4 percent of Loop employees, the highest percentage of any of Chicago's community areas. The Near North Side, West Town, and Lincoln Park respectively housed 3.8, 2.6, and 2.5 percent of those working in the Loop.The professional sector is the largest source of employment of both Loop residents and Loop employees, at respectively 21.4 and 23.3 percent. Finance was the second most common employment for both groups, at respectively 13.5 and 17.7 percent. Health Care was the third largest sector for residents at 10.2 percent while Education was the third largest sector for Loop employees at 13 percent. Education was the fourth largest employer of residents at 9.4 percent while Public Administration was the fourth largest for Loop employees at 13 percent. Administration was the fifth largest sector for both groups, at respectively 6.9 and 7.3 percent.","Architecture":"The area has long been a hub for architecture. The vast majority of the area was destroyed by the Great Chicago Fire in 1871 but rebuilt quickly. In 1885 the Home Insurance Building, generally considered the world's first skyscraper, was constructed, followed by the development of the Chicago school best exemplified by such buildings as the Rookery Building in 1888, the Monadnock Building in 1891, and the Sullivan Center in 1899.\nLoop architecture has been dominated by skyscrapers and high-rises since early in its history. Notable buildings include the Home Insurance Building, considered the world's first skyscraper (demolished in 1931); the Chicago Board of Trade Building, a National Historic Landmark; and Willis Tower, the world's tallest building for nearly 25 years. Some of the historic buildings in this district were instrumental in the development of towers.\nThis area abounds in shopping opportunities, including the Loop Retail Historic District, although it competes with the more upscale Magnificent Mile area to the north. It includes Chicago's former Marshall Field's department store location in the Marshall Field and Company Building; the original Sullivan Center Carson Pirie Scott store location (closed February 21, 2007). Chicago's Downtown Theatre District is also found within this area, along with numerous restaurants and hotels.\nChicago has a famous skyline which features many of the tallest buildings in the world as well as the Chicago Landmark Historic Michigan Boulevard District. Chicago's skyline is spaced out throughout the downtown area. The Willis Tower, formerly known as the Sears Tower, the third tallest building in the Western Hemisphere (and still second-tallest by roof height), stands in the western Loop in the heart of the city's financial district, along with other buildings, such as 311 South Wacker Drive and the AT&T Corporate Center.\nChicago's fourth tallest building, the Aon Center, is located just south of Illinois Center.  The complex is at the east end of the Loop, east of Michigan Avenue. Two Prudential Plaza is also located here, just to the west of the Aon Center.\nThe Loop contains a wealth of outdoor sculpture, including works by Pablo Picasso, Joan Miró, Henry Moore, Marc Chagall, Magdalena Abakanowicz, Alexander Calder, and Jean Dubuffet. Chicago's cultural heavyweights, such as the Art Institute of Chicago, the Goodman Theatre, the Chicago Theatre, the Lyric Opera at the Civic Opera House building, and the Chicago Symphony Orchestra, are also in this area, as is the historic Palmer House Hilton hotel, found on East Monroe Street.\nChicago's waterfront, which is almost exclusively recreational beach and park areas from north to south, features Grant Park in the downtown area. Grant Park is the home of Buckingham Fountain, the Petrillo Music Shell, the Grant Park Symphony (where free concerts can be enjoyed throughout the summer), and Chicago's annual two-week food festival, the Taste of Chicago, where more than 3 million people try foods from over 70 vendors. The area also hosts the annual music festival Lollapalooza which features popular alternative rock, heavy metal, EDM, hip hop, and punk rock, artists. Millennium Park, which is a section of Grant Park, opened in the summer of 2004 and features Frank Gehry's Jay Pritzker Pavilion, Jaume Plensa's Crown Fountain, and Anish Kapoor's Cloud Gate sculpture along Lake Michigan.\nThe Chicago River and its accompanying Chicago Riverwalk, which delineates the area, also provides entertainment and recreational opportunities, including the annual dyeing of the river green in honor of St. Patrick's Day. Trips down the Chicago River, including architectural tours, by commercial boat operators, are great favorites with both locals and tourists alike.","Notable landmarks":"Agora, a group of sculptures at the south end of Grant Park.\nArt Institute of Chicago\nAuditorium Building\nBuckingham Fountain\nCarbide & Carbon Building\nCarson, Pirie, Scott and Company Building\nChicago Board of Trade Building\nChicago Theatre\nChicago Cultural Center\nChicago City Hall\nCivic Opera House\nCommercial National Bank Building\nField Building\nFine Arts Building\nGrant Park\nJewelers Row District\nMather Tower\nHistoric Michigan Boulevard District\nMonadnock Building\nThe Palmer House Hilton\nGreat Northern Hotel, Chicago\nPrinting House Row\nReliance Building\nRookery Building\nSymphony Center – home of the Chicago Symphony Orchestra\nWillis Tower – formerly the Sears Tower","Government":"The Loop is the seat of Chicago's city government. It is also the government seat of Cook County and houses an office for the governor of Illinois.  The city and county governments are situated in the same century-old building. Across the street, the Richard J. Daley Center accommodates a sculpture by Pablo Picasso and the state law courts. Given its proximity to government offices, the center's plaza serves as a kind of town square for celebrations, protests, and other events.\nThe Loop is in South Chicago Township within Cook County. Townships in Chicago were abolished for governmental purposes in 1902 but are still used for property assessment.The nearby James R. Thompson Center is the city headquarters for state government, with an office for the Governor.  Many state agencies have offices here, including the Illinois State Board of Education.A few blocks away is the Everett McKinley Dirksen United States Courthouse housing federal law courts and other federal government offices.  This is the seat of the United States Court of Appeals for the Seventh Circuit. The Kluczynski Federal Building is across the street.  The Federal Reserve Bank of Chicago is located on LaSalle Street in the heart of the financial district. The United States Postal Service operates the Loop Station Post Office at 211 South Clark Street.","Fire Department":"The Chicago Fire Department operates 3 Fire Stations in the Loop District:\n\nEngine Company 1, Aerial Tower Company 1, Ambulance 41 – 419 S. Wells St. – South Loop\nEngine Company 5, Truck Company 2, Special Operations Battalion Chief 5-1-5, Collapse Unit 5-2-1 – 324 S. Des Plaines St. – West Loop\/Near West Side\nEngine Company 13, Truck Company 6, Ambulance 74, Battalion Chief 1, Marine and Dive Operations: Training Officer 6-8-5, District Chief: Marine and Dive Operations 6-8-6, SCUBA Team 6-8-7 – 259 N. Columbus Dr. – East Loop\/Near East Side","Diplomatic missions":"Several countries maintain consulates in the Loop. They include Argentina, Australia, Canada, Costa Rica, the Czech Republic, Ecuador, El Salvador, France, Guatemala, Haiti, Hungary, Indonesia, Israel, the Republic of Macedonia, the Netherlands, Pakistan, Peru, the Philippines, South Africa, Turkey, and Venezuela. In addition, the Taipei Economic and Cultural Office of the Republic of China is in the Loop.","Politics":"","Local":"The Loop is currently a part of the 4th, 25th, 34th and 42nd wards of the Chicago City Council, which are represented by aldermen Sophia King, Byron Sigcho-Lopez, Bill Conway and Brendan Reilly.From the city's incorporation and division into wards in 1837 to 1992, the Loop as currently defined was at least partially contained within the 1st ward. From 1891 to 1992 it was entirely within the 1st ward and was coterminous with it between 1891 and 1901. It was while part of the 1st ward that it was represented by the Gray Wolves. The area has not had a Republican alderman since Francis P. Gleason served alongside Coughlin from 1895 to 1897. (Prior to 1923, each ward elected two aldermen in staggered two-year terms).\nIn the Cook County Board of Commissioners the eastern half of the area is part of the 3rd district, represented by Democrat Jerry Butler, while the western half is part of the 2nd district, represented by Democrat Dennis Deer.","State":"In the Illinois House of Representatives the community area is roughly evenly split lengthwise between, from east to west, Districts 26, 5, and 6, represented respectively by Democrats Kambium Buckner, Lamont Robinson, and Sonya Harper, with a minuscule portion in District 9 represented by Democrat Lakesia Collins.In the Illinois Senate most of the community area is in District 3, represented by Democrat Mattie Hunter, while a large part in the east is part of District 13, represented by Democrat Robert Peters, and a very small part in the west is part of District 5, represented by Democrat Patricia Van Pelt.","Federal":"The Loop community area has supported the Democratic Party in the past two presidential elections by large margins. In the 2016 presidential election, the Loop cast 11,141 votes for Hillary Clinton and cast 2,148 votes for Donald Trump (79.43% to 15.31%). In the 2012 presidential election, the Loop cast 8,134 votes for Barack Obama and cast 2,850 votes for Mitt Romney (72.26% to 25.32%).In the U.S. House of Representatives, the area is wholly within Illinois's 7th congressional district, which is the most Democratically leaning district in Illinois according to the Cook Partisan Voting Index with a score of D+38 and represented by Democrat Danny K. Davis.\nList of United States representatives representing the Loop since 1903Illinois's 1st congressional district (1903 – 1963):\n\nMartin Emerich, Democratic (March 4, 1903 – March 3, 1905)\nMartin B. Madden, Republican (March 4, 1905 – April 27, 1928)\nVacant (April 27, 1928 – March 3, 1929)\nOscar Stanton De Priest, Republican (March 4, 1929 – January 3, 1935)\nArthur W. Mitchell, Democratic (January 3, 1935 – January 3, 1943)\nWilliam L. Dawson, Democratic (January 3, 1943 – January 3, 1963)Illinois's 7th congressional district (1963–present):\n\nRoland V. Libonati, Democratic (January 3, 1963 – January 3, 1965)\nFrank Annunzio, Democratic (January 3, 1965 – January 3, 1973)\nVacant (January 3 – June 5, 1973)\nCardiss Collins, Democratic (June 5, 1973 – January 3, 1997)\nDanny K. Davis, Democratic (January 3, 1997 – present)","Transportation":"The Loop area derives its name from transportation networks present in it.","Public transportation":"Passenger lines reached seven Loop-area stations by the 1890s, with transfers from one to the other being a major business for taxi drivers prior to the advent of Amtrak in the 1970s and the majority of trains being concentrated at Chicago Union Station across the river in the Near West Side. The construction of a streetcar loop in 1882 and the elevated railway loop in the 1890s gave the area its name and cemented its dominance in the city.\nIn Metra the Millennium Station, which serves as the Chicago terminal of the Metra Electric District line that goes to University Park, and LaSalle Street Station, which serves as the Chicago terminal of the Rock Island District line bound for Joliet, are in the Loop. In addition to the terminals, the Van Buren Street station and Museum Campus\/11th Street station on the Electric District line are also in the Loop. All stations in the Loop are in Zone A for fare collection purposes. The interurban South Shore Line, which goes to South Bend, Indiana, has its Chicago terminal at Millennium Station.\nAll lines of the Chicago \"L\" except the Yellow Line serve the Loop area for at least some hours. The State Street Subway and Dearborn Street Subway, respectively parts of the Red Line and Blue Line, are present in the Loop area and offer 24\/7 service; the Red and Blue Lines are the only rapid transit lines in the United States outside of the New York City and Philadelphia metropolitan areas to offer such service. Bus Rapid Transit has been implemented in the Loop.","Private transportation and roads":"Chicago's address system has been standardized as beginning at the intersection of State and Madison Streets since September 1, 1909. Prior to that time, Chicago's street system was a hodgepodge of various systems which had resulted from the different municipalities that Chicago annexed in the late 19th century. The implementation of the new street system was delayed by two years in the Loop to allow businesses more time to acclimate to their new addresses.Several streets in the Loop have multiple levels, some as many as three. The most prominent of these is Wacker Drive, which faces the Chicago River throughout the area. Illinois Center neighborhood has three-level streets.\nThe eastern terminus of U.S. Route 66 (US 66), an iconic highway in the United States first charted in 1926, was located at Jackson Boulevard and Michigan Avenue. When Illinois and Missouri agreed that the local signage for US 66 should be replaced with that of Interstate 55 (I-55) as the highway was predominately north–south in those states, most signs of the former highway in Chicago were removed without incident but the final sign on the corner of Jackson and Michigan was removed with great fanfare on January 13, 1977, and replaced with a sign reading \"END OF ROUTE 66\".The first anti-parking ordinance of streets in the Loop was passed on May 1, 1918, in order to help streetcars, and had been advocated by Chicago Surface Lines. This law banned the parking of any vehicle between 7 and 10 a.m. and 4 and 7 p.m. on a street used by streetcars; approximately 1,000 violators of this law were arrested in the first month of the ordinance's enforcement. The La Salle Hotel's parking garage was the first high-rise parking garage in the Loop, constructed in 1917 at the corner of Washington and LaSalle Streets and remaining in service until its demolition in 2005. In the 1920s old buildings were purchased in the area and converted to parking structures. More high-rise garages and parking lots were constructed in the 1930s, which also saw the advent of double-deck parking. The first parking meters were installed in 1947 and private garages were regulated in 1957; they were banned outright in the Loop in the 1970s in response to federal air-quality standards. The first underground garages were built by the city in the early 1950s.All residences and places of employment within the Loop are in highly walkable areas; the Chicago Metropolitan Agency for Planning defines such areas based on population density, the length of city blocks, tree canopy cover, fatalities or grievous injuries incurred by pedestrians and bicyclists in the area, the density of intersections, and amenities located near the area. 33.3 percent of Loop residents walk or bike to work compared to 7.3 percent citywide. An additional 19.4 percent of Loop residents use transit for a daily commute, while 23.4 percent of residents citywide do. Just 22.2 percent of Loop residents drive to work alone or in a carpool, compared to 54.9 percent of all Chicago residents and 72.5 percent in the greater Chicago region. By household, 47.2 percent of Loop residents do not have access to a personal vehicle at all, compared to 26.4 percent citywide and 12.6 percent regionally.","Geography and neighborhoods":"The Loop is Community Area 32. In addition to the financial (West Loop–LaSalle Street Historic District), theatre, and jewelry (Jewelers Row District) districts, there are neighborhoods that are also part of the Loop community area.","New Eastside":"According to the 2010 census, 29,283 people live in the neighborhoods in or near the Loop. The median sale price for residential real estate was $710,000 in 2005 according to Forbes. In addition to the government, financial, theatre and shopping districts, there are neighborhoods that are also part of the Loop community area. For much of its history this Section was used for Illinois Central rail yards, including the IC's Great Central Station, with commercial buildings along Michigan Avenue. The New Eastside is a mixed-use district bordered by Michigan Avenue to the west, the Chicago River to the north, Randolph Street to the south, and Lake Shore Drive to the east. It encompasses the entire Illinois Center and Lakeshore East is the latest lead-developer of the 1969 Planned Development #70, as well as separate developments like Aon Center, Prudential Plaza, Park Millennium Condominium Building, Hyatt Regency Chicago, and the Fairmont Chicago, Millennium Park. The area has a triple-level street system and is bisected by Columbus Drive. Most of this district has been developed on land that was originally water and once used by the Illinois Central Railroad rail yards. The early buildings in this district such as the Aon Center and One Prudential Plaza used airspace rights in order to build above the railyards. The New Eastside Association of Residents (NEAR) has been the recognized community representative (Illinois non-profit corporation) since 1991 and is a 501(c)(3) IRS tax-exempt organization.\nThe triple-level street system allows for trucks to mainly travel and make deliveries on the lower levels, keeping traffic to a minimum on the upper levels. Through north–south traffic uses Middle Columbus and the bridge over the Chicago River. East–west through traffic uses either Middle Randolph or Upper and Middle Wacker between Michigan Avenue and Lake Shore Drive.","Printer's Row":"Printer's Row, also known as Printing House Row, is a neighborhood located in the southern portion of the Loop community area of Chicago. It is centered on Dearborn Street from Ida B. Wells Drive on the north to Polk Street on the south, and includes buildings along Plymouth Court on the east and Federal Street to the west. Most of the buildings in this area were built between 1886 and 1915 for house printing, publishing, and related businesses. Today, the buildings have mainly been converted into residential lofts. Part of Printer's Row is an official landmark district, called the Printing House Row District. The annual Printers Row Lit Fest is held in early June along Dearborn Street.","South Loop":"Most of the area south of Ida B. Wells Drive between Lake Michigan and the Chicago River, excepting Chinatown, is referred to as the South Loop. Perceptions of the southern boundary of the neighborhood have changed as development spread south, and the name is now used as far south as 26th Street.\nThe neighborhood includes former railyards that have been redeveloped as new-town-in-town such as Dearborn Park and Central Station. Former warehouses and factory lofts have been converted to residential buildings, while new townhouses and highrises have been developed on vacant or underused land. Dearborn Station at the south end of Printers Row, is the oldest train station still standing in Chicago; it has been converted to retail and office space. A major landowner in the South Loop is Columbia College Chicago, a private school that owns 17 buildings. \nSouth Loop is zoned to the following Chicago Schools: South Loop School and Phillips Academy High School. Jones College Prep High School, which is a selective enrollment prep school drawing students from the entire city, is also located in the South Loop.\nThe South Loop was historically home to vice districts, including the brothels, bars, burlesque theaters, and arcades. Inexpensive residential hotels on Van Buren and State Street made it one of the city's Skid Rows until the 1970s. One of the largest homeless shelters in the city, the Pacific Garden Mission, was located at State and Balbo from 1923 to 2007, when it moved to 1458 S. Canal St.","Historic Michigan Boulevard District":"The Loop also contains the Chicago Landmark Historic Michigan Boulevard District, which is the section of Michigan Avenue opposite Grant Park and Millennium Park.\nHistorical images and current architecture of the Chicago Loop can be found in Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.","Loop Retail Historic District":"The Loop Retail Historic District is a shopping district within the Chicago Loop community area in Cook County, Illinois, United States. It is bounded by Lake Street to the north, Ida B. Wells Drive to the south, State Street to the west and Wabash Avenue to the east. The district has the highest density of National Historic Landmark, National Register of Historic Places and Chicago Landmark designated buildings in Chicago. It hosts several historic buildings including former department store flagship locations Marshall Field and Company Building (now Macy's at State Street), and the Sullivan Center (formerly Carson, Pirie, Scott and Company Building).","Education":"","Colleges and universities":"Columbia College Chicago and Roosevelt University are all located in the Loop. DePaul University also has a campus in the Loop. The  University of Illinois at Urbana–Champaign and University of Notre Dame run their EMBA programs in their Chicago Campuses in the Loop.\nNational-Louis University is located in the historic Peoples Gas Building on Michigan Avenue across the street from the Art Institute of Chicago. The School of the Art Institute of Chicago, one of the nation's largest independent schools of art and design, is headquartered in Grant Park.\nHarold Washington College is a City Colleges of Chicago community college located in the Loop. Adler School of Professional Psychology is a college located in the Loop. Argosy University has its head offices on the thirteenth floor of 205 North Michigan Avenue in Michigan Plaza. Harrington College of Design is located at 200 West Madison Street after relocating from the Merchandise Mart. Trinity Christian College offers an accelerated teaching certification program at 1550 S. State Street in the South Loop.\nSpertus Institute, a center for Jewish learning & culture, is located at 610 S. Michigan Ave. Graduate level courses (Master and Doctorate) are offered in Jewish Studies, Jewish Professional Studies and Non-profit Management. Located at 180 North Wabash Avenue is Meadville Lombard Theological School which is affiliated with the Unitarian Universalist Association, a liberal, progressive seminary offering graduate-level theological and ministerial training. East-West University is located at 816 S Michigan Ave.","Primary and secondary schools":"Chicago Public Schools serves residents of the Loop. Some residents are zoned to the South Loop School, while some are zoned to the Ogden International School for grades K-8. Some residents are zoned to Phillips Academy High School, while others are zoned to Wells Community Academy High School. Any graduate from Ogden's 8th grade program may automatically move on to the 9th grade at Ogden, but students who did not graduate from Ogden's middle school must apply to the high school.Jones College Prep High School, a public selective enrollment school, is also located here.\nMuchin College Prep, a Noble Network of Charter Schools, is also located here, in the heart of Chicago on State Street.\nPrivate schools:\n\nBritish International School of Chicago, South Loop\nGEMS World Academy-Chicago","Parks and recreation":"The Loop has several parks.","Chicago Riverwalk":"The Chicago Riverwalk spans the southern edge of the Chicago River.","Grant Park":"Grant Park is located on the shores of Lake Michigan. Set aside in the late 19th century, it was originally known as \"Lake Park\" but was renamed for Civil War general and U.S. President Ulysses Grant. Buckingham Fountain was constructed in 1927 in Grant Park.","Maggie Daley Park":"Maggie Daley Park is located to the east of Millennium Park.","Millennium Park":"Millennium Park is located northwest of Grant Park. Originally intended to celebrate the new millennium, it opened in 2004.","Printer's Row Park":"Officially known as Park No. 543, this park is located in the Printer's Row neighborhood. It contains a community garden and an ornamental fountain.","Pritzker Park":"Pritzker Park is located on State Street near Harold Washington Library. It occupies the site of the Rialto Hotel, which was demolished in 1990. It is a green space developed by Ronald Jones and named for Cindy Pritzker. Originally constructed by the Chicago Department of Planning and Development, the Chicago Park District assumed control of it in 2008. It has  a short wall with quotes from famous writers and philosophers.","Theodore Roosevelt Park":"Theodore Roosevelt Park is located in the South Loop. Named for U.S. President Theodore Roosevelt, it was constructed beginning in 1980 as an adjunct to the Dearborn Park homes. It contains open space and three tennis courts. It is located on Roosevelt Road, also named for Roosevelt.","See also":"Looptopia","Notes":"","References":"","Bibliography":"\"Community Data Snapshot - The Loop\" (PDF). cmap.illinois.gov. Chicago Metropolitan Agency for Planning. June 2021. Retrieved August 1, 2021.\nLind, Alan R. (1974). Chicago Surface Lines: An Illustrated History. Park Forest, Illinois: Transport History Press.\nTeague, Tom (1991). Searching for 66. Springfield, Illinois: Samizdat House. ISBN 0-940859-09-2.","External links":"City of Chicago Loop Community Map\nChicago Collections Consortium\nChicago Loop Alliance\nGreater South Loop Association Archived May 11, 2021, at the Wayback Machine\nPrairie District Neighborhood Alliance"}]