[{"History":"The city of Chicago Lawn was founded by John F. Eberhart in 1871. Although it was annexed by the city of Chicago in 1889, it remained mostly farmland with some scattered settlements until the 1920s. Between 1920 and 1930 the population increased from 14,000 to 47,000. Residents of German and Irish descent began to move into the area from the Back of the Yards and Englewood neighborhoods. Poles, Bohemians, and Lithuanians followed them. Most new residents belonged to various Protestant denominations, but Chicago Lawn also was home to many Roman Catholic churches and schools. Today, there are six Catholic institutions that make up the Marquette Park Catholic Campus Council. Chicago Lawn was a thriving urban neighborhood as the Depression hit the nation and by 1940 its population had reached 49,291. In 1941, the National Biscuit Company announced plans to build a huge bakery in Chicago Lawn. When completed, this was the largest bakery in one location in the world. The size of the facility was doubled in the late 1990s.\nThe Lithuanian community has maintained a notable presence in the area by establishing a network of institutions that earned their community the label as the Lithuanian Gold Coast. They formed some of the richest savings and loans in the city. The Lithuanian Sisters of Saint Casimir founded Holy Cross Hospital in 1928 and Maria High School in 1952 (originally established as St. Casimir Academy in 1911). The Nativity of the Blessed Virgin Mary Church was established in 1927 on the corner of 69th Street and Washtenaw Avenue. It was founded as a Lithuanian national parish and services are still held in Lithuanian. An Art Deco monument was erected by Chicago's Lithuanian community in Marquette Park commemorating Lithuanian pilots Stasys Girėnas and Steponas Darius who died in the crash of the Lituanica in 1933.","Racial issues":"Chicago's changing racial demographics had a profound impact on Chicago Lawn. In the 1960s many of the white Americans had fled Englewood & West Englewood and Chicago Lawn became a target for civil rights groups' open housing marches during the Civil Rights Movement. In 1966, as part of the Chicago Freedom Movement, Martin Luther King Jr.  led a march into Marquette Park, where the marchers met a violent reaction. King himself was hit by a rock. Violence also erupted in the neighborhood when Gage Park High School attempted to integrate after Brown v. Board of Education (1954). The 1990 Census still showed non-Hispanic whites as the largest demographic group by race, comprising 43% of the population.\n\nHowever, over the next decade the racial composition of the neighborhood changed radically and by the 2000 Census African Americans had become the largest racial group comprising 53% of the population, with Hispanic and Non-Hispanic whites groups accounting for 35% and 10% respectively. There are also black Jewish and Palestinian communities in the neighborhood. Some Irish, Poles, and Lithuanians still remain too, although most have moved further south and west. Many of the Lithuanians and Poles have reestablished their communities in Lemont.","Arabs and Islamic community":"By the 1920s Arabs immigrated to Chicago, and political turmoil in the decades following the 1948 creation of Israel brought more Palestinian Muslims to Chicago. Arab families live in Chicago Lawn and Gage Park Neighborhoods. Arab community founded Chicago Islamic Center and Mosque on 63rd. Many Middle Eastern store and restaurant near Mosque area.  Arab families come from Palestine, Jordan, Syria, and Lebanon. In the 1950s, Palestinians with families moved out of their boardinghouses and shops and into apartments and homes just west of Chicago's \"Black Belt.\" By the 1970s, they formed a concentrated residential community in Gage Park and Chicago Lawn, on the South Side, and had established a business district with stores catering to Arab clientele.\nChicago's largest concentration of Palestinians still lives in these areas and in the communities to the south and west of them. In the 1980s, many upwardly mobile Palestinian families moved to the southwest suburbs, bringing significant Palestinian and Arab populations to Bridgeview, Alsip, Oak Lawn, Hickory Hills, Palos Hills. Alsalm Mosque Foundation is small place to worship, Palestinians built new Mosque Foundation in 1982 in Bridgeview.","Education":"Chicago Public Schools operates public schools in the neighborhood.\nAs of 2012 zoned K-8 schools and elementary schools serving sections of Chicago Lawn include Claremont, Eberhart, Fairfield, Marquette, McKay, Morrill, Tarkington, Tonti, Hernandez, and Sandoval.\nMost of the community is zoned to Gage Park High School. Some sections are zoned to Harper High School, Hubbard High School, and another high school. A small segment to the southwest is zoned to Bogan High School.The Chicago Public Library Chicago Lawn Branch, dedicated on December 1, 1960, serves the community.","Politics":"The Chicago Lawn community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Chicago Lawn cast 13,959 votes for Hillary Clinton and cast 609 votes for Donald Trump (93.87% to 4.10%). In the 2012 presidential election, Chicago Lawn cast 15,171 votes for Barack Obama and cast 682 votes for Mitt Romney (95.24% to 4.28%).","Notable residents":"Mike Disa (born 1965), film director, screenwriter, and animator. He was raised near Marquette Park.\nCarl L. Klein, member of the Illinois House of Representatives. He resided at 6428 South Francisco Avenue during his legislative tenure.\nTom McAvoy (1951–2019), Republican politician who served in the Illinois House of Representatives. The son of Walter McAvoy, he was a childhood resident of Chicago Lawn and resided there for a portion of his political career.\nMichael Madigan (born 1942), Speaker of the Illinois House of Representatives since 1995. He resided at 7146 South Campbell Avenue at the beginning of his political career.\nWalter C. McAvoy (1904–1990), Republican politician who served in the Illinois House of Representatives. He resided in Chicago Lawn during his political career.\nAlex Meneses (born 1965), actress and Playboy model best known for her roles on the television series Everybody Loves Raymond, Dr. Quinn, Medicine Woman and Telenovela. She was raised in Marquette Park.\nTony Piet (1906–1981), baseball player whose professional career included time with the Chicago White Sox.\nMichael Peña (born 1976), actor and musician, winner of an Imagen Awards for his portrayal of activist César Chávez in the film César Chávez. After living in Chicago's North Lawndale neighborhood, he and his family moved to Marquette Park in 1986.\nJohn C. Reilly (born 1965), actor and comedian, nominated for an Academy Award for performance in 2002 musical film Chicago. He was raised in Marquette Park.","References":"Notes\n\nFurther reading\n\nKathleen J. Headley. Images of America: Chicago Lawn\/Marquette Manor. Chicago: Tempus, Inc., 2001.\n\"Population change creates 'new' Chicago Lawn.\" New Communities Program. John D. and Catherine T. MacArthur, 2003. Accessed 30 Sept. 2009.","External links":"City of Chicago—Chicago Lawn Community Map\nChicago Park District—Marquette Park\nChicago's Marquette Park Area Community Website Archived 2017-09-12 at the Wayback Machine"}]