[{"History":"The history of Clearing begins shrouded in mystery. An anomalous subdivision began showing up in maps as early as 1870. Local author and historian Robert Hill calls this the \"Lost Village\". This subdivision appears between present day Nashville and Narragansett and between 59th and 63rd streets. Though when names appear, they are different from what they are currently. For example, Narragansett is Major.\nThe area gets its name from the fact that farm goods from the area were \"cleared\" (delivered) through the airport and railroad yards. Clearing was first incorporated as a town in 1912, within the Township of Stickney. The Clearing area quickly became a part of Chicago in 1915 because the growing population needed services provided by the city. It is bordered on the west by Harlem Avenue, on the north by railroad tracks just east of Cicero Ave., to the North by 59th street and to the south by 65th street. The southern portion of Midway Airport is in Clearing.\nThe Clearing Industrial District was founded in 1909.Lawler Park (6.2-acre (25,000 m2)), is located in Clearing. Created in 1947, Lawler Park is home to organized Little League softball, a brick recreation building, sandboxes, and other playground equipment. Hale Park and Nathan Hale Elementary School, at 61st and Melvina, are also located in Clearing. Hale Park is home to an outdoor swimming pool, field house, ball fields, and playground equipment.","Neighborhoods":"","Chrysler Village":"Chrysler Village is on the eastern edge of the Chicago neighborhood of Clearing nestled between Midway Airport and the Clearing Industrial District.  Beginning at Lavergne Avenue on the east and extending to Long Avenue on the West the sturdy brick single family, duplex and townhouse homes surround Lawler Park and were constructed in 1943 during World War II to house the Chrysler Defense Plant workers building the B29 Bomber Engines in the huge plant later housing the Ford Aircraft Engine Division, builders of the B52 Bomber Engines and now known as Ford City.","Politics":"Clearing has supported the Democratic nominee in the past two presidential elections. In the 2016 presidential election, Clearing cast 5,601 votes for Hillary Clinton and cast 3,139 votes for Donald Trump (61.37%-34.39%). In the 2012 presidential election, Clearing cast 5,147 votes for Barack Obama and cast 2,764 votes for Mitt Romney (64.19%-34.47%).","Religion":"The Roman Catholic Archdiocese of Chicago operates Catholic churches. On July 1, 2020, St. Rene Parish and St. Symphorosa Parish merged.","References":"","External links":"Official City of Chicago Clearing Community Map"}]