[{"Neighborhoods":"","Bronzeville":"Bronzeville is the area comprising the Douglas, Grand Boulevard, and Oakland communities on the South Side of Chicago, around the Illinois Institute of Technology, VanderCook College of Music, and Illinois College of Optometry. It is accessible via the Green and Red lines of the Chicago Transit Authority, as well as the Metra Electric District Main Line. In 2011, a new Metra station, Jones\/Bronzeville Station, opened to serve the neighborhood on the Rock Island and planned SouthEast Service.\nBronzeville is located in Chicago's 3rd ward, currently represented by Alderman Pat Dowell.\n\nIn the early 20th century, Bronzeville was known as the \"Black Metropolis\", one of the nation's most significant concentrations of African-American businesses, and culture. The groundbreaking Pekin Theatre rose near 27th street in the first decade of the 20th century.  \nBetween 1910 and 1920, during an early peak of the \"Great Migration\", the population of the area increased dramatically when thousands of black Americans escaped the de jure segregation and prejudice rife in the U.S.South and migrated to Chicago in search of industrial jobs. The Wabash YMCA is considered the first black Y in the U.S. It remains active today due to ongoing support from nearby black churches.  The Wabash YMCA's work to commemorate black culture was the genesis of Black History Month.In 1922, Louis B. Anderson, a Chicago alderman, had the architects Michaelsen & Rognstad build him a house at 3800 South Calumet Avenue. The surrounding area would take on the name of this house (which he had named Bronzeville).Key figures in the area include: Andrew \"Rube\" Foster, founder of the Negro National Baseball League; Ida B. Wells, a civil rights activist, journalist and co-organizer of the NAACP; Margaret Taylor-Burroughs, artist, author, and one of the co-founders of the DuSable Museum of African American History; Bessie Coleman, the first black woman pilot; Gwendolyn Brooks, poet laureate and first black American awarded the Pulitzer Prize, as well as, other acclaimed authors and artists of the Chicago Black Renaissance; actresses Susie Garrett, Marla Gibbs and Jennifer Beals; acclaimed R&B singers Minnie Riperton, Sam Cooke and Lou Rawls; and cornet player and jazz bandleader King Oliver. His protégé, jazz musician, trumpeter and bandleader Louis Armstrong from New Orleans and his wife Lil Hardin Armstrong, who was a pianist, composer and bandleader, lived in Bronzeville on E. 44th Street and performed at many of the area's night clubs, including the Sunset Cafe and Dreamland Cafe. The neighborhood includes the Chicago Landmark Black Metropolis-Bronzeville District.47th Street was and remains the hub of the Bronzeville neighborhood. In the early 21st century, it has started to regain some of its former glory. Gone for good is the Regal Theater (demolished in 1973), where many great performers took the stage. The Forum Hall building was built in 1897 designed by Chicago architect Samuel Atwater Treat (1839-1910) and may contain the oldest hardwood ballroom dance floor in Chicago. It filled  a significant role in Bronzeville's cultural scene, being the venue for famous musicians  From the 1940s and 1960s, high-rise public housing projects were constructed in the area, which were managed by the Chicago Housing Authority. The largest complex was the Robert Taylor Homes. They developed severe social problems exacerbated by concentrated poverty among the residents and poor design of the buildings. This project was demolished in the late 1990s and early 21st century. The nickname \"Bronzeville\" was first used for the area in 1930 by James J. Gentry, a local theater editor for the Chicago Bee publication. It refers to the brown skin color of black Americans, who predominated as residents in that area. It has become common usage over decades.The Bronzeville community features in various literary works set in Chicago, including Richard Wright's Native Son, Gwendolyn Brooks' A Street in Bronzeville, Lorraine Hansberry's stage play A Raisin the Sun, Leon Forrest's There is a Tree More Ancient than Eden [The Bloodworth Trilogy], Bayo Ojikutu's crime novel 47th Street Black, and Sara Paretsky's detective mystery Blacklist, part of the V. I. Warshawski series.\nHistorical images of Bronzeville are in Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.","Prairie Shores":"Originally a five-building, 1677-unit public housing project erected in 1962 by Michael Reese Hospital, Prairie Shores has been adapted as a market rate, middle-class community.  Along with the adjacent Lake Meadows development, this was part of the city's largest urban renewal project at the time of its inception in 1946. The total project included construction of the Illinois Institute of Technology and Mercy Hospital. The development was funded under the Title I of the Housing Act of 1949, using US$6.2 million ($60 million today) of subsidies.","Groveland Park":"Of all the sections of Douglas originally developed by Stephen A. Douglas, only Groveland Park survives. Its homes are built around an oval-shaped park. Groveland Park is located between Cottage Grove Avenue, 33rd Street, 35th Street and the Metra Electric railroad tracks.","Politics":"The Douglas community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Douglas cast 6,342 votes for Hillary Clinton and cast 187 votes for Donald Trump (97.13% to 2.80%). In the 2012 presidential election, Douglas cast 8,206 votes for Barack Obama and cast 158 votes for Mitt Romney (98.11% to 1.88%).","Transportation":"The Metra Electric District has a stop at East 27th Street.","Demographics":"","Education":"The following Chicago Public Schools campuses serve Bronzeville: Beethoven Elementary School, Phillips Academy High School, Dunbar Vocational High School, Bronzeville Scholastic Institute, Chicago Military Academy, and Walter H. Dyett High School.  Notable private schools include De La Salle High School and Hales Franciscan High School.\nYoung Women's Leadership Charter School, a charter school, is in the community area.Bronzeville is also home to the renowned Illinois Institute of Technology, which is famous for its engineering and architecture programs. It is home to the VanderCook College of Music and the Illinois College of Optometry. In 2006 the liberal arts school Shimer College, based on the Great Books, moved into the neighborhood.","Notable residents":"Ferdinand Lee Barnett (1852–1936), journalist, lawyer, and civil rights activist. He and his wife resided at 3624 South Martin Luther King Jr. Drive from 1919 to 1930.\nQuincy Jones (born 1933), record producer, musician, and songwriter. At the time of the 1940 United States Census, he resided with his family at 3548 South Prairie Avenue.\nR. Kelly (born 1967), singer, songwriter, record producer and convicted serial child sex abuser. He was a childhood resident of the Ida B. Wells Homes.\nRonnie Lester (born 1959), University of Iowa All American, NBA Player for Chicago Bulls and Los Angeles Lakers. He was a childhood resident of Stateway Gardens, a public housing project operated by the Chicago Housing Authority.\nArthur Wergs Mitchell (1883–1968), first black person elected as a Democrat to the United States House of Representatives. He resided at what is now 3637 S Dr Martin Luther King Jr Dr during his career representing Illinois's 1st congressional district.\nLou Rawls (1933–2006), singer, songwriter, actor, and record producer. He was a childhood resident of the Ida B. Wells Homes.\nMartin Roche (1853–1927), architect whose works include the Marquette Building and the Gage Group Buildings. He resided at 3614 South Martin Luther King Drive.\nMarshall \"Major\" Taylor (1878–1932), professional cyclist and first African American to win a world championship for cycling. He resided at the Wabash Avenue YMCA for the final two years of his life.\nNorman Teague, designer, artist, educator.\nIda B. Wells (1862–1931), journalist and civil rights activist. She and her husband resided at 3624 South Martin Luther King Jr. Drive from 1919 to 1930.","See also":"Black Metropolis","References":"","External links":"Official City of Chicago Douglas Community Map\nBronzeville Politics and Housing\n\"Laurence Fishburne and Larenz Tate Launch Riveting 'Bronzeville' Podcast\". The Black Youth Project. February 9, 2017. Retrieved September 22, 2017.\n\"Bronzeville: The Black Metropolis - Riots to Renaissance - DuSable to Obama - WTTW\". interactive.wttw.com. Archived from the original on October 27, 2016. Retrieved November 17, 2017."}]