[{"History":"","Before Non-Native Settlement":"East Garfield Park, along with all of Chicago, lies on the ancestral lands of indigenous tribes, including the Council of Three Fires—comprising the Ojibwe, Odawa and Potawatomi Nations]—and the Miami, Ho-Chunk, [Menominee]], Sac, Fox, Kickapoo and Illinois Nations.  On May 28, 1830, President Andrew Jackson signed the Indian Removal Act which forced the area's indigenous tribes to relocate west of the Mississippi River.","Early Development":"The East Garfield Park community was undeveloped prairie and farmland until the late 1860s, with residential growth in the area curtailed by limited transportation facilities and few public improvements to the area.In 1869, the area became part of Chicago when the land from current-day Western Avenue to Pulaski Road and from North Avenue to about 39th Street was annexed to the city by the state legislature.At the same time, the state legislature created three West Side parks, including a vast, 182-acre tract in the northwestern corner of the community, designated Central Park and later renamed to Garfield Park in 1885 to honor slain president James Garfield.Land speculators invested in the land adjacent to the park, and the horse-drawn car line on Madison Street was extended to the park. Wealthy Chicagoans, attracted by the park, built their homes along Washington Boulevard as well as in a small tract located between Kedzie and Central Park Avenue, Jackson Boulevard and Madison Street.Despite this momentum, it was not until the period from 1885 to 1914 that the community developed more rapidly. Triggers for growth included the completion of the Lake Street and Garfield Park branches of the elevated line and the electrification of the surface lines. In addition, industrial areas developed along the northern, eastern and southern borders where railroad tracks of many of the major rail lines of the time were located. Factories and warehouses were attracted to the area by the readily accessible rail transportation, lower land values and lower taxes. Workers were drawn to the area by the increase in economic activity and settled in the community.","Neighborhood Expansion":"By 1900, East Garfield Park was a growing residential community, with first and second generation Irish and some Germans living in brick cottages, two-flats and older frame structures. The housing built throughout the community represented a lesson well-learned from the 1871 Chicago Fire as brick and stone structures predominated.In 1905, Sears, Roebuck built a 55-acre complex near the community's southern section in neighboring North Lawndale, resulting in employment opportunities for East Garfield Park residents, increased land values and community stability.By 1920, the neighborhood had 56,269 residents with Russian Jews and Italians joining the early Irish and German residents. By the 1930s, Italians displaced the Irish and became the largest ethnic group in the area, with the Russian Jews being the third largest group. Black residents, constituting 3 percent of the population at the time, were concentrated in the northwestern corner of the community.In the 1920s, a prosperous commercial strip on Madison Street, anchored at Kedzie Avenue, emerged and provided a generation or more of residents with goods and services until competition from a regional shopping center at Madison and Pulaski Road drew customers away.In 1923, the Graemere Hotel opened in East Garfield Park. Located on the northeast corner of Homan Avenue and Washington Boulevard, across from Garfield Park, the building was designed by Walter W. Ahlschlager. The hotel soon became a favorite venue for weddings, bar mitzvahs, and other social gatherings. Wealthy people who enjoyed the convenience of hotel living became permanent residents. The most prominent of these was longtime West Side congressman Adolph Sabath.In a pattern common to many other areas, however, the growth in the community and other factors led some of the area's most affluent and some of its middle class residents to move to the suburbs, such as Oak Park and Maywood on the city's western boundary. A dip in the population was noticeable after 1930 as the total of 63,000 decreased to 58,000 in 1934.By 1940, overcrowded, substandard housing, along with increased social problems, typified community life. Vice, crime, juvenile delinquency and gangs increased, challenging social service agencies such as Marillac House and the Sears YMCA.","Post-World War II":"Following World War II, East Garfield Park experienced further declines in growth. Older housing stock deteriorated and neighborhood residents were displaced due to the construction of the Congress Street (now Eisenhower) Expressway.  The expressway passes east and west through the southern portion of the community.As industry depended less on rail service and more on truck transportation using the new expressways, many companies moved out of the city. In East Garfield Park, this trend was reflected in the gradual disappearance of the neighborhood's warehouse and manufacturing buildings. Industrial activities within East Garfield Park declined despite the presence of a large working class population, reflecting business choices to relocate where lower costs made operations more profitable.In the 1950s, public housing adjacent to and just north of the Expressway was constructed in East Garfield Park by the Chicago Housing Authority including Harrison Courts, built from 1950-52; Maplewood Courts, built from 1950-52; and Rockwell Gardens, a fifteen-acre project built from 1954-1961.African Americans had been leaving their homes in the south since the turn of the century and by mid-century, their numbers had dramatically changed Chicago's demographic data; East Garfield Park was no exception to that transformation.  By 1960, East Garfield Park demographics had changed considerably from earlier years, with black residents constituting 62 percent of the population. New Mexican and Puerto Rican immigrants had also joined the neighborhood, although the Italians remained the largest immigrant population in the area.In 1968, rioting in the aftermath of Martin Luther King, Jr.'s assassination destroyed almost all of the businesses along Madison as well as the area's commercial vitality. The city's main answer to the neighborhood's decline was to demolish scores of blighted buildings in a bid to improve public safety.By 1970, East Garfield Park suffered from stagnation and apathy. The commercial base of the community waned and the all-important Merchant's Bank at Kedzie and Madison closed, leaving only a small bank supported by area employer Sears at the community area's southern end. In 1973, Sears moved to the Sears Tower and most of the North Lawndale facility was vacated.  In 1978, the once beautiful and busy Graemere Hotel located in the East Garfield Park community was torn down.Community spirit rose quickly after the 1983 mayoral election and aldermanic elections brought increased community participation in its wake. A demand for improved city services accompanied more citizen involvement, led by community groups and block clubs. Especially active were the Midwest Community Council and Fifth City Development Project.More recently, the future of East Garfield Park is uncertain. The stagnation of yesteryear is apparent despite a strong working class core which has remained in place and active in churches and a confederation of block clubs. But efforts to reinvent and energize the community continue. In 2018, the community's chamber of commerce drafted a plan to reimagine Madison Street, filled with architectural renderings of shops — a coffeehouse, a grocery store, a hardware shop — with residences above them. As yet, the plan has not been implemented. Due to its many positive attributes, the neighborhood is a likely gentrification target for real estate developers, but the neighborhood is proactively developing plans to stave off the displacement that has fractured other communities across Chicago.","Demographics":"According to a 2022 Chicago Metropolitan Agency for Planning report citing 2020 data, there were 19,992 people and 7,828 households residing in the area.The racial makeup of the area was 5.90% White, 84.90% African American, 0.90% Asian, 3.50% from other races. Hispanic or Latino of any race were 4.80% of the population.Age distribution for the area is similar to other nearby communities, with 29.40% under the age of 19, 23.90% from 20 to 34, 19.20% from 35 to 49, 16.50% from 50 to 64, and 11.00% who were 65 years of age or older. The median age was 32.4, just below the Chicago median age, which was 34.8.\nThe median household income for the area was $23,067 as opposed to $62,097 for the city. The area's residents were disproportionately lower income with 52.0% of residents earned less than $25,000, 21.8% of residents earned between $25,000 and $49,999, 9.8% earned between $50,000 and $74,999, 5.4% earned between $75,000 and $99,999, 6.6% earned between $100,000 and $149,999, 4.4% earned $150,000 or more.\nThere were 7,447 residents in the labor force. In 2019, 18.4% of workers were employed in the healthcare industry, 10.0% were employed in retail, 12.5% were employed in administration, 8.9% worked in education, and 9.7% worked in hospitality and food services. The area had an unemployment rate of 19.0% during the analysis period.","Arts and culture":"Nearly 20% of the neighborhood is managed by the Chicago Park District, with Garfield Park occupying the northwest corner of the neighborhood. The neighborhood is home to the Garfield Park Conservatory, one of the largest conservatories in the United States.","Government":"The East Garfield Park community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, the East Garfield Park cast 6,690 votes for Hillary Clinton and cast 141 votes for Donald Trump (96.22% to 2.03%). In the 2012 presidential election, East Garfield Park cast 9,046 votes for Barack Obama and cast 100 votes for Mitt Romney (98.51% to 1.09%).","Education":"Chicago Public Schools operates district public schools.\nIn addition Urban Prep Academies operates the East Garfield Park Campus. Providence St. Mel School, a private school, is in East Garfield Park.","Infrastructure":"","Transportation":"Two of Chicago Transit Authority's train lines, the Blue Line and the Green Line, serves this neighborhood. The Green Line has stations at California, Kedzie, and Central Park Drive. The Blue Line has a station in the neighborhood in the median of the Eisenhower Expressway, Kedzie-Homan.\nThe neighborhood is also served by the CTA's bus service. East-west bus routes include 20 along Madison Street, 126 along Jackson Street, and 7 along Harrison Street. North-south bus routes include 94 along California Avenue, 52 along Kedzie Avenue, and 82 along Homan Avenue.","Notable people":"Lupe Fiasco (born 1982), Grammy Award-winning rapper & producer \nAlfonzo McKinnie (born 1992), professional basketball player, currently active for the Chicago Bulls\nLouis J. Sebille (1915–1950), pilot in the United States Army Air Forces and recipient of the Medal of Honor. He resided at 2840 West Washington Street.\nIsiah Thomas (born 1961), former professional basketball player and hall of famer, coach and sports analyst. He was a childhood resident of East Garfield Park living at 3340 West Congress Parkway.","See also":"Chicago portal\n Illinois portal","References":"","External links":"Official City of Chicago East Garfield Park Community Map"}]