[{"History":"East Side, until recently, was socially and economically dominated by the Calumet River and the jobs it supported. In fact, the community got its name from its location on the east side of the Calumet River, not because the neighborhood is located on the eastern side of the city. A cluster of riverside docks and slips allowed materials to be loaded and unloaded onto adjacent railroad lines, and the river itself was lined with steel mills. Republic Steel began operations along the river in 1901. The Republic mill was the site of frequent union unrest, culminating in the Memorial Day Massacre of 1937 and the successful drive by the United Steelworkers to organize the Chicago mills. The State Line Generating Plant was built in 1929 in bordering Hammond, Indiana, and closed in 2014.\nMany of the neighborhood's residents in this period were families of Slovenian, Croatian and Serbian heritage, who had emigrated from Europe to work in the steel mills and take related jobs. Especially after unionization, the neighborhood became a stronghold of the Chicago Democratic Party machine of Mayor Richard J. Daley. The neighborhood's longtime alderman, Edward Vrdolyak, became a noted Chicago \"power broker\" after the senior Daley's death. Today, the area is largely Hispanic.\nIn the 1950s, East Side was divided in two by the Chicago Skyway. The riverside steel mills and heavy industries went into serious decline between the 1970s and the 2000s, and are no longer the mainstay of the neighborhood.","Qualities":"Much of East Side's homes are the Chicago-style bungalow, and the southeast portion of East Side contains many newer homes built after 1980. Most of the neighborhood was built north of 108th Street by the 1930s, with expansion to the south occurring in the 1940s and 1950s as new industries opened up along the nearby Calumet River. There are proposed plans to expand East Side's Calumet Park and Beach, and to extend the existing lakefront bicycle path to new lakefront parklands in adjacent South Chicago, connecting Calumet Park to Rainbow Beach, the South Shore Cultural Center, and Jackson Park.","Boundaries":"East Side is bounded by Calumet River to the North and West, State Line Road (4100 E) to the East, and 126th street (12600 S) to the South.","Economy":"There are approximately 1,560 jobs in the East Side community area. East Side has a \"hardship index\" of 53.9 based on its levels of unemployment, education, per capita income level, poverty, crowded housing and dependency. This ranks in the middle of Chicago community areas. Poverty is roughly on-par with the Chicago citywide average, but crime is somewhat higher than average. The headquarters for the Port of Chicago, which operates Foreign Trade Zone #22, is located at 3600 East 95th Street.","Politics":"The East Side community area has voted overwhelmingly for the Democratic Party in the past two presidential elections. In the 2016 presidential election, East Side cast 4,818 votes for Hillary Clinton and cast 982 votes for Donald Trump. In the 2012 presidential election, East Side cast 4,417 votes for Barack Obama and cast 1,028 votes for Mitt Romney.","Schools":"East Side is served by both Catholic and Chicago Public Schools. Sadlowski Elementary, Taylor Elementary, Gallistel Elementary, Jane Addams Elementary and Washington Elementary are among the public elementary schools. George Washington High School is the neighborhood public high school. Annunciata Grammar School is the neighborhood's Catholic, private school and St. Francis De Sales is the neighborhood's Catholic, private high school. Many students of the East Side are enrolled in schools outside of the neighborhood. These may include Bishop Noll Institute in bordering Hammond, Indiana, De La Salle Institute in Chicago, Marian Catholic High School in Chicago Heights, Illinois, Mount Carmel High School and Mother McAuley High School.\nGeorge Washington High School is the neighborhood school for the East Side, Hegewisch, and South Deering neighborhoods. However, many residents from the East Side actually sent their children to selective enrollment high schools in Chicago, Illinois, due in part to gang violence the school faced, but in recent years, the reputation of George Washington High School has gradually risen due to the International Baccalaureate academic program.","Public transportation":"East Side is Metra territory, as the nearest Chicago Transit Authority train station is the 95th\/Dan Ryan terminal on the Red Line, 7 miles (11 km) northwest of the neighborhood. Residents utilize 93rd Street station on the Metra Electric District's South Chicago branch and Hegewisch station on the South Shore Line.  The Burnham Greenway Trail travels  under the Chicago Skyway, and then southward into the south suburban communities of Burnham and Calumet City.\nEast Side is also served by four CTA bus routes:\n\n26 South Shore Express\n30 South Chicago\n100 Jeffery Manor Express (weekday rush hours only)\nJ14 Jeffery Jump (No stops between 67th\/Jeffery and Columbus\/11th (Museum Campus); fewer stops between 100th and 67th. Weekdays, Sat, and Sun)","Trivia":"At the northeastern corner of the neighborhood, close to lake Michigan, stands a stone obelisk Illinois-Indiana State Line Boundary Marker to mark the northern end of the surveyed boundary line that separates  Illinois and Indiana.\nMost of the streets going north and south are named after the alphabet, with Avenue B closest to the Indiana state line and Avenue O closer to the Calumet River. The road which should have been called \"Avenue A\" is named State Line Road.\nLocal Chicagoans often refer to the entire Southeast Side area which includes East Side, South Shore, South Chicago, South Deering, Calumet Heights, and Hegewisch as \"the East Side\" in reference to Chicago's more established North, South, and West Sides.","Notable residents":"Clem Balanoff, member of the Illinois House of Representatives from 1989 to 1995. He was a resident of East Side during his legislative tenure.\nMiriam Balanoff, Cook County Circuit Judge.-\nG Herbo, rapper and songwriter\nFrank Murphy - pole vaulter who competed in the 1912 Summer Olympics.\nWilliam A. Rowan - member of the Chicago City Council (1927-1942) and U.S. Representative from Illinois (1943-1947). He resided at 10741 South Avenue B while a member of Congress.\nNick Svalina, former member of the Illinois House of Representatives. He resided at 10723 South Avenue F while a legislator.\nEdward Vrdolyak - lawyer and longtime member of the Chicago City Council who was head of the Cook County Democratic Party before running unsuccessfully for Mayor of Chicago as a member of the Illinois Solidarity Party and later as a Republican.","References":"","External links":"Official City of Chicago East Side Community Map"}]