[{"History":"","Early development":"Developers began buying up orchards and truck farms, and cutting down the dense woods in Lake View Township (of which Edgewater was a part) in the 1880s to make way for future development. From 1870 to 1887 the population of the township, then north of the City of Chicago, grew from 2,000 citizens to 45,000. As a result, there was growing need of more public-service access, and Lake View was annexed to Chicago in 1889 as a way of meeting those demands.In 1885, the northeastern section of Lake View was given the name Edgewater by prominent developer John Lewis Cochran. He built the first residential subdivision in the area. Many of his homes can still be found in the Lakewood Balmoral Historic District.  After a few years, Edgewater was celebrated as a wonder as it became \"the only electric lighted suburb adjacent to Chicago\".","Etymology of street names":"","Beginning of the 20th century":"By the early 1900s, Edgewater was regarded as one of Chicago's most prestigious communities. Mansions dominated the lakefront, while large single-family homes spread inland to the former farming village of Andersonville (then also called Somerdale).  A prominent symbol of Edgewater's affluence and desirable location on the lake was the Edgewater Beach Hotel, which opened in 1916 at 5349 N. Sheridan. The famed \"sunrise\" yellow hotel was razed in 1970, though the remaining \"sunset\" pink Edgewater Beach Apartments building is still a landmark at the north tip of Lake Shore Drive. The Edgewater building boom peaked in 1926 and property values reached their height in 1928. \nAround 1900, the burgeoning affluent population grew so much that developers expanded Edgewater and renamed a portion of the neighborhood community Uptown (which still exists today).  Uptown quickly became the commercial hub of the area, with storied nightlife, entertainment and tall commercial buildings.  Thus, in the late 1920s, when Community Areas were first designated, the Edgewater area was included as a section of Uptown.","Revival":"Uptown's affluence declined in the 1950s, as Chicago's suburbs were developed and opened, absorbing some of Uptown's families, both middle and upper class. With the flight of some residents came disrepair and crime for what once was one of the most affluent districts of the city. At the same time, with the extension of Lake Shore Drive to Hollywood Ave. in the 1950s, into the 1970s, highrise condominium developments along Edgewater's lakefront took off, and Andersonville was seeking to promote its unique heritage.\nIn 1980, the Chicago City Council and local business owners orchestrated a revival for the Edgewater community. Edgewater was separated from Uptown and once again called itself its own community. New businesses came into the community, older buildings were refurbished, and homes touched up to harken back to Edgewater's past. Since 2000, there have been several new additions to the neighborhood, including The Clarovista, Edgewater Glen, and Catalpa Gardens condominium developments.  This neighborhood of Chicago is also well known for its antique shops, as the Broadway Antique Market and Brownstone Antiques call the Edgewater area their home.","Neighborhoods":"Edgewater consists of several tight-knit neighborhoods. In the southwest quadrant is Andersonville. North of it is Magnolia Glen and Edgewater Glen—and Edgewater Beach is located in the eastern part of the neighborhood, the portion of the community that borders the lake, east of the elevated tracks of the Red Line.","Andersonville":"Andersonville is a neighborhood in western Edgewater \/ Uptown. Once a sleepy little village made up primarily of Swedish immigrants, the community is particularly known for its diversity, including a continued Swedish cultural presence led by the Swedish American Museum and other Swedish businesses. From the 1980s through the present time, the neighborhood has been well known as a neighborhood where many lesbians live, although the reality is more akin to the diversity mentioned above. Swedish businesses include the bar Simon's Tavern, a former basement speakeasy, which serves the Swedish wine drink as glögg, and Svea restaurants. At one time there were more Swedes in Chicago than any city outside of Stockholm. Many of Andersonville's Swedes were carpenters, contractors and architects, and played a significant role in building the city.A significant number of Middle-Eastern businesses and a new influx of families with children all make this a very diverse population. Andersonville is also known for its unique commercial district, made up almost entirely of a variety of independent locally owned specialty shops, restaurants, and service providers.\nThe Andersonville Commercial Historic District, which runs between 4900 and 5800 N. Clark Street, was added to the National Register of Historic Places in March 2010. It joined the nearby residential Lakewood Balmoral Historic District.\nThe approximate street boundaries of Andersonville, as defined by the Andersonville Chamber of Commerce, are Lawrence (4800 N) to the south, Victoria (5800 N) to the north, Ravenswood (1800 W) to the west, and Magnolia (1250 W) to the east. The heart of the Andersonville commercial district is Clark and Berwyn (5300 N).The stretch of Clark St. south of Foster Ave. (where Andersonville has expanded across community boundaries into northern Uptown) is sometimes called South Foster, or SoFo. One of the more famous craft beer taverns in Chicago, Hopleaf, has long been the anchor to this part of the SoFo area. It has more recently been joined by other food and beverage establishments, as well as the Chicago Magic Lounge.\nAndersonville's roots as a community extend well back into the 19th century, when immigrant Swedish farmers started moving north into what was then a distant suburb of Chicago. In the 1850s the area north of Foster and east of Clark was a large cherry orchard, and families had only begun to move into the fringes of what is now Andersonville. The neighborhood's first school, the Andersonville School, was built in 1854 at the corner of those two thoroughfares, and served as the area's primary school until 1908.\nAfter the Great Chicago Fire of 1871, wooden homes were outlawed in Chicago. Swedish immigrants, who could not afford to build homes of stone or brick, began to move outside of the city's northern limits. Swedish immigrants continued to arrive in Andersonville through the beginning of the 20th century, settling in the newly built homes surrounding Clark St. Before long, the entire commercial strip was dominated by Swedish businesses, from delis to hardware stores, shoe stores to blacksmiths, and bakeries to realty companies. The local churches, such as Immanuel Evangelical Lutheran Church, Ebenezer Lutheran Church, and First Evangelical Free Church were also built by Swedes, and reflected the religious diversity of the new arrivals.\nLike most other European-American ethnic groups, Swedes began to move to the suburbs during the Depression and post-war periods, and the neighborhood began to decline. Concerned about the deteriorating commercial situation, the Uptown Clark Street Business Association renewed its commitment to its Swedish heritage by renaming itself the Andersonville Chamber of Commerce. On October 17, 1964 Andersonville was rededicated in a ceremony attended by Chicago Mayor Richard J. Daley and Illinois Governor Otto Kerner. At about the same time, the annual Swedish tradition of celebrating the summer solstice blossomed into Midsommarfest, which has since grown into one of Chicago's largest street festivals.\nWhile some of the Swedish-owned businesses gave way to stores and restaurants owned by Koreans, Lebanese, and Cubans, many remained in Andersonville, serving the remaining second- and third-generation Swedes as well as the new arrivals to the neighborhood. In 1976, a Swedish American Museum that had been on the drawing boards for fifty years was opened to the public in a ceremony attended by King Carl XVI Gustaf of Sweden. He was also present when it later moved into larger quarters at 5211 N. Clark, where it remains today.\nIn the late 1980s, Andersonville began a period of revival as professionals rediscovered its lovely housing stock and proximity to the lakefront. A large lesbian and gay population developed, spurred by the opening of such businesses as Women & Children First, a bookstore focusing on feminist authors and topics. New gift shops and ethnic eateries opened up and gave Clark St. a new commercial vitality and diversity.\nToday, in addition to being one of the most concentrated areas of Swedish culture in the United States, Andersonville is home to a diverse assortment of devoted residents and businesses, including one of Chicago's largest LGBTQ+ communities, a collection of Middle Eastern restaurants and bakeries, and a thriving Hispanic commercial area north of Catalpa Avenue.","Edgewater Glen":"Edgewater Glen is located in the north central part of Edgewater.  It was named from the streets Glenwood Ave. and Glenlake Ave. that cross in the center of Edgewater Glen. A local residents and businesses organization called Edgewater Glen Association, incorporated in 1972, invented the name. The association, which is still active (2019), determined the boundaries of Edgewater Glen as: Granville (north), Broadway (east), Elmdale (south), and Clark\/Ashland (west).","Broadway":"Broadway (along with Andersonville's Clark St., to the west) is the main commercial street running North and South through Edgewater.  It separates the Edgewater Beach area (dominated by highrises and apartment buildings) to the east, from Andersonville and Edgewater Glen (dominated by single-family homes) to the west.  In the 1920s, Broadway became a center of the new automobile trade with elaborate stylized showroom buildings.  While these businesses are now gone, the street maintains commercial trade and at least one of those car palaces remains.  In addition, a wide array of dining is available including Ethiopian, French, Japanese, Thai, and fine American, as well as pubs, fast food, and pizza.","Sheridan Road and Edgewater Beach":"Sheridan Rd., which follows the lakefront in eastern-Edgewater is the main North–South thoroughfare for traffic to\/from Lake Shore Drive.  Lake Shore Dr. at Hollywood Ave. where all traffic is routed onto either Hollywood Ave. or Sheridan Rd. As it is the north end terminus of Chicago's scenic Lake Shore Dr., this part of the neighborhood is sometimes congested with traffic along 4 lane roadways such as Clark St., Broadway and Ridge Avenues. The area around Sheridan Rd., west to Broadway Ave., is called Edgewater Beach.  The neighborhood beaches are Foster Beach and Osterman (Hollywood) Beach.  This area includes the northern reaches of Lincoln Park, Chicago's largest public park.\nNorth of Ardmore Ave. (5800 N) to Devon Ave. (6400 N), there are 4 lakefront parks, Osterman (Hollywood) Beach, George Lane Park, Berger Park, and a newly unnamed park just south of Granville (6200 N) between the Tiara & El Lago condominiums. There is also a park on the southwest corner of Thorndale and Sheridan.\nAccompanied by uniformly tall, grand old locust trees lining the road, Edgewater's portion of Sheridan (North of Foster Ave., south of Devon Ave.) is a dense section of high-rise residential buildings on both sides of the Sheridan Rd. corridor.  These include, Park Edgewater Condominiums, Hollywood Towers, Horizon House Condominium, 6030 N. Sheridan, The Malibu, Malibu East, East Point Tower, The Tiara, El Lago, Granville Beach, Granville Tower, Shoreline Towers, Sheridan Shores Condominiums, Sheridan Point, and Park Tower and Mall. Many of these towers were built in the late 1950s to early 1970s. TV's fictional characters Bob and Emily Hartley of The Bob Newhart Show called this area home, residing in the Thorndale Beach North Condominiums, 5901 N. Sheridan Rd.\nThere are a handful of mansions still remaining on Sheridan Rd., remnants of the 1880s to 1920s. Many of the original lakefront mansions that once lined Sheridan were razed with landfill added along the shoreline to make way for the high-rise buildings that exist there today. A few notable exceptions are Colvin House, at Thorndale Ave., Berger Park. and Sacred Heart School at Granville Ave., as well as two belonging to nearby Loyola University Chicago. To the South, at Sheridan, near Foster, there also remains a private tennis, pool and three par golf club, from the days when this area was dominated by mansions and the Edgewater Beach Hotel.","LGBT community":"Beginning in the 1990s, Edgewater's population of lesbian couples significantly increased. Residents named the relocation of the Andersonville feminist bookstore Women and Children First from Lakeview as a major catalyst, though others also sought to escape gentrification in Lakeview and Lincoln Park. Lesbian bars and other lesbian-centered businesses opened in Andersonville, and for a period of time the neighborhood was sometimes referred to as \"Girlstown,\" an alternative to Boystown in Lakeview. However, by the late 2000s, rising rents and the subsequent closing of many of those businesses led to a decline in the lesbian population.At the time of the 2000 United States Census, the proportion of same-sex couples in Edgewater was 6.6% in the 60660 zip code and 8.0% in the 60640 zip code. This compares with the US national average of 1.1%. Starting in the 2000s, rising rent and gentrification in the Lakeview and Boystown neighborhoods caused many LGBT people to move further north. In 2012 Trulia rated Edgewater as one of the ten gayest neighborhoods in America. In 2017, Trulia and dating website OkCupid stated that Edgewater had the highest percentage of gay single people in the city, more than Lakeview and Hyde Park\/Kenwood.","International community":"Recognizing the proximity to Chicago's Lakefront and access to the Red Line elevated train, an influx of new residents have relocated to Edgewater over the past 20 years. Many of Edgewater's new residents are immigrants from the Horn of Africa and the former Yugoslavia. The area has a great density of Bosnian, Serb and Croat residents. These people, troubled by civil war and tough conditions in their homeland, have been encouraged to settle in the area. Ethiopians, Eritreans and Somalis from the Horn region live and socialize in Edgewater. The city is known for accepting new, thriving enclaves of ethnicities in centuries past. This new settlement is a modern revival of that tradition. Of recent, many new residents have come from the neighboring Lakeview and Lincoln Park neighborhoods, due to the affordable housing and Edgewater's proximity to the city's rapid transit (CTA) system which allows for an easy commute into the city's downtown. On the streets of Edgewater, one can encounter women in traditional dress and grandmothers strolling with their grandchildren, while the middle generation is out making a living in the new world of Chicago.","Politics":"The Edgewater community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Edgewater cast 22,676 votes for Hillary Clinton and cast 2,546 votes for Donald Trump (86.07% to 9.66%). In the 2012 presidential election, Edgewater cast 20,028 votes for Barack Obama and cast 3,083 votes for Mitt Romney (84.67% to 13.03%).","Education":"Edgewater is home to several Chicago Public Schools (CPS) campuses. The local public high school is Nicholas Senn High School, established in 1913. In addition, four of the neighborhood's elementary schools — Hayt, Swift, Peirce and Goudy — achieved a level 1 (excellent) status from CPS in 2013. Those schools feed into Senn, which will help it maintain its ranking.There are several Catholic and other religiously affiliated schools also in the neighborhood including Northside Catholic Academy's primary school campus at St. Gertrude church.\nLoyola University of Chicago's campus borders northeastern Edgewater and does have a few buildings south of Sheridan and east of Broadway, mostly dormitories.  The college established itself on the lake at the north end of Sheridan Road, where it crosses into Rogers Park, in 1906.","Notable people":"Ian Barford (born 1966), actor. He resides in Andersonville.\nHillary Clinton (born 1947), 67th United States Secretary of State. Her family resided in Edgewater until she was three years old at which point they moved to Park Ridge, Illinois.Dorothy Howell Rodham (1919–2011), homemaker and mother of Hillary Clinton. She resided in Edgewater until moving to Park Ridge, Illinois in 1950.\nHugh Rodham (1911–1993), businessman and father of Hillary Clinton. He resided in Edgewater before moving to Park Ridge, Illinois in 1950.\nLucas Neff (born 1985), actor best known for his lead role in Raising Hope. He was raised in Andersonville.\nKen Nordine (1921-2019), poet recording artist known for his series of Word Jazz albums. He lived in Edgewater from 1951 until his death in 2019. His former home, a 120-year-old mansion located at 6106 N. Kenmore Avenue, was granted prelimary historic status in March 2020.\nAnna D. Shapiro (born 1966), theatre director and professor. She resides in Andersonville.","Transportation":"A majority of Edgewater's public transportation needs are met by the Chicago Transit Authority, which provides resident and visitor access to the Red Line service of the Chicago Elevated railway rapid transit. The Red Line runs north to the city limits and south to Wrigley Field, the downtown Chicago Loop, Guaranteed Rate Field and ends on the South Side at 95th Street. Edgewater's elevated Red Line tracks run next to Broadway Avenue, and its four stations are Berwyn, Bryn Mawr, Thorndale, and Granville.Along Edgewater's western border are the commuter rail tracks of Metra's North Line, with stations in the nearby surrounding community areas at Ravenswood and Rogers Park providing transit to downtown or to Chicago's North Shore Suburbs.\nThe Chicago Transit Authority also operates numerous bus routes in Edgewater, with several running along North Lake Shore Drive with express services to downtown Chicago, including the Loop, via North Michigan Avenue and its Magnificent Mile.Private entities also offer many transportation services. The areas is served by car-sharing services such as I-GO and Zipcar as well as bicycle-sharing services such as Divvy. Taxi and limousine services are plentiful in the area. Bicycles and rickshaws can be found in the summer for rent near Foster Beach. Bike paths are also available on some major streets. Manicured walking and running paths are found throughout the parkland near the lake, including the Chicago Lakefront Trail, which is also popular with bicycle commuters.","References":"","External links":"Official City of Chicago Edgewater Community Map\nAndersonville Chamber of Commerce\nAndersonville neighborhood guide & map on ExploreChicago.org\nEdgewater neighborhood guide & map on ExploreChicago.org\nEdgewater Branch, Chicago Public Library\nEdgewater Chamber of Commerce\nEdgewater Historical Society\nEdgewater Historical Society eScrapbook\nEdgewater Glen Association\nEdgewater Community Council\nEdgewater Development Corporation\nIn Chicago, Village Life in a Big City - slideshow by The New York Times\nA Guide to Andersonville: Where to Eat, Shop, and Play\nSenn High School's Big Transformation"}]