[{"History":"Edison Park's settlement history dates back to 1834 and the arrival of pioneers John and Katherine Ebinger along with their 21-year-old son Christian Ebinger and his new bride, the former Barbara Ruehle. The Ebingers had emigrated from Stuttgart, Germany, to Ann Arbor, Michigan, and then to Chicago seeking suitable farmland, but had found it too swampy. As they traveled northwest from Chicago on the Indian trail to Milwaukee, Wisconsin (now Milwaukee Avenue), they crossed the North Branch of the Chicago River. However, their only horse was bitten by a snake and died, leaving them stranded. Consequently, the Ebingers decided to settle between what became Touhy and Devon Avenues. They laid claim to 80 acres around their single-story 12x14 foot cabin, and were soon joined by Christian's older brothers (Frederick and John) along with their sister Elizabeth and her husband John Plank. That area eventually became Niles Township, but as their joint families expanded, the Ebingers moved across Harlem Avenue into what became Maine Township. Barbara Ruehle Ebinger gave birth to a son, Christian Jr., in November 1834. He became the first white child born in the area, which became known as \"Dutchman's Point\" because of their German ancestry. The senior Christian Ebinger was a friend of local Native Americans in the area, among them Chief Blackhawk and Billy Caldwell. Christian Ebinger Jr. became the first minister to be ordained in their German Evangelical Association, and then was elected the Village Collector (1852), Village Assessor (1852-1865) and Highway Commissioner (1854-1858); he died in 1879, survived by seven children, including another Christian Ebinger.Eventually, Chicago grew and annexed part of Ebinger's homestead. Germans began moving into nearby Norwood Park (originally settled by English immigrants; but the German Evangelicals established a church as well as a Sunday School in the Ebinger home). Developers targeted the area circa 1868, Norwood Park incorporated out of Niles Township in 1874, and was annexed to Chicago in 1893. It was a stop on the Chicago and Milwaukee Railroad (later the Chicago and Northwestern Railroad line) before Park Ridge, Illinois (in Maine Township and also partly from what was once Ebinger property), and became a streetcar suburb in the 20th century. Today, its oldest church building, a frame construction dating from 1894 and now known as One Hope United Methodist Church, traces its ministry's beginnings to Christian Ebinger (Methodists having united with the historic United Brethren congregation circa 1960), and a modern Ebinger descendant became a Methodist pastor near Baltimore, Maryland.Adjacent to the north, Edison Park (originally known as \"Canfield\") also developed around an intermediate railway stop between Norwood Park and Park Ridge. It incorporated as a village in 1881 and developers promoted the availability of electricity; with the blessing of Thomas Alva Edison it renamed itself Edison Park in 1890. Chicago annexed Edison Park on November 8, 1910. A local public elementary school was named after Christian Ebinger. According to the 2000 Census discussed below, Edison Park's population is 11,259.","Demographics":"According to a 2016 analysis by the Chicago Metropolitan Agency for Planning, there were 11,208 people and 4,400 households in Edison Park. The racial makeup of the area was 87.3% White, 1.1% African American, 1.5% Asian, and 0.7% from other races. Hispanic or Latino residents of any race were 9.5% of the population. In the area, the population was spread out, with 21.9% under the age of 19, 19.5% from 20 to 34, 23.7% from 35 to 49, 19.6% from 50 to 64, and 15.2% who were 65 years of age or older. The median age was 39 years.The median household income was $86,300 compared to a median income of $47,831 for Chicago at-large. The area had an Income distribution in which 8.2% of households earned less than $25,000 annually; 19.7% of households earned between $25,000 and $49,999; 14.7% of households earned between $50,000 and $74,999; 16.4% of households earned between $75,000 and $99,999; 16.6% of households earned between $100,000 and $149,999 and 24.4% of households earned more than $150,000. This is compared to a distribution of 28.8%, 22.8%, 16.1%, 10.7%, 11.3% and 10.3% for Chicago at large.","Arts and  culture":"Edison Park Fest has been held in the area since 1972.Reaction (Chicago) released album \"Edison Park\" on January 15, 2015. The band explains the title was selected because Edison Park was \"the neighborhood in Chicago where we used to rehearse... It's a time in our lives when possibilities seemed endless.\" Their album cover features Edison Park's commuter Rail station.","Government":"Edison Park has narrowly gone for the Democratic Party in the past two presidential elections. In the 2016 presidential election, Edison Park cast 2,910 votes for Hillary Clinton and cast 2,653 votes Donald Trump. In the 2012 presidential election, Edison Park cast 2,736 votes for Barack Obama and cast 2,525 votes for Mitt Romney.Edison Park is entirely within the 41st ward in the Chicago City Council, where it is represented by Alderman Anthony Napolitano, who is the only Republican member of the City Council as of 2019.","Infrastructure":"","Transportation":"The Union Pacific \/ Northwest Line has a station in the Edison Park community.","Notable people":"Adam Emory Albright, painter. He resided in Edison Park until moving to Warrenville, Illinois, later in life.\nLeonard Crunelle, sculptor and protege of Lorado Taft.\nJohn Mulroe, Democratic member of the Illinois Senate since 2011. He is a resident of Edison Park.\nAnthony Napolitano, alderman for Chicago's 41st ward since 2015. A resident, he is also the council sole Republican.\nMary O'Connor, alderman for Chicago's 41st ward from 2011 to 2015. She is an Edison Park resident and served as president of the local chamber of commerce prior to her tenure as alderman.\nThomas A. Pope (1894–1989), recipient of the Medal of Honor for conduct at the Battle of Hamel. He was a resident of Edison Park before moving to Woodland Hills in Los Angeles.\nTimothy P. Sheehan, Republican member of the United States House of Representatives from 1951 to 1959 and Republican candidate for Mayor of Chicago against Richard J. Daley in 1959.","References":"","External links":"Official City of Chicago Edison Park Community Map\nThe Northwest Chicago Historical Society's history of Edison Park\nEdison Park Chamber of Commerce\nHistory of Edison Park\nChicago Landmarks\nTurzak House\nChicago Park District\nBrooks Park\nOlympia Park"}]