[{"History":"Before 1850, Englewood was an oak forest with much swampland. In 1852 several railroad lines crossed at what became known as Junction Grove, stimulating the beginning of what we know today as Englewood. The Union Stock Yard provided employment to early residents. In 1868 Henry B. Lewis, a wool merchant in the Loop and Board of Education member, suggested a new name from his association with Englewood, New Jersey. In 1865, Junction Grove was annexed to the Town of Lake and to Chicago in 1889. The World's Columbian Exposition at nearby Jackson Park in 1893 led to real estate speculation and expansion of the community.The Englewood community was largely defined by the Englewood Shopping Center at 63rd & Halsted, a large pedestrian mall. The City, social services, and mall management worked with community leaders and groups to integrate the mall with the community. The goal was to make the mall a vital part of the community, and a central part of everyday life. It was the site of numerous community events, parades, outdoor concerts, live radio broadcasts and the like. This was spearheaded by the Englewood Business Men's Association and its director, Richard Drew. Mr. Drew died in 1978, and with his passing the Association lost its community focus. The Center subsequently lost its major anchor tenants, including Sears Roebuck, and became a collection of smaller merchants.\nIn 1999, Mayor Richard M. Daley announced a $256 million revitalization plan for the area. The keystone of the program is the relocation of Kennedy–King College to the former site of the Englewood Shopping Center. Shortly thereafter the city began an aggressive buyout and relocation program for mall merchants. The campus includes the Washburne Culinary Institute. Groundbreaking for the new, 40-acre (16 ha) campus occurred on November 9, 2005, and it opened in 2007.Digital images of Englewood can be found in Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.Englewood has a community parade every year, which is geared towards preparing it's deserving youth for a new school year. The Englewood Back To School Parade is held annually every 3rd Saturday in August.  The parade was founded by Willie Pittman in 1961. https:\/\/englewoodparade.org\/. Mr. Pittman is also known as the first black Plumber to be licensed in the City of Chicago and Pittman Plumbing still exists today.","Demographics":"In 2000, Englewood had a poverty rate of 44%, substantially higher than the overall poverty rate in Chicago of 20%.Based on census data collected by the city of Chicago in 2008–2012, the poverty rate for Englewood is 46.6% of households below poverty and 28% of people 16 years of age and older are unemployed.In 1960, Englewood had 67,216 African American residents who made up about 69% of its population. At the time most African Americans resided around 63rd Street. At the time the median income of Englewood was $5,579 ($55,187.54 adjusted for inflation).By 1980, the total population was 62,069, a loss of about 30,000 people in two decades; 99% of the people were black, and the white population was down to 818. Edward McClelland of NBC Chicago stated \"Not even ethnic cleansing in the Balkans achieved the levels of turnover that white flight in Chicago did.\"These communities have among the highest incidents of adolescent violence in the city, creating serious safety and public health concerns.","Transportation":"Halsted Street is a major thoroughfare in the neighborhood.\nBoth the Red Line (CTA) and Green Line (CTA) run through Englewood, as does the Dan Ryan Expressway (I-90 and I-94).\nThe railroad junction at Englewood, where Metra (the former Rock Island) crosses Norfolk Southern (the former Pennsylvania) has long been a cause of delay. In March 2010 a $133 million reconstruction project was announced which improved operations by replacing the diamond crossing between Metra and NS with an overpass for Metra. The project proposed by Chicago Region Environmental and Transportation Efficiency Program (CREATE) was completed in 2014.","Education":"Englewood is host to numerous publicly-operated educational institutions.  Primary and secondary schools are operated by Chicago Public Schools, while the community has post-secondary educational needs met at the Kennedy–King College, which was relocated to Englewood in 2005 as part of revitalization efforts in the neighborhood. A public high school, Englewood STEM High School, was opened in September 2019 to serve students in the surrounding area.","Politics":"The Englewood community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, the Englewood cast 8,646 votes for Hillary Clinton and cast 141 votes for Donald Trump (97.11% to 1.58%). In the 2012 presidential election, Englewood cast 12,344 votes for Barack Obama and cast 45 votes for Mitt Romney (99.53% to 0.36%).","Popular culture":"In 2018, Australian film director George Gittoes made a documentary about Englewood. The 2019 TV show South Side takes place in the area of Englewood.","Mental health":"The Mental Health Impact Assessment (MHIA) emphasizes mental health outcomes, including depression, anxiety, PTSD, ADHD, and substance abuse. Vacant foreclosed properties often lead to criminal activity, and the amendment aimed to hold banks accountable for security and painting such properties, reducing crime and improving the mental health of affected communities. According to a 2012 mental health impact assessment, Englewood faces various social and economic challenges, including high crime rates and limited access to public services, directly impacting residents' mental health. Community engagement in the MHIA pilot has helped gather input from the community. The findings and recommendations are presented in a policy letter to the Chicago City Council. The proposed amendment to the Vacant Buildings Ordinance was passed, indicating the successful integration of mental health considerations into policy decisions.","Notable people":"Jamie Foster Brown, magazine publisher, and her sister Stella Foster, who are both entertainment journalists\nMargaret Bonds, composer, pianist, arranger, and educator.\nYoung Chop, music producer.\nDerrick Rose, professional basketball player who has played for Chicago Bulls, currently playing for Memphis Grizzlies.\nAnthony Davis, professional basketball player who has played for the Los Angeles Lakers and New Orleans Pelicans.\nBina Deneen, First Lady of Illinois (1905–1913). She resided at 532 West 61st Place until it was destroyed during the \"Pineapple Primary\".\nCharles Deneen, 23rd Governor of Illinois (1905–1913) and later United States Senator (1925–1931). He resided at 532 West 61st Place until it was destroyed during the \"Pineapple Primary\".\nLil Durk, rapper, singer, and songwriter. He was raised in Englewood.\nKenny Golladay, NFL player.\nH.H. Holmes, serial killer and con artist who operated a \"murder castle\" at a corner of South Wallace Avenue and West 63rd Street. He was a resident of Englewood from 1886 to 1894.\nJennifer Hudson, singer and actress\nRichard Hunt, sculptor who served as Commissioner of the Smithsonian Institution's National Museum of American Art from 1980 to 1986.\nHarold L. Ickes, 32nd United States Secretary of the Interior (1933–1946). He moved to Englewood as a child and attended Englewood High School.\nChief Keef, rapper and record producer.\nRalph Lewis, actor best known as Austin Stoneman in The Birth of a Nation.\nWillard Motley, African-American author. He was raised at 350 West 60th Street.\nBernie Mac, actor and comedian. He was raised in Englewood near West 69th Street and South Sangamon Street.\nJames Meeks (born 1956), pastor and former member of the Illinois Senate (2003-2013). He was raised in Englewood near West 64th Street and South Laflin Street.\nWilliam T. Murphy (1899–1978), member of Congress from Illinois's 3rd congressional district (1959–1971). He resided at 6617 South Harvard Avenue during his time in Congress.\nMorgan F. Murphy, member of Congress from Illinois's 3rd congressional district. He graduated from Leo High School.\nLil Reese, rapper\nFredo Santana, rapper.\nMavis Staples, singer\nFamous Dex, rapper\nKing Von, rapper","References":"","External links":"Official City of Chicago Englewood Community Map\nEnglewood Map during the 1920s–1930s"}]