[{"Neighborhoods":"","Edgebrook":"Edgebrook borders the neighborhood of Sauganash to the west and Forest Glen to the south. Edgebrook was once part of the Sauganash land tract known as Caldwell's Reserve, and was annexed by the city of Chicago in 1889. To the north of Edgebrook sits Wildwood and then North Edgebrook. Frequently the three communities together are referred to as Edgebrook.\nEdgebrook is roughly bordered by I-94 (the Edens Expressway) and the city limits to the east, the forest preserve and Niles to the west, the North Branch of the Chicago River to the south, and the Chicago city limits to the north.\nEdgebrook is home to the Billy Caldwell Golf Course and the Edgebrook Golf Course, both operated by the Cook County Forest Preserves, and Edgebrook Elementary School, which has consistently ranked highly among the many Chicago Public Schools in terms of standardized test performance. Edgebrook School's mascot is the Eagle.\nThe 84 Peterson and 85A North Central CTA bus routes serve the Edgebrook neighborhood. The Milwaukee District \/ North Line also has a stop in Edgebrook.\nAdditionally, the Edgebrook Branch of the Chicago Public Library system is located on Devon Avenue, in the heart of the Edgebrook neighborhood.","Old Edgebrook":"Old Edgebrook is a small area located between Central and Devon Avenues and the Edgebrook Golf Course, consisting of several blocks of large, stately homes originally built for railroad executives. The first homes here were built in the 1890s. Today, Old Edgebrook is an historical landmark district, surrounded on all sides by Cook County Forest Preserve land.","Indian Woods":"Sitting across the river and Central Avenue from Old Edgebrook, Indian Woods (South Edgebrook) is defined by Central Avenue to the west, the Edgebrook Woods Forest Preserve to the north and east, and Elston Avenue to the south. Indian Woods is originally part of the Forest Glen community area, but also located in the northern portion of Jefferson Park. It shares the 60646 (Edgebrook) ZIP Code. There are multiple unique wooden signs marking the Indian Woods community that have been in place for many decades.","Wildwood":"Part of Edgebrook, the Wildwood community is triangular in shape and is bordered by Lehigh Avenue, Caldwell Avenue (Route 14), Mendota Avenue, and Lightfoot Avenue. Wildwood Elementary School (affiliated with the Chicago Public Schools) serves parts of Edgebrook (west of Lehigh), Wildwood and North Edgebrook, and is highly rated. The Edgebrook Metra train station is located a little south of Wildwood near the intersection of Devon, Lehigh, and Caldwell Avenues.","North Edgebrook":"","Sauganash":"Sauganash was once part of the Sauganash land tract (Caldwell's Reserve) and was annexed by the city of Chicago in 1889. This neighborhood is named after Billy Caldwell, also known as Sauganash (meaning \"English speaking\").  Born to a Mohawk mother and an Irish father, William Caldwell Sr., a Captain of the British Butler Rangers, he became a leader of the Potawotomi. The \"Treaty Elm\" which stood until the 1930s was originally used in the first and second government surveys of the reserve. Sauganash negotiated with the United States on behalf of the United Nations of the Chippewa, Ottawa and Potawotomi.  In return for his services, the US gave him 1600 acres on the Chicago River.\nToday the neighborhood is home to three churches: Sauganash Community Church, a non-denominational Protestant church; Bride of Christ Church; and Queen of All Saints, a Roman Catholic Basilica. The Sauganash residential neighborhood has many distinctive homes. It also had large tracts of prairie land until the mid-1950s.\nThe Sauganash neighborhood is bordered by Devon Avenue to the north, Bryn Mawr Avenue to the south, the Edens Expressway (Interstate 94) to the west, and Pulaski Road to the east. Devon Avenue marks the northern boundary of the city limits of Chicago at this point. The suburb of Lincolnwood begins north of Devon Avenue.\nThe neighborhood of Sauganash Park lies east of the Valley Line trail.\nLaBagh Woods forest preserve is directly south of Sauganash.","Forest Glen":"A community of about 550 residences on the far Northwest side of the city of Chicago is often referred to as \"Chicago's Finest Community\". It is one of the oldest neighborhoods on the Northwest side, and is at the southern part of the official Chicago neighborhood's area of Forest Glen, which also contains Edgebrook and Sauganash. The first European American to settle Forest Glen was Civil War hero Captain William Hazelton of the 1st Cavalry Division. Captain Hazelton built a home in Forest Glen which still stands, and started a Sunday School that evolved into the First Congregational Church of Forest Glen. Hazelton also built the Glen's first barn at what is now Lawler and Elston.\nThe Forest Glen neighborhood is bordered by the Chicago River to the north, Foster Avenue to the south, Cicero Avenue to the east and Metra Milwaukee District North line to the west. Forest Glen shares its ZIP Code (60630) with Jefferson Park.","South Edgebrook":"The area commonly known as South Edgebrook is originally in the Forest Glen community area; but it now straddles the official Chicago neighborhoods of Jefferson Park and Norwood Park. South Edgebrook's borders are considered to be Devon Avenue to the north, Metra tracks and the Edgebrook Golf Course \/ Forest Preserve to the east, and Elston Avenue and Milwaukee Avenue to the south and west.  It is served by the 60646 (Edgebrook) ZIP Code.  Internet and atlas maps of Chicago's neighborhoods in recent years indicate a \"South Edgebrook\" located south of Caldwell Avenue and west of the Edens (I-94) Expressway by the Billy Caldwell Golf Course. This area however, is part of Edgebrook itself, and never had any additional designation.","Politics":"Forest Glen has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Forest Glen cast 5,753 votes for Hillary Clinton and cast 3,344 votes for Donald Trump. In the 2012 presidential election, Forest Glen cast 5,273 votes for Barack Obama and cast 3,592 votes for Mitt Romney.","Transportation":"Metra provides service to Union Station from two stops in Forest Glen on the Milwaukee District \/ North Line. Forest Glen station lies between Forest Glen and Elston Avenues, while Edgebrook station lies just to the north of the intersection of Caldwell, Devon, and Central Avenues.  The southern part of Forest Glen is also accessible from the Union Pacific \/ Northwest Line's stops in Jefferson Park and Gladstone Park. The Blue Line also serves Jefferson Park, providing service to O'Hare , downtown, and Forest Park.\nThe Edens Expressway (I-94) has a number of interchanges in Forest Glen:  in Edgebrook at Caldwell Avenue; at Touhy Avenue just outside Edgebrook\/Forest Glen's boundaries in Lincolnwood; just outside Forest Glen north to the North Shore suburbs and Milwaukee via the Foster Avenue on-ramp; and again just outside Forest Glen south to down town via the Elston Avenue on-ramp, just one city block south of Foster Avenue.","Notable people":"Rubén Castillo (born 1954), Chief Judge of the United States District Court for the Northern District of Illinois from 2013 to 2019. Castillo lived in Forest Glen at the time of his initial appointment to a federal judgeship in 1994.\nThomas G. Lyons (1931–2007), Chairman of the Cook County Democratic Party from 1990 to 1997. He resided at 6457 North Hiawatha Avenue while a member of the Illinois Senate.\nMitchell P. Kobelinski (1928–1997), 11th Administrator of the Small Business Administration during the Presidency of Gerald Ford. He was a Sauganash resident at the time of his death.\nMike Royko (1932–1997), author and Pulitzer Prize winning newspaper columnist. He moved to Sauganash from Lake View in the mid-1980s.\nHarry H. Semrow (1915–1987), postmaster of Chicago from 1961 to 1966. He resided at 6240 North Livermore Avenue while a member of the Illinois House of Representatives.","Education":"The local Chicago Public Schools primary schools include Edgebrook Elementary School, Wildwood School, Sauganash Elementary School, Beard Elementary(In Big Oaks), Hitch Elementary (In Gladstone Park),  and Beaubien Elementary (In Jefferson Park). The local Catholic schools are at Queen of All Saints Basilica in Sauganash and St. Mary of the Woods Catholic Church in North Edgebrook\/Wildwood. St. Cornelius school on Foster and Long closed in 2016. It eventually became the Chicago Public Schools Catalpa Early Childhood Center.\nThe Chicago Public Schools secondary school is William Howard Taft High School in Norwood Park, Chicago, although many residents of the neighborhood elect to attend either private schools or one of the City of Chicago-run selective schools. Private schools typically attended are Saint Ignatius College Prep, Loyola Academy, Notre Dame College Prep, or Regina Dominican High School. College preparatory, non-private schools include CICS Northtown Academy, a charter school that opened in 2002. Selective enrollment schools typically attended include Northside College Prep, Lane Tech, and Whitney Young Magnet High School.","References":"","External links":"Official City of Chicago Forest Glen Community Map\nThe Northwest Chicago Historical Society's History of Forest Glen\nOld Edgebrook District\nEdgebrook Community Association\nForest Glen Community Club\nSauganash Community Association\nQueen of All Saints Basilica; see also Wikipedia entry\nForgottenChicago.com's article on Old Edgebrook"}]