[{"History":"","19th century":"Fuller Park was part of Lake Township until it was annexed by Chicago in 1889.Many Irish Americans, many of whom worked for the railroads or stockyards, lived in Fuller Park after the American Civil War. In 1871, the Lake Shore and Michigan Southern Railway built a railroad roundhouse in the area.After the Great Chicago Fire in 1871, Chicago adopted stronger building codes and developers built beyond the city limits, including what is now Fuller Park, to evade them. This resulted in an increase in population in the area.In the 1890s, German and Austrian immigrants moved to the neighborhood.","20th century":"African Americans began moving into the area at the turn of the century, and along with Mexicans and Slavs had replaced the Irish and Germans by 1920. Migration of African Americans into the area continued in the 20th century, and the neighborhood went from 85 percent white in 1945 to 97 percent black in 1970.As a result of the reformist Settlement movement, which began in the early 1900s and aimed to improve life in poor urban areas, Fuller Park opened in 1912. The park featured a Greek Revival fieldhouse, designed by Daniel H. Burnham and Company.By 1950 a quarter of the neighborhood's residents still lacked indoor toilets. The Dan Ryan Expressway was built in the 1950s, dividing the neighborhood and displacing a third of its residents. The construction of Interstate Highway System also rendered the Union Stock Yards obsolete; they declined in the 1960s and closed in 1971, eliminating many jobs. In the 1980s Fuller Park obtained the fewest bank loans for home improvement in Chicago. Between 1969 and 2004 no new housing was constructed and only 12 permits for commercial development were issued.","21st century":"The Fuller Park fieldhouse and associated property was added to the National Register of Historic Places in 2002. The Eden Place Nature Center was established in 2003.","Geography":"Fuller Park is Community Area #37. It is one of Chicago's smallest community areas. It is a strip of land bounded by Pershing Road to the north; Garfield Boulevard to the south; the Dan Ryan Expressway and the Rock Island District commuter rail line of Metra to the east; and the Chicago & Western Indiana Railroad to the west. Fuller Park lies due south of Guaranteed Rate Field (formerly U.S. Cellular Field), where the Chicago White Sox play. The neighborhood is 5 miles (8.0 km) south of the Loop.","Demographics":"In 2018, 2,399 people in 1,097 households lived in Fuller Park. The racial composition was 89.12% Black, 3.54% white, 0.50% Asian, and 0.17% other races. Hispanics or Latinos of any race made up 6.63% of the population. The age range was such that 17.1% of the population was 19 and under, 18.1% was aged 20 to 34, 14.1% was aged 35 to 49, 22.8% was aged 50 to 64, and 28% was aged 65 or older. The median age was 50.5.Median household income was $22,920, compared to a citywide median of $55,198. The income distribution was such that 56% of households earned less than $25,000, 23.7% earned between $25,000 and $49,999, 10.7% earned between $50,000 and $74,999, 2.4% earned between $75,000 and $99,999, 7.0% earned between $100,000 and $149,999, and 0.2% earned more than $150,000. This compares with a citywide distribution of 25.4%, 20.5%, 15.6%, 11.0%, 13.2% and 14.3% respectively.Fuller Park is \"one of the worst neighborhoods in the city by almost every metric.\" Fuller Park is the Chicago neighborhood which experienced the largest decline in population over the sixty years from the city's peak population in 1950 to 2010; its population declined precipitously from 17,000 in 1950 to under 3,000 in 2010, an 83 percent decline. In 2013, Fuller Park has the highest \"hardship score\" (a combined index of various social and economic statistics) among all Chicago neighborhoods. Fuller Park had the city's highest unemployment rate (40 percent), the second-highest percentage of households below the poverty line (55.5 percent), and the second-lowest per-capita income ($9,016).  It was one of only two Chicago community areas with a per-capita income below $10,000. In late 2012, Fuller Park was also the only community area in which more than half the population was food-insecure. Fuller Park also rated the second-lowest in the city in trust in neighbors.According to an analysis of 2012 city data on rates of specific violent crimes (homicide, assault, battery, sexual assault, arson, and burglary), Fuller Park was the most dangerous of Chicago's 77 community areas, with a crime rate of 13,456 per 100,000 people.","Landmarks":"Fuller Park has the highest concentration of churches per 100,000 residents of any Chicago community area.The community of Fuller Park is also home to Eden Place Nature Center, an environmental education and urban ecology center located on three acres in Fuller Park. Eden Place opened in 2003 through the efforts of community activists. The center was built on formerly blighted brownfield land. In 2012, 14,000 people visited Eden Place, about half of them schoolchildren. The center has received many accolades; First Lady Michelle Obama hailed it as a \"success story,\" Illinois governor Pat Quinn honored its founder as an \"environmental hero,\" and the center was featured in a PBS documentary on community environmental activities in large urban areas.","Politics":"The Fuller Park community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, the Fuller Park cast 1,146 votes for Hillary Clinton and cast 24 votes for Donald Trump (96.71% to 2.03%). Despite Clinton's 94.68% margin of victory, it was only her 14th best finish in the City of Chicago. In the 2012 presidential election, Fuller Park cast 1,364 votes for Barack Obama and cast 10 votes for Mitt Romney (99.20% to 0.73%). Despite Obama's 98.47% margin of victory, it was only his 12th best finish in the City of Chicago.","References":"","Works cited":"\"Community Data Snapshot - Fuller Park\" (PDF). cmap.illinois.gov. Chicago Metropolitan Agency for Planning. June 2019. Retrieved April 22, 2020.","External links":"Official City of Chicago Fuller Park Community Map"}]