[{"History":"The development of Gage Park began in 1873 when South Park Commissioner George W. Gage began working on a planned park at the intersection of Western Ave. and Garfield Boulevard. Upon Gage's death in 1875, the park was renamed Gage Park in his honor.\nThe area developed after Gage's passing, slowly adding more and more land and offering up more services to the local community. By 1919, Gage Park had added more land and the park now included ball fields, tennis courts, separate men's and women's gymnasiums, gardens, and a wading pool. A large field house and auditorium was later added in 1928, with a large mural by Tom Lea added in 1931.\nOn February 4, 2016, the bodies of six people were discovered in a home on the 5700 block of South California Avenue.","Education":"Chicago Public Schools operates district public schools.\nK-8 schools serving sections of Gage Park include Morrill, Carson, Talman, Nightingale, Christopher, Fulton, Henderson, Sawyer, Tonti, Sandoval, and Hernandez.\nGage Park High School serves most of the community area. Some sections are served by Hubbard, Kelly, Curie, and Solorio high schools. Gage Park High School is located on South Rockwell Street, where 728 students attended during the 2013–2014 school year. Of the 728, 96.6% were from low-income households and 18.3% are homeless. The average ACT score in 2014 was 15.2 with the state average being 20.The United Neighborhood Organization operates the charter schools Rufino Tamayo School and Jovita Idar School.","Politics":"The Gage Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Gage Park cast 6,966 votes for Hillary Clinton and cast 494 votes for Donald Trump (90.44% to 6.41%). In the 2012 presidential election, Gage Park cast 5,725 votes for Barack Obama and cast 554 votes for Mitt Romney (90.27% to 8.74%).","Religion":"The Roman Catholic Archdiocese of Chicago operates Catholic churches. On July 1, 2020, St. Gall Parish will incorporate St. Simon the Apostle Parish into its structure, and St. Gall will be the main church of the merged entity. On the same day St. Rita of Cascia Parish will incorporate St. Clare of Montefalco, and the former will be the main church of the combined entity.","Notable people":"Victor Adeyanju, defensive end in the National Football League. Adeyanju, who lived in Gage Park from age seven until graduating high school, played for the St. Louis Rams from 2006 to 2010.\nWilliam T. Redmond, Republican member of the United States House of Representatives from New Mexico's 3rd congressional district from May 13, 1997 – January 3, 1999. He was raised in Gage Park and attended Gage Park High School.\nJames Adeyanju, defensive end in the National Collegiate Athletic Association. Adeyanju, who lived in Gage Park from birth until graduating high school, played for the University of Wisconsin–Madison Badgers from 2011 to 2014. He now lives in the San Francisco Bay Area.","References":"","External links":"Official City of Chicago Gage Park Community Map\nChicago Park District: Gage Park"}]