[{"History":"","Etymology":"The area is named for Garfield Boulevard and a ridge in the area from the glacial retreat of Lake Michigan. The area was formerly known as Archer Limits.","19th century":"The area was primarily used as a thoroughfare rather than a place of residence by both indigenous people and white settlers. Transportation through the area was done through Archer Road, the Illinois and Michigan Canal, and the Chicago and Alton Railroad. William B. Archer (for whom Archer Avenue is named) purchased 240 acres (97 ha) of land in the area in 1835, followed by John Wentworth in 1853. Other speculators purchased land in the area, as did farmers, but few maintained a permanent presence. The area's land was soggy and received limited agricultural development throughout the century. Some of the earliest settlers were Dutch farmers; by 1899 the Archer Avenue Reformed Church had moved from nearby Summit and comprised 275 parishioners. Chicago first annexed parts of the area in 1889.","20th century":"Industry started nearby around 1900 and would soon enter the area, prompting residential development. Early residential areas were concentrated in the northeastern part of the area, known at the time as \"Sleepy Hollow\". Chicago annexed more of the modern area in 1915 and 1921. Garfield Ridge was one of the 75 community areas defined by the University of Chicago during the 1920s.The population first had a major expansion in the 1920s, surging from 2,472 to 6,050. This was fueled by immigration of Eastern Europeans, especially Poles; by 1930 29.5 percent of the population was foreign-born and another 55.1 percent had at least one foreign parent. This was encouraged by development of industry, the addition of a streetcar line on Archer Avenue, and the construction of the Chicago Municipal Airport (renamed Midway Airport in 1942) in 1926. The area retained a bucolic quality; in 1936 the area west of Central Avenue still had dirt roads and farms with grazing animals. After a slowdown during the Great Depression growth continued, with the population nearly doubling during the 1940s and more than tripling during the 1950s. By 1950 residential development surpassed industrial development. During this era single-story bungalows were constructed in the western part of the area. The 1960 Census marked the first appearance of African-Americans in the area. At this time they solely inhabited the LeClaire Courts housing project, which had been constructed in 1950 and expanded in 1954.The population peaked at 42,998 in 1970. Loss of traffic at Midway in favor of O'Hare International Airport farther north caused a decline in jobs and population. Whites moved out while blacks and Hispanics from Little Village and Pilsen replaced them; as of the 2000 Census 77.3 percent of the area's population was white (over a third with Polish ancestry), 12.3 percent was black, and 16.5 percent was Hispanic.","Geography and neighborhoods":"Garfield Ridge is community area #56. It is located on Chicago's far southwest side, 10 miles (16 km) from the Loop.","LeClaire Courts":"LeClaire Courts was built in 1950 as the first integrated low-rise housing project in Chicago, and named for the pioneer Antoine Le Claire. The complex consisted of low-rise buildings and was predominantly occupied by African Americans. Considered one of the most attractive projects in the city, it accommodated several community resources and became the first project in the state to be managed by its residents in 1987. The residents were evicted in 2009 and the complex was demolished in 2011 to make way for a redevelopment into mixed-income housing; although the previous tenants were given a right to return to the new development, the site remained vacant as of 2016.","Demographics":"In 2017, 36,936 people in 12,160 households lived in Garfield Ridge. This represents an increase of 5.5 percent from the 2010 Census, which in turn had represented a 4.4 percent decline from the 2000 Census. The area's racial composition was 44.7 percent white, 4.4 percent African-American, and 1.9 percent other races. Hispanics or Latinos of any race made up 49 percent of the population. The age range was spread out, with 25.4 percent under the age of 19, 19.1 percent aged 20 to 34, 21.1 percent aged 35 to 49, 19.7 percent aged 50 to 64, 7.9 percent aged 65 to 74, 4.5 percent aged 75 to 84, and 2,3 percent older than 85 years old. The median age was 38.7. English was the sole language spoken at home for 52.7 percent of residents older than five years old. The remainder spoke a language other than English, and 17.7 percent spoke English less than \"very well\".Median household income was $68,212, compared to the citywide median income of $52,497. The income distribution was such that 15.2 percent of households earned less than $25,000, 21.0 percent earned between $25,000 and $49,999, 18.9 percent earned between $50,000 and $74,999, 12.5 percent earned between $75,000 and $99,999, 18.4 percent earned between $100,000 and $150,000, and 14.1 percent earned more than $150,000. This compares with a citywide distribution of 26.7 percent, 21.1 percent, 15.8 percent, 10.9 percent, 12.7 percent and 12.9 percent respectively.\nAs of September 2015, one census tract in the northeast corner of the area had a median household income of between $21,700 and $36,200, below the Department of Housing and Urban Development (HUD)'s very-low-income limit but above its extremely-low-income limit. Of the remaining census tracts, one in the southeast corner of the area had no data, four in the eastern half of the area had a median household income of between $36,200 and $57,900, below HUD's low-income limit and above its very low-income limit, and the remaining five had a median household income of between $57,900 and $86,900.Hardship index is a metric, used by Chicago, which takes six indicators of public health to quantify the relative amount of hardship in a community area. The indicators generate a score of one to 100, with a higher score indicating greater hardship. With data from 2006 to 2010, Garfield Ridge's hardship index was 32.","Politics":"","Local":"In the Chicago City Council, the northern third of Garfield Ridge is part of the 22nd Ward represented by Michael Rodriguez, while the middle third is part of the 14th Ward represented by Democrat Edward M. Burke and the southern third is part of the 23rd Ward represented by Silvana Tabares. In the Cook County Board of Commissioners, much of Garfield Ridge is part of the 11th district represented by John P. Daley, while some of the northern half is part of the 19th district represented by Jeffrey Tobolski, and the northeastern corner is part of the 7th district represented by Alma Anaya.","State":"In the Illinois House of Representatives, the northern part of Garfield Ridge is in District 21, represented by Democrat Celina Villanueva, while the southern part is in District 22, represented by Democrat Michael Madigan and the eastern part is in District 1 represented by Democrat Aaron M. Ortiz. In the Illinois Senate, the eastern part of Garfield Ridge is in District 1, represented by Democrat Antonio Muñoz while the western half is in District 11, represented by Democrat Martin A. Sandoval.","Federal":"Garfield Ridge has supported the Democratic nominee in the past two elections. In the 2016 presidential election, Garfield Ridge cast 9,237 votes for Hillary Clinton and cast 5,720 votes for Donald Trump (59.34% to 36.75%). In the 2012 presidential election, Garfield Ridge cast 8,999 votes for Barack Obama and cast 4,924 votes for Mitt Romney (63.60% to 34.80%).","Government":"","Courts and governance":"Garfield Ridge is in the third subcircuit of the Circuit Court of Cook County. With the rest of Chicago, it is part of the Circuit Court's first municipal district.\nWith the rest of Cook County, it is in the first judicial district of the Supreme Court of Illinois and the state's appellate courts. Garfield Ridge is in Stickney Township in Cook County. Townships in Chicago were abolished for governmental purposes in 1902, but are still used for property assessment.","Postal service":"The majority of Garfield Ridge is in ZIP Code 60638, but the northeastern portion is in ZIP Code 60632 and the southeastern portion is in ZIP Code 60629. The United States Postal Service operates the Clearing Post Office at 5645 South Archer Avenue.","Education":"Chicago Public Schools operates area public schools. K-8 schools serving the community area include Byrne, Hearst, Kinzie, and Mark Twain. Kennedy High School serves the community.The Roman Catholic Archdiocese of Chicago operates Catholic schools. St. Daniel the Prophet is a thriving school located in Garfield Ridge. St. Jane de Chantal School is in Garfield Ridge. In the 2015–2016 school year, the school had 281 students. This figure declined to 272, 245, and then 202 in subsequent school years. In total, from circa 2017 to 2020 the student population declined by 92. In the 2018–2019 school year it had 202 students and 20 employees, with 14 of them in the faculty. The archdiocese stated that the school could stay open if the community raised $357,000, but the community did not do so.","Notes":"","References":"","Works cited":"\"Community Data Snapshot – Garfield Ridge\" (PDF). cmap.illinois.gov. Chicago Metropolitan Agency for Planning. June 2019. Retrieved May 8, 2020.\nFehrenbacher, Don Edward (1957). Chicago Giant: a Biography of \"Long John\" Wentworth. Madison. American History Research Center.\nHill, Robert Milton (1983).  A Little Known Story of the Land Called Clearing.  RM Hill.\nScheu, Rachel; Garascia, Margaret (2016). \"Chicago Multifamily Market Characterization: Developing a Comprehensive Picture of the Multifamily Housing Landscape\" (PDF). Cityscape: A Journal of Policy Development and Research. Office of Policy Development and Research, U.S. Department of Housing and Urban Development. 18 (3): 265–276. Archived from the original (PDF) on June 30, 2017. Retrieved November 20, 2019.\nSwierenga, Robert P. (2002) Dutch Chicago : a history of the Hollanders in the Windy City.  Grand Rapids, Mich. : A.C. Van Raalte Institute, Hope College : W.B. Eerdmans Pub. Co\nLocal community fact book: Chicago metropolitan area.  Chicago.\nKott, Robert (2009). Summit. Chicago: Arcadia Pub.","External links":"Official City of Chicago Garfield Ridge Community Map"}]