[{"Bronzeville":"This is one of the two community areas that encompass the Bronzeville neighborhood, with the other being Douglas. Grand Boulevard also includes the Washington Park Court District neighborhood that was declared a Chicago Landmark on October 2, 1991.The Harold Washington Cultural Center is one of its newer and more famous buildings. It arose on the site that from the 1920s through the 1970s housed a famous center of African American cultural life, the Regal Theater. Among the other notable properties in this neighborhood are the Daniel Hale Williams House, the Robert S. Abbott House, and the Oscar Stanton De Priest House.","Demographics":"According to a 2018 US Census American Community Survey, there were 22,784 people and 10,383 households in Grand Boulevard. The racial makeup of the area was 92.56% African American, 2.70% White, 0.70% Asian, and 2.26% from other races. Hispanic or Latino residents of any race were 1.77% of the population. In the area, the population was spread out, with 27.3% under the age of 19, 19.4% from 20 to 34, 22.6% from 35 to 49, 16.4% from 50 to 64, and 14.3% who were 65 years of age or older. The median age was 36.9 years.","Education":"Grand Boulevard is part of City of Chicago School District #299 and City Colleges of Chicago District #508. The nearest City Colleges campus was Kennedy–King College in Englewood. A high school diploma had been earned by 85.5% of Grand Boulevard residents and a bachelor's degree or greater had been earned by 31.31% of residents compared to citywide figures of 82.3% and 35.6% respectively.","Transportation":"The Chicago Transit Authority operates the Chicago \"L\" system in the Grand Boulevard community area. The Green Line provides rapid transit at four stations: Indiana, 43rd Street, 47th Street and 51st Street stations.","Politics":"The Grand Boulevard community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, Grand Boulevard cast 10,081 votes for Hillary Clinton and cast 171 votes for Donald Trump. In the 2012 presidential election, Grand Boulevard cast 10,646 votes for Barack Obama and cast 81 votes for Mitt Romney.","Notable people":"Robert Sengstacke Abbott (1870–1940), founder of The Chicago Defender. He lived in Grand Boulevard from 1926 until his death in 1940.\nNoble Drew Ali (1886–1929), founder of the Moorish Science Temple of America. He resided at 3613 South Indiana Avenue at the time of his death.\nSol Bloom (1870–1949), Congressman from New York from 1923 until 1949. He resided at 4736 South Prairie  Avenue between 1897 and 1903.\nFloy Clements (1891–1973), first African American woman to serve in the Illinois House of Representatives. She moved to Grand Boulevard in the 1920s and lived there during her political career.\nBessie Coleman (1892–1926), first African-American woman and first Native American to hold a pilot's license. She resided at 4533 South Indiana Avenue prior to leaving for France to earn her pilot's license.\nMichael Colyar (born 1957), comedian and actor. He was raised at 4352 South State Street before his family moved to Morgan Park.\nClarence Darrow (1857–1938), attorney famous for his involvement in, among others, the Leopold and Loeb murder trial and the Scopes \"Monkey\" Trial. He resided at 4219 South Vincennes Avenue during his first marriage.\nOscar Stanton De Priest (1871–1951), first African-American member of the United States House of Representatives elected after the end of Reconstruction. The apartment building in which he lived from 1929 to 1951 was designated a National Historic Landmark in 1975.\nMichael Clarke Duncan (1957–2012), actor. He was raised in the Robert Taylor Homes.\nOpen Mike Eagle (born 1980), hip hop artist. He lived in the Robert Taylor Homes until the age of 13.\nRube Foster (1879–1930), baseball player, manager, and founder of the Negro National League. He resided at 4131 South Michigan Avenue from 1907 until 1926.\nMittie Gordon (1889–1961), founder of the Peace Movement of Ethiopia. At the time of her trial for conspiring with the Japanese in relation to the work of the P.M.E. she resided at 4451 South State Street.\nJohn R. Lynch (1847–1939), Congressman from Mississippi's 6th congressional district from 1873 to 1877 and 1882 to 1883. Lynch moved to Chicago in 1912 and resided at what is now 4028 S. Martin Luther King Dr. at the time of his death.\nThe Marx Brothers, comedians. During their early career, the family moved from New York City to an apartment at 4649 South Calumet Avenue. The family bought a house at 4512 South King Drive.Chico Marx (1887–1961)\nHarpo Marx (1888–1964)\nGroucho Marx (1890–1977)\nGummo Marx (1892–1977)\nZeppo Marx (1901–1979)\nEdward Morris (1866–1913), President of Morris & Company, a meatpacking company. In 1892, he and his wife moved to a house at 4500 South Michigan Avenue.\nHelen Swift Morris (1869–1945), wife of Edward Morris. She and her husband resided at a house at 4500 South Michigan Avenue\nGeorge W. Murray (1853–1926), Congressman from South Carolina from 1893 to 1897. He fled South Carolina after a racially motivated conviction and moved to Chicago in 1905. At the time of his death, he resided at 4752 S. Evans Ave.\nKirby Puckett (1960–2006), professional baseball player.\nEarl W. Renfroe (1907–2000), aviator and one of the first Black orthodontists in Illinois. In 1939, he resided at 4646 South Michigan Avenue.\nMr. T (born 1952), actor known for his roles as B. A. Baracus in The A-Team and Clubber Lang in Rocky III. He was raised in the Robert Taylor Homes.\nDaniel Hale Williams (1856–1931), surgeon who performed the first documented, successful pericardium surgery in the United States to repair a wound. His residence at 445 East 42nd Street was designated a National Historic Landmark in 1975.\nRichard Wright (1908–1960), author of novels, short stories, poems, and non-fiction. He resided at a second floor apartment at 4831 South Vincennes Avenue from 1929 until 1932.","External links":"Official City of Chicago Grand Boulevard Community Map\n Bronzeville travel guide from Wikivoyage\nBronzeville at Explore Chicago, The Official City of Chicago Tourism Website","References":""}]