[{"History":"","Etymology":"The name \"Grand Crossing\" comes from an 1853 right-of-way feud between the Lake Shore and Michigan Southern Railway and the Illinois Central Railroad that led to a frog war and a crash that killed 18 people. The crash was the result of Roswell B. Mason (later to serve as mayor of Chicago) illegally constructing railroad tracks, on behalf of the Illinois Central, across another railroad company's tracks. Due to the lack of safety at the crossing, trains made complete stops here and therefore industry developed around the area to cater to the railroad workers.","Nineteenth century":"The area was developed by Paul Cornell, the developer of what is now Hyde Park, Chicago, throughout the 1870s. Grade separation did not occur at the rail crossing until 1912. Greater Grand Crossing was historically a railroad suburb made up of five, independently developed, older ethnic neighborhoods. The Grand Crossing and Brookline neighborhoods were predominantly made up of German immigrant craftsmen, farmers and factory workers; Essex had residents of English, Irish and Scottish immigrants who worked for the railroads; Brookdale was settled mostly by Chicago-born residents employed in the building trades and by the railroads; and Park Manor, the last of these smaller neighborhoods to develop, had residents who were predominantly of east-coast Yankee stock.","Twentieth century":"At the start of the twentieth century, portions of Greater Grand Crossing like other neighborhoods in Chicago made the transition from open space and farmland to bungalow neighborhood.","Demographics":"By the 1930s, the railroad workers residing in the neighborhood were joined by Swedes and Italians. Throughout the next two decades, African Americans began moving into the neighborhood from the overcrowded Black Belt and that's when Grand Crossing's White residents began to move out of the neighborhood. During the 1950s, the Black population of the neighborhood rose from 6% to 86%.\nAccording to data from the 2014-2018 American Community Survey compiled by the Chicago Metropolitan Agency for Planning, there were 30,805 people and 12,230 households in Greater Grand Crossing. The racial makeup of the area was 1.1% White, 96.2% African American, and 1.5% from other races. Hispanic or Latino of any race were 1.2% of the population.In the area, the population was spread out, with 32.4% under the age of 19, 17.6% from 20 to 34, 18.6% from 35 to 49, 19.5% from 50 to 64, and 12.0% who were 65 years of age or older. The median age was 35.2 years compared to 34.3 years.","Transportation":"The CTA's Red Line provides 24\/7 service to Grand Crossing at the 69th Street and 79th Street stations. Additionally, the Metra Electric line provides commuter rail service at the 75th Street station at the intersection of East 75th Street and South Chicago Avenue; the railroad crossing that gave the neighborhood its name.","Politics":"The Greater Grand Crossing community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Greater Grand Crossing cast 12,647 votes for Hillary Clinton and cast 233 votes for Donald Trump (96.68% to 1.78%). Despite Clinton's 94.60% margin of victory, it was only her 16th best finish in the City of Chicago. In the 2012 presidential election, Greater Grand Crossing cast 15,408 votes for Barack Obama and cast 89 votes for Mitt Romney (99.23% to 0.57%). Despite Obama's 98.66% margin of victory, it was only his 11th best finish in the City of Chicago.","Notable people":"Dayvon \"King Von\" Bennett (1994–2020), rapper and songwriter. He was a resident of Parkway Gardens.\nGwendolyn Brooks (1917–2000), poet, author, and teacher who won the 1950 Pulitzer Prize for Poetry for Annie Allen. She resided at 7428 South Evans Avenue from 1953 until 1994.\nAl Capone (1899–1947), Capone purchased a residence at 7244 South Prairie Avenue in 1923, but shortly after moved to Cicero, Illinois.\nGary Comer (1927–2006), businessman and philanthropist who founded Land's End. He was a childhood resident of Grand Crossing.\nRobert Cooley (born 1943), Mafia attorney turned government informant and author of \"When Corruption Was King\". He was a childhood resident raised at 74th & Vernon.\nShani Davis (born 1982), first African American athlete to win a gold medal in an individual event at the Olympic Winter Games. He lived in Greater Grand Crossing until the age of 6 when his family moved to Rogers Park.\nWilton Daniel Gregory (born 1947), prelate of the Catholic Church and the first African-American cardinal. He was raised at 217 West 72nd Street.\nAlbert \"Sunnyland Slim\" Luandrew (1906–1995), blues pianist credited with making Chicago a center of the genre after World War II. He resided for a time at 368 East 69th Strett in the 1970s.\nMichelle Obama (born 1964), 51st First Lady of the United States (2009-2017). She was a childhood resident of the Parkway Garden Homes. The family moved to South Shore when she was two years old.\nLeroy Orange (born 1950), victim of police torture and one of four receipients of a pardon at the start of George Ryan's large-scale death penalty moratorium. He resided at 803 East 75th Street at the time of his conviction.\nCraig Robinson (born 1962), college basketball coach, basketball executive, and broadcaster. The brother of Michelle Obama, he was a childhood resident of Parkway Garden Homes. The family moved to South Shore when he was four years old.","Features":"The Oak Woods Cemetery, established in 1854,  is located in Greater Grand Crossing.\nSince 2006, Artist Theaster Gates has redeveloped several buildings in Grand Crossing as art and community centers.The community has since been redeveloped in slow progression and will be an historic landmark for future generations.","References":"Paral, Rob. \"Chicago Community Areas Historical Data\". Archived from the original on March 18, 2013. Retrieved August 29, 2012.\nProfile: Greater Grand Crossing by Jeanette Almada Chicago Tribune (October 7, 1998)","External links":"Official City of Chicago Greater Grand Crossing Community Map"}]