[{"History":"In 1837, Hegewisch, along with the area that now composes most of the South Side of Chicago, was incorporated as part of Hyde Park Township.In 1883, Adolph Hegewisch, president of U.S. Rolling Stock Company, selected the area to build a company town. He announced his ambition to build two canals. The first would have shortened the Calumet River; the second would connect Wolf Lake with Lake Michigan. His plans were never realized due to a lack of capital. In 1889, Hyde Park Township voted to be annexed into the City of Chicago. A few years after the area was annexed, Adolph Hegewisch died and his company was absorbed into the Pressed Steel Car Company.In the early 20th century, the area became home to a large number of steel mills. A large number of Polish immigrants came to Hegewisch to work in the steel mills. In the 1930s, the Steel Workers Organizing Committee became active in the area. Eventually, they were able to have Carnegie-Illinois Steel Company recognize the union. Emboldened, the union organized a strike against smaller steel companies. When workers attempted to march on Republic Steel, they were shot at by the Chicago Police Department. Ten unarmed workers died and hundreds were injured.Starting in the 1970s, employment in the steel industry began trending downward hurting areas that relied on steel mills. In 1980, Wisconsin Steel closed its South Deering mill, leading to high unemployment in the area. Further closures compounded this effect.During this decline, a variety of economic development projects were proposed. In 1990, Mayor Richard M. Daley proposed the Lake Calumet Airport, which would have resulted in the demolition of all of Hegewisch, along with portions of nearby Burnham and Calumet City. The airport faced staunch opposition from Hegewisch residents. After facing opposition from Illinois Senate president Pate Philip and concerns over the cost of the airport, Daley declared the airport proposal \"dead\" and focused on plans to expand O'Hare International Airport.Though Hegewisch suffered from the decline of heavy industry, the neighborhood did not witness the extreme devastation that other neighborhoods like South Chicago or Pullman did. Today, Hegewisch is a stable middle and working-class neighborhood, with roughly average levels of household income, and below-average crime and poverty (relative to the city of Chicago as a whole). A large number of city police and firefighters live in the neighborhood.","Geography":"The northern border of Hegewisch is 128th St. Its eastern border is the Illinois-Indiana state line. Its southern border is 138th street (Brainard Avenue) and its western border is (at various points) W Burley Ave, Torrence Ave, Bishop Ford Freeway.Hegewisch has more undeveloped land than anywhere else in Chicago with 475 acres of open space and 536 acres of vacant space. The developed land consists of 375 acres of single family residential housing, 34 acres of multifamily residential housing, 47 acres of commercial development, 308 acres of industrial development, 17 acres of institutional and 7 acres of mixed use development. There are 1,551 acres that can be defined as transportation and other.Wolf Lake is located in Hegewisch and is part of the William W. Powers State Recreation Area. Other natural amenities in the community include Mann Park and Powderhorn Prairie Marsh Nature Preserve.","Neighborhoods":"Hegewisch has three distinct areas within the neighborhood: Arizona, Avalon Trails, and Old Hegewisch.The oldest neighborhood is Old Hegewisch, the original area settled by Adolph Hegewisch in the nineteenth century. It includes the area north of 138th St, south of 130th St., east of Torrence Avenue, and west of Avenue O. Arizona, named because of the sandy nature of the original soil and presence of the native cactus, is east of Avenue O and north of 138th St. It is synonymous with \"the Avenues\". The Avenues receives its name from the unique street naming convention of alphabetically named streets (e.g. Avenue F, Avenue G, etc.). The newest neighborhood is Avalon Trails, built primarily in the 1960s. It is north of 130th Street, east of Torrence Avenue and west of Baltimore Avenue.Hegewisch also contains Chicago's only trailer park. Harbor Point Estates, located east of Avenue F. The trailer park is built on the former site of a landfill. As of 2014, it contains 190 manufactured houses and 50 recreational vehicles. The area has been the site of multiple redevelopment attempts including a 2008 attempt at converting the trailer park into a 900+ unit subdivision and a 2014 at an expansion of the park. The former was cancelled after the subprime mortgage crisis and, as of 2017, the latter has yet to come to fruition.","Demographics":"Originally a Polish American community, the area saw new groups arrive starting in the 1960s; Greek, Jordanian and Mexican immigrants began to settle in the area. In the 2000s, the community saw an influx of Latinos move in. The community went from have a population of 2,820 Latino residents in 2000 to a Latino-majority community with population of 4,887 Latino residents in 2014.According to a 2016 analysis by the Chicago Metropolitan Agency for Planning, there were 9,371 people and 3,558 households in Hegewisch. The racial makeup of the area was 42.5% White, 4.4% African American, 0.2% Asian, 0.6% from other races. Hispanic or Latino of any race were 52.4% of the population. In the area, the population was spread out, with 25.3% under the age of 19, 18.6% from 20 to 34, 17.8% from 35 to 49, 21.5% from 50 to 64, and 16.9% who were 65 years of age or older. The median age was 39 years.The median household income was $50,000 compared to a median income of $47,831 for Chicago at-large. The area had an Income distribution in which 26.6% of households earned less than $25,000 annually; 23.4% of households earned between $25,000 and $49,999; 17.2% of households earned between $50,000 and $74,999; 13.5% of households earned between $75,000 and $99,999; 11% of households earned between $100,000 and $149,999 and 8.2% of households earned more than $150,000. This is compared to a distribution of 28.8%, 22.8%, 16.1%, 10.7%, 11.3% and 10.3% for Chicago at large.","Economy":"There are approximately 2,550 jobs in the Hegewisch community area. The top employing industry sector in Hegewisch is manufacturing (47.5%). The Torrence Avenue Assembly Plant, the oldest continually-operated plant of the Ford Motor Company, is located at 12600 S Torrence Ave on its border with South Deering. Flex-N-Gate, which provides bumpers to the \"Big Three,\" will begin production near the Torrence Avenue Assembly Plant in 2019. In March 2017, it was announced that CRRC Sifang America would be manufacturing the new 7000 series cars for the Chicago \"L\" in Hegewisch. The union hall for  UAW Local 551 is headquartered on Torrence Avenue. It is also home to Calumet Harbor Lumber Company, the last surviving saw mill within the Chicago city limits, a distinction it has held for over a quarter century.Manufacturing is followed by wholesale trade (19.7%), retail trade (11.1%), accommodation and food (5.2%) and finance (3.9%). Almost two thirds of the workers in these fields reside outside of Chicago. The top 5 employing industry sectors of community residents are manufacturing (12%), public administration (10.9%), education (10.8%), healthcare (10.6%) and retail trade (8.5%). Nearly half of the workers in these fields reside outside of Chicago.KCBX Terminals, a petcoke processing facility owned by the Koch brothers is located in Hegewisch.","Education":"Hegewisch is part of City of Chicago School District #299 and City Colleges of Chicago District #508. Virgil I. Grissom and Henry Clay Elementary Schools serve Hegewisch students. George Washington High School in East Side serves Hegewisch students as well as students in nearby South Deering. The nearest City Colleges campus was Olive–Harvey College in Pullman. A high school diploma had been earned by 82% of Hegewisch residents and a bachelor's degree had been earned by 18.2% of residents.","Transportation":"The South Shore Line, an electric-powered interurban commuter rail line, stops at Hegewisch station. The train goes as far westbound as Millennium Station in the Chicago Loop and as far eastbound as South Bend Regional Airport in South Bend, Indiana. Hegewisch station is the Illinois stop closest to the Illinois-Indiana border.\nThe area is also served by bus routes operated by both the Chicago Transit Authority and Pace Suburban Bus.  These routes are 30 South Chicago, 355 Wentworth Limited, 358 Torrence and 364 159th Street. 355 Wentworth Limited is only available for weekday rush hour service only and 364 159th Street is only available for weekend service.\nAs part of the Chicago \"L\"'s Red Line extension, the proposed 130th Street terminal would be near the Altgeld Gardens Homes, a public housing project in the Riverdale neighborhood near Hegewisch.\nThe below average availability of public transit leads to its regular use by only 16% of Hegewisch outbound commuters. 80.80% of commuters drive either alone or in a carpool.","Politics":"Hegewisch has been part of Chicago's 10th ward since at least the 1960s. For much of the latter half of the twentieth century, it was dominated by Ed Vrdolyak, who served as the Democratic Ward Committeeman from 1968 to 1987 and Alderman from 1971 to 1987. The Hispanic Democratic Organization, a pro-Daley political action committee had a strong presence in the ward until its demise after the Hired Trucks scandal.The current alderman is Susan Sadlowski Garza, who has served since defeating John Pope in the 2015 runoff election.In the 2016 presidential election, Hegewisch cast 1,962 votes for Hillary Clinton and cast 1,135 votes for Donald Trump. In the 2012 presidential election, Hegewisch cast 1,944 votes for Barack Obama and 1,015 votes for Mitt Romney.","Local media":"Hegewisch is currently served by Our Neighborhood Times, a bimonthly newspaper headquarters in Hegewisch and widely distributed throughout the neighborhood. Between 1997 and 2012, Hegewisch was also served by the South Chicago-based Southeast Chicago Observer. The paper was distributed in Hegewisch, albeit to a lesser extent. Both papers come out on even-numbered weeks.","Notable people":"Eric Anderson, professional basketball player.\nGlenn Dawson, Democratic member of the Illinois General Assembly. He served in the Illinois House of Representatives from 1979 to 1981 and the Illinois Senate from 1981 to 1987. He lived in Hegewisch during his legislative tenure.\nCarmel Bernon Harvey, Jr., Specialist in the United States Army and recipient of the Medal of Honor. He is a namesake of nearby Olive–Harvey College.\nEugene Izzi, Chicago author.\nJohn Mallee, Major League Baseball hitting coach currently with the Philadelphia Phillies. Mallee was with the Chicago Cubs from 2014 to 2017. He was raised in the Hegewisch neighborhood.\nBattling Nelson, born Oskar Matthæus Nielsen, boxer who held the world lightweight championship on two separate occasions.\nSamuel Panayotovich, member of the Illinois House of Representatives from 1983 until 1989. He lived in Hegewisch during his time in office.\nJohn Pope, Alderman from Chicago's 10th ward from 1999 to 2015.\nEdward Sadlowski, labor activist and a past director of the United Steelworkers of America.\nSusie Sadlowski Garza, Alderman from Chicago's 10th ward from 2015 to 2019.\nPeter Chico, Alderman from Chicago's 10th ward since 2023.\nEdward Vrdolyak, Alderman from Chicago's 10th ward from 1971 to 1987. He resided in East Side, but was a dominant political figure in Hegewisch.\nEdward Joseph Winceniak, Baseball (born April 16, 1929) is a retired American professional baseball player and scout. He was born in Chicago, Illinois, and resided in Hegewisch, Illinois. An infielder, he appeared in 32 games played over parts of two seasons (1956–57) in Major League Baseball for the Chicago Cubs.","References":"","External links":"Official City of Chicago Hegewisch Community Map\nHegewisch.Net\nCity of Chicago Website"}]