[{"Boundaries and subsections":"The official community boundaries established by the City of Chicago include Bloomingdale Ave to the north, the Union Pacific railroad tracks to the south, the train tracks running between Kostner and Cicero to the west, and Humboldt Park proper to the east (to the East side of California Ave).\nIn contrast to the Humboldt Park Official Community Area, the Humboldt Park Neighborhood's borders include Western Avenue to the east, Pulaski Road to the west, North Avenue to the North, and the Union Pacific tracks to the south. The railyards southeast of Grand and Sacramento are also part of the community area. There are two distinct areas of Humboldt Park (the neighborhood): East Humboldt Park (In the West Town Community Area) and West Humboldt Park (In the Humboldt Park Community Area), divided by Sacramento Boulevard.","East Humboldt Park\/West Town":"East Humboldt Park is bordered by Sacramento Boulevard, Western Avenue, North Avenue and Division Street. Though it is considered a part of the Humboldt Park neighborhood, it is officially a part of the West Town community area. The area has been known for its working and lower middle class Puerto Rican community from the 1970s to the 2000s. The area has seen a large influx of White middle to upper middle class residents due to the process of gentrification, though parts of the neighborhood are still impoverished and still is known for high crime and gang activity. The area once had the largest middle class Puerto Rican community in the Midwest.The area is home to many social service institutions, bars, restaurants, cafes and shops as well as two sixty-foot Puerto Rican flags on a stretch of Division Street designated Paseo Boricua. Mayor Rahm Emanuel's sweeping school closings closed Von Humboldt Elementary, De Duprey Elementary, and Lafayette Elementary, leaving no neighborhood elementary schools in the area.","West Humboldt Park":"West Humboldt Park is the area west of Sacramento Boulevard. Many residents on this side of Humboldt Park are low-income working class residents.  Though in conventional terms the Humboldt Park neighborhood has been considered between Western Avenue, Pulaski Road, North Avenue, and Chicago Avenue. The area west of Pulaski until Kenton Avenue is considered West Humboldt Park as well.","K-Town":"K-Town is a nickname for an area in Humboldt Park, North Lawndale, and West Garfield Park between Pulaski Road and Cicero Avenue in which the names of many north–south avenues begin with the letter K (Keystone, Karlov, Kedvale, Keeler, Kenneth, Kilbourn, Kildare, Kolin, Kolmar, Komensky, Kostner, Kilpatrick, Kenton, Knox, and Keating). The pattern is a historical relic of a 1913 street-naming proposal, by which streets were to be systematically named according to their distance from the Illinois-Indiana border. K, the eleventh letter, was to be assigned to streets within the eleventh mile, counting west from the state line.\nThe eleventh mile is the easternmost area in which the plan was widely implemented, as many neighborhoods to the east were already developed and had street names in place. The portion of K-Town bounded by W. Cullerton St,  W. Cermak Rd, S. Kostner Ave, and S. Pulaski Rd was listed as a historic district on the National Register of Historic Places on September 9, 2010.","History":"The park was named for Alexander von Humboldt (1769–1859), a German naturalist and geographer, known as the \"Father of Environmentalism\", an early observer of human-induced climate change, was famed for his five-volume work Cosmos: Draft of a Physical Description of the World. His single visit to the United States in 1804 did not include Chicago, but citizens sponsored his monumental statue, unveiled in October 1892. Humboldt Park is part of Chicago's Boulevard Park System, which flanks the Loop with large parks linked with boulevards.\n\nThe park is lined with graystone houses and is no longer subject to landmark status restrictions on Kedzie Ave. The park itself has 3 major historical public buildings, including the Boat House (designed by Schmidt, Garden and Martin), the Field House (which received a 1.5 million dollar renovation grant, being implemented in 2013) and the Historic Stables (described more below).Chicago annexed most of the neighborhood in 1869, the year the park was laid out. Because the area lay just beyond the city's fire code jurisdiction, as set out after the 1871 fire, this made low cost construction possible.\nThe neighborhood has been a center for many ethnic groups since Chicago's inception:\nScandinavians (especially Norwegian and Danish, but also Swedish)\nEuropean Jews (approximately 1⁄4 of the community with a peak of 30,000 in the 1930s), Germans, & Italians\nPolish\nPuerto Ricans, Cubans, African Americans, Mexicans, and other LatinosThe currently abandoned Pioneer Trust and Savings Bank Building at the intersection of N. Pulaski\/North avenue was at one point one of the United States 300 largest commercial banks. In 1895, streetcars began operating along North avenue, once a bustling commercial hub, and would travel west down towards Pulaski. In 1911, streetcars began running on Pulaski itself, making this intersection in particular a nucleus of activity.","Our Lady of the Angels School fire":"Our Lady of the Angels School Fire occurred at the Our Lady of Angels School on December 1, 1958, on 909 North Avers Avenue in the Humboldt Park area. The school, which was operated by the Roman Catholic Archdiocese of Chicago, lost 92 students and three nuns in five classrooms on the second floor.","Recent history":"In 1980, Puerto Ricans were the largest ethnic group in Humboldt Park, with a majority in 42 census tracts in the Humboldt Park area. In 2009 Puerto Ricans were the largest ethnic presence in 11 census tracts in the Humboldt Park area.In the 1970s, Humboldt Park became more dangerous with high levels of gang activity, crime, and violence. The neighborhood was economically depressed, with housing values below the citywide average, until the recent upswing. Overcrowding remains a serious problem, as does gang activity and violent crime. Gentrification, beginning in the late 1990s, along with changing police tactics, and cultural, political and social organizations, have changed the demographics, politics, economy and rates of the area.Research indicates that as communities experience gentrification, new and more affluent residents push out legacy residents through higher property taxes, and interpersonal divestment in contributing to the culture of the neighborhood. New and more affluent residents in Humboldt Park prioritize community concerns. The previous poorer and non-White residents are often criminalized by these new residents who increasingly use law enforcement agencies.According to the Woodstock institute, 550 foreclosures in Humboldt Park during 2010 further decreased the Puerto Rican presence. Newer middle-class and wealthy White people, as well as working class Mexican people have shifted the Puerto Rican majority in Humboldt Park. Some Puerto Ricans that are upwardly mobile have left Humboldt Park, while others dispersed due to economic difficulty throughout the city, especially into the neighborhoods of Belmont Cragin, Hermosa, and Portage Park.  Many have dispersed throughout Cook County.","Gang activity and crime":"Humboldt Park is the founding grounds for several major gangs, including the Latin Kings, Maniac Latin Disciples, and Simon City Royals, among a number of other gangs with active chapters in the area. Many of these gangs were originally formed along racial lines, largely in the face of discrimination and tension, such as between Puerto Ricans and white greaser gangs around the area. Violence between these groups would lead to the formation of the Latin Kings in 1954. The Division Street Riots in 1966 would be yet another formative event in the organization of various groups around the neighborhood.\nThe gang culture that brewed in the neighborhood during the 1950s and 1960s carried on for successive generations. The 1970s was a particularly tumultuous decade in Chicago for violent crime, and against Chicago Police officers who faced some of the highest fatality rates in many decades, often as a result of gunfire. The center stage for much of this crime, frequenty stemming from gang activity and drug dealing, would be Humboldt Park. By the late 1980s\/early 90s, approximately 49 of the 139 gangs in chicago operated out of the neighborhood. Eventually in the 1990s, the east side of the neighborhood began experiencing some gentrification, and crime gradually lowered around this area with the 2010s seeing notably lowered violent crime levels. However, crime has been a concern for some residents of the area as recently as 2023. Members have been known to actively gangbang in or around the park, such as a group of 13 who maintained an open-air market where they openly sold crack and fentanyl-laced drugs. In 2023, Humboldt Park residents held several rallies protesting continued issues surrounding drug dealing and violent crimes, such as armed robberies and shootings.","Demographics":"As of February 2013, the 26th Ward of the City of Chicago (which encompasses the majority of Humboldt Park) had a population of 28.0% Puerto Ricans. East of Humboldt Park, which is West Town part of the First Ward, is now 45.12% White due to the larger amount of gentrification factors on the east side of the park. Increasing property taxes during the past two decades have forced out the Latino and Eastern European residents that live east of the park.\nThis shift can be easily seen moving westward towards Kedzie Avenue past Humboldt Park and the reduced coverage and visibility of the Puerto Rican Day Parade. Consistent price increases in neighboring have out-priced gentrifiers in surrounding neighborhoods, sending them to Humboldt Park, displacing residents whom they had already displaced in the previous neighborhoods.In the 1950s, sections of Humboldt Park around Our Lady of the Angels Church were characterized by the Italian American community. There were also Irish Americans and Polish Americans at that time.","Puerto Rican community":"As early as the 1950s, Puerto Ricans settled in Humboldt Park. Many came directly from Puerto Rico as migration was averaging over ten thousand Puerto Ricans per year in the 1950s and 1960s, throughout the United States. Others were forced out by urban renewal from the first Puerto Rican neighborhoods of La Madison near the Eisenhower Expressway and University of Illinois, Chicago campus and from Old Town and Lincoln Park, then called La Clark.The infamous Division Street Riots resulted in the start of organizations for Puerto Rican rights in 1966. Another smaller riot took place in Lincoln Park in 1967. The Young Lords, under the leadership of Jose Cha Cha Jimenez worked with gangs like the Latin Kings, the Spanish Cobras, the Latin Disciples and the above-mentioned community organizations to build unity and to redirect youth energies toward education and empowerment strategies.To the Young Lords, it was one community and they organized several solidarity marches from Lincoln Park to Humboldt Park and to City Hall, demanding social services, an end to police brutality and an end to neighborhood displacement.  The last point refers especially to the Puerto Rican community's (socio-economic-culturally forced) migration West in the city from Lincoln Park.In 1995, city officials and Puerto Rican-American activists in a symbolic gesture to recognize the neighborhood and the Puerto Rican residents' roots, christened a stretch of Division Street \"Paseo Boricua\". Two metal 59 feet (18 m)-tall Puerto Rican flags, each weighing 45 tons, arch over the street at each end of the strip.  There is a proud historical and ongoing imprint of Puerto Rican identity in Humboldt Park.","Fiestas Puertorriqueñas and The People's Parade on Division Street":"","Riot Fest":"In 2012, Riot Fest changed the location of its annual music festival to Humboldt Park. The fest expanded to become Riot Fest & Carnival, with rides, games, wrestling, gourmet food vendors and three stages. Performers included Iggy Pop And The Stooges, Rise Against, Elvis Costello & The Imposters, The Offspring, and many more. In 2013, attendance at increased, with a peak of 30,000 people on the first day. and additional festivals were held in Toronto and Denver.\nIn 2014, 160,000 people attended Riot Fest that had a lineup that included Jane's Addiction, Rise Against, and Slayer, The Flaming Lips, Wu-Tang Clan, The Cure, Weezer, Social Distortion, Primus, Tegan and Sara, Cheap Trick, and Patti Smith. This Riot Fest included the inaugural \"Riot Fest Speaks\" panel, moderated by Henry Rollins and featuring Pussy Riot members Nadya Tolokonnikova and Masha Alyokhina, Bad Religion vocalist and UCLA professor Greg Graffin, Rise Against vocalist Tim McIlrath, writer\/activist Marcelle Karp, and Riot Fest founder Michael Petryshyn.\nIn 2015, after some members of the community protested the presence of Riot Fest as a sign of gentrification in the neighborhood (along with the prolonged closure of the park for cleanup and repair after the 2014 event), Alderman Roberto Maldonado vocally opposed allowing the event to continue using Humboldt Park. The festival ultimately relocated to North Lawndale's Douglass Park, which initially prompted some protest as well, although most concerns about the festival have subsided in recent years.","Organizations":"","The Greater Humboldt Park Community of Wellness":"The Greater Humboldt Park Community of Wellness is a coalition of neighborhood organizations that all focus on improving the quality of health and awareness of health in the following areas: asthma, active lifestyles, behavioral health, diabetes, health careers, HIV\/AIDS, oral health, and school health. The coalition works within the Humboldt Park community area as well as the West Town community area, and mainly focuses on the health needs of Puerto Rican, Mexican, and Black residents within the neighborhood to support low-income residents who may not have access to health services. VIDA\/SIDA, a project of the Puerto Rican Cultural Center, has a major presence in the community, educating the neighborhood on sexual health and LGBTQ issues, especially within the Latino\/a community.","East Humboldt Park Neighborhood Association (EHPNA)":"Founded in 2007 to organize those who live East of the Park and participate in the Chicago Police Department's CAPS Beat 1423 initiatives. \nThe foundational intents are three-fold:\n\nAs a way to give neighbors and relatively newer residents of the East Humboldt Park a voice, an identity, and a way to get connected with each other.\nAs an efficient way to disseminate information about the community.  Usually CAPS and other Community updates.\nAs a forum where neighbors can feel free to discuss some of the issues residents in East Humboldt Park as well as neighborhood victories to celebrate.","Historic Humboldt Park stables and the Institute of Puerto Rican Arts and Culture":"Originally completed in 1895 by Chicago architects Frommann and Jebsen, the Humboldt Park Stable and Receptory is listed on the National Register of Historic Places and is a Chicago Landmark. The building's design highlights the Germanic character of the neighborhood in the 1890s and is a fanciful creation of various roofs, finials, brick, and half-timbering.  The Institute of Puerto Rican Arts and Culture has a 15-year lease that began in May 2006 and expires in 2021.It is dedicated to the history of Puerto Rican culture and the Puerto Rican diaspora. Funding from an ISTEA grant allowed the Chicago Park District to fully restore the building. About $3.4 million was spent to renovate the exterior of the building ($1 Million came from City of Chicago Tax Increment Finance (TIF) and another $3.2 (State of Illinois Grant) million for the interior.\nThe stables were once in use by a special Chicago Parks Police Force and is located at 3015 W. Division St. The turret on the Southeast corner of the building \nwas part of the office of Jens Jensen, a landscape architect who left his mark on the impressive design of the park's natural hardscape and water features.","United Blocks of West Humboldt Park":"On 5 May 1995, local West Humboldt Park residents organized to address the problems and concerns of residents and property owners living in West Humboldt Park, and as a result, incorporated The United Blocks of West Humboldt Park (TUBOWHP). The purposes for which TUBOWHP is organized are:\nA.) To enhance the livability of the area by establishing and maintaining an open line of communication and liaison between the neighborhood, government agencies and other neighborhoods.\nB.) To provide an open process by which all members of the neighborhood may involve themselves in the affairs of the neighborhood.","Cultural references to the community":"Humboldt Park figures prominently in the literary works that chronicled Chicago's blue collar life in the 1950s and 1960s.\n\nSaul Bellow's Adventures of Augie March charts the long drifting life of a Jewish Chicagoan and his myriad eccentric acquaintances throughout the early 20th century: growing up in the then Polish neighborhood of Humboldt Park, he ends up cavorting with heiresses on the Gold Coast, studying at the University of Chicago, fleeing union thugs in the Loop, and taking the odd detour to hang out with Trotsky in Mexico while eagle-hunting giant iguanas on horseback.\nJohn Guzlowski's Echoes of Tattered Tongues: Memory Unfolded chronicles the author's experiences growing up in the immigrant and DP neighborhoods around Humboldt Park in Chicago,  in the context of Jewish hardware store clerks with Auschwitz tattoos on their wrists, Polish Cavalry officers who still mourned for their dead horses, and women who walked from Siberia to Iran to escape the Russians.\nJohn Guzlowski's detective novels \"Suitcase Charlie,\" \"Little Altar Boy,\" and \"Murdertown\" deal with crime in the refugee and immigrant neighborhood east of Humboldt Park from the 1950s through the 1970s.\nSarah Paretsky's 1999 detective thriller Hard Time, part of the V. I. Warshawski series, is set in Humboldt Park as it was in the 1970s and 1980s, with the high levels of gang activity, crime, and violence.Humboldt Park has also been featured in film and television.\n\nThe Horn Blows at Midnight, a 1945 film starring Jack Benny, Margaret Dumont, and Alexis Smith, also features Humboldt Park. Benny portrays an angel sent from heaven to blow his horn at an appointed time and destroy the world. However, because the angel hasn't lived on Earth for several centuries, he becomes totally lost in modern Chicago. He floats from one misadventure to the next, including a visit to Humboldt Park during an ethnic German picnic, where he encounters Germans in traditional garb enjoying traditional German food and music. Ultimately the angel refuses to blow his horn, arguing to God that the kindness and goodness displayed by the Chicagoans he met warrants saving the world, not destroying it. God agrees.\nNothing Like the Holidays, starring Freddy Rodriguez, John Leguizamo, Debra Messing, Alfred Molina, Jay Hernandez, Ramses Jimenez, Luis Guzman, Melonie Diaz, Vanessa Ferlito and Elizabeth Peña, follows three siblings returning to their parents' home in Humboldt Park for the holidays.\nThe television series Chicago Fire is filmed on location in Chicago and has filmed several episodes in Humboldt Park. One of the characters Firefighter Joe Cruz (Joe Minoso) mentions growing up and living there, where he would be \"lulled to sleep by gunfire\" and has witnessed many of his childhood friends, including his own younger brother, enter a life of crime with the local ethnic gang.","Politics":"The Humboldt Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Humboldt Park cast 15,723 votes for Hillary Clinton and cast 806 votes for Donald Trump (92.61% to 4.75%). In the 2012 presidential election, Humboldt Park cast 16,494 votes for Barack Obama and cast 573 votes for Mitt Romney (96.02% to 3.34%).","Education":"Chicago Public Schools (CPS) operates district public schools.Zoned elementary schools serving Humboldt Park include:\n\nBernhard Moos Elementary School (1711 N California Ave)\nChopin Elementary School\nLaura S. Ward Elementary SchoolCurrently East Humboldt Park has no public school buildings. In 2012 CPS decided to close three K-8 schools: Duprey, Lafayette, Ryerson, and Von Humboldt. At the time Duprey had 100 students and it was considered to be the least-used school building in CPS. At the time 30% of the Lafayette students were special education students who lived in various parts of Chicago. Lafayette-zoned persons were rezoned to Chopin School. Laura S. Ward Elementary School moved into the former Ryerson building. Ryerson merged with Ward, which was previously in Garfield Park.Senior high schools:\n\nPublic high schools serving Humboldt Park include Roberto Clemente High School (on Western and Division)  has served Humboldt park since long before the 1980s, Orr High School and Marshall Metropolitan High School\nMagnet school: Chicago High School for the Arts - It was scheduled to be in the former Lafayette School, which CPS closed since the number of students was too low.Charter schools include:\n\nAssociation House High School\nHumboldt Park Montessori School\nRowe-Clark Math & Science Academy, a Noble Network Charter High School, is in Humboldt Park.\nUnited Neighborhood Organization operates the Humboldt Park School.\nPolaris Charter AcademyThe Roman Catholic Archdiocese of Chicago has operated Roman Catholic private schools.\n\nFormer: Our Lady of the Angels Catholic School","Notable people":"Saul Bellow\nJohn Belushi\nSandra Cisneros\nPhilip \"Phil\" Erenberg (1909–1992)\nJohn Guzlowski\nIgnacy Jan Paderewski\nWilliam E. Rodriguez (1879-1970), labor lawyer and first Hispanic member of the Chicago City Council. In 1915, he resided at 1400 North Kedzie Avenue.\nHoratio Sanz (born 1969), actor and comedian.","See also":"Pilsen, Chicago","Notes":"","References":"","External links":"City of Chicago Humboldt Park Community Map\nHumboldt Park in Chicago Park Districts\nHistorical images of Humboldt Park in Explore Chicago Collections\nHumboldt Park\" in Biking the Boulevards with Geoffrey Baer\na Latino resource\nHumboldt Park Arts, Culture, Gentrification, Immigration\nYoung Lords in Lincoln Park"}]