[{"History":"","Founding and early years":"In 1853, Paul Cornell, a real estate speculator and cousin of Cornell University founder Ezra Cornell, purchased 300 acres (1.2 km2) of land between 51st and 55th streets along the shore of Lake Michigan, with the idea of attracting other Chicago businessmen and their families to the area. The land was located seven miles south of Downtown Chicago in a rural area that enjoyed weather tempered by the lake – cooler in the summer and warmer in the winter. It was conveniently located near the Illinois Central Railroad, which had been constructed two years earlier. Cornell successfully negotiated land in exchange for a railroad station at 53rd Street. Hyde Park quickly became a suburban retreat for affluent Chicagoans who wanted to escape the noise and congestion of the rapidly growing city.\nIn 1857, the Hyde Park House, an upscale hotel, was built on the shore of Lake Michigan near the 53rd Street railroad station. For two decades, the Hyde Park House served as a focal point of Hyde Park social life. During this period, it was visited or lived in by many prominent guests, including Mary Todd Lincoln, who lived there with her children for two and a half months in the summer of 1865 (shortly after her husband was assassinated). The Hyde Park House burned down in an 1879 fire. The Sisson Hotel was built on the site in 1918 and was eventually converted into a condominium building (the Hampton House).\nIn 1861, Hyde Park was incorporated into an independent township (called Hyde Park Township). Its boundaries were Pershing Road (39th Street) on the north, 138th Street on the south, State Street on the west, and Lake Michigan and the Indiana state line on the east. The territory of the township encompassed most of what is now the South Side of Chicago. Hyde Park Township remained independent of Chicago until it was annexed to the city in 1889. After annexation, the definition of Hyde Park as a Chicago neighborhood was restricted to the historic core of the former township, centered on Cornell's initial development between 51st and 55th streets near the lakefront.\nThe Hyde Park Herald, the neighborhood's community newspaper, was established in 1882 and continues to be published weekly.","Growth and notability":"In 1891 (two years after Hyde Park was annexed to the city of Chicago), the University of Chicago was established in Hyde Park through the philanthropy of John D. Rockefeller and the leadership of William Rainey Harper.In 1893, Hyde Park hosted the World's Columbian Exposition (a world's fair marking the 400th anniversary of Christopher Columbus' arrival in the New World). The World's Columbian Exposition brought fame to the neighborhood, which gave rise to an inflow of new residents and spurred new development that gradually started transforming Hyde Park into a more urban area. However, since most of the structures built for the fair were temporary, it left few direct traces in the neighborhood. The only major structure from the fair that is still standing today is Charles Atwood's Palace of Fine Arts, which has since been converted into the Museum of Science and Industry.\nIn the early decades of the twentieth century, many upscale hotels were built in Hyde Park (mostly along the lakefront). Hyde Park became a resort area in Chicago. Most of these hotels closed during the Great Depression, and were eventually converted into apartment and condominium buildings (most of which are still standing today).\nHistorical images of Hyde Park can be found in Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.","Racial integration, economic decline, and urban renewal":"Until the middle of the twentieth century, Hyde Park remained an almost exclusively white neighborhood (despite its proximity to Chicago's Black Belt). Hyde Parkers relied on racially restrictive covenants to keep African Americans out of the neighborhood. At the time, the use of such covenants was supported by the University of Chicago.After the Supreme Court banned racially restrictive covenants in 1948, African Americans began moving into Hyde Park, and the neighborhood gradually became multiracial. In 1955, civil rights activist Leon Despres was elected alderman of Hyde Park and held the position for twenty years. Despres argued passionately for racial integration and fair housing on the floor of the Chicago City Council, and became known as the \"liberal conscience of Chicago\" for often casting the sole dissenting vote against the policies of Chicago's then-mayor Richard J. Daley.During the 1950s, Hyde Park experienced economic decline as a result of the white flight that followed the rapid inflow of African Americans into the neighborhood. In the 1950s and 1960s, the University of Chicago, in its effort to counteract these trends, sponsored one of the largest urban renewal plans in the nation. The plan involved the demolition and redevelopment of entire blocks of supposedly decayed buildings with the goal of creating an \"interracial community of high standards.\" After the plan was carried out, Hyde Park's average income soared by seventy percent, but its African American population fell by forty percent, since the substandard housing primarily occupied by low-income African Americans had been purchased, torn down, and replaced, with the residents not being able to afford to remain in the newly rehabilitated areas. The ultimate result of the renewal plan was that Hyde Park did not experience the economic depression that occurred in the surrounding areas and became a racially integrated middle-class neighborhood.","Subdivisions":"","The University of Chicago":"The central campus of the University of Chicago—including Pritzker School of Medicine, the University of Chicago Hospital, the historic Main Quadrangles, and the Booth School of Business—is bounded by Washington Park on the west, 55th Street on the north, University Ave. on the east, and 61st Street on the south, placing most of the University within Hyde Park's southwestern quadrant (with the remainder, south of the Midway, being in Woodlawn). The University also owns a number of additional properties throughout Hyde Park, with many concentrated along a narrow corridor along 59th Street between the central campus and the Metra tracks—including, for example, the University of Chicago Laboratory Schools and International House. Due to the University's proximity, the blocks just east of the central campus are dominated by (privately owned) student and faculty residences.","East Hyde Park":"The part of Hyde Park located east of the Metra tracks is locally called East Hyde Park. This area, the part of Hyde Park nearest to Lake Michigan, has a large number of high-rise condominiums, many of them facing the lakefront. Some of these condominiums are remnants of older hotels, like The Mayfair or Regents Park. In this respect, East Hyde Park differs markedly from the rest of Hyde Park, where the vast majority of residences are either three-story apartment buildings or single-family homes (with only a small number of high-rise condominiums).","South Kenwood":"Although the neighborhood bounded by 47th Street on the north, 51st Street (Hyde Park Boulevard) on the south, Cottage Grove Avenue on the west, and Lake Michigan on the east is officially the southern half of the Kenwood community area, it is often considered part of Hyde Park due to the two areas' shared culture and history; \"Hyde Park-Kenwood\" is thus sometimes applied to this collective area (as in, e.g., the \"Hyde Park-Kenwood Historic District\"). Some differences are nonetheless apparent: unlike Hyde Park, which is dominated by three- and four-story apartment buildings and modest family homes, southern Kenwood boasts a great many luxurious mansions, built mainly at the end of the nineteenth and the beginning of the twentieth centuries for wealthy Chicagoans. A number of prominent Chicagoans currently reside or own homes in this area, including former U.S. president Barack Obama and Nation of Islam leader Louis Farrakhan. Boxer Muhammad Ali and former Nation of Islam leader Elijah Muhammad also once resided in south Kenwood.","Demographics":"","Diversity":"Hyde Park is a very racially diverse neighborhood. Its population is 47.6% White, 26.8% African American, 12.1% Asian American, 8.5% Hispanic, and 5.0% of other races or of more than one race. There are some differences between the racial demographics of the part of Hyde Park south of 55th Street and the part of Hyde Park north of 55th Street. Residents south of 55th Street are predominantly White and Asian American, with a smaller percentage being African American or Hispanic. North of 55th Street, African Americans make up approximately half of the population and there's a larger percentage of Hispanics. In 2000, Hyde Park was 45.8% White, 38.1% African American, 0.1% American Indian, 11.3% Asian, 0.1% Pacific Islander, 4.1% Hispanic, and 4.6% from other races or two or more races.Hyde Park's location in the center of the predominantly African American South Side as well as the neighborhood's large population of affluent and upper-middle class black residents have made it an important cultural and political hub of Chicago's black community. Many of Chicago's prominent African American politicians live or have lived in Hyde Park, including former Chicago Mayor Harold Washington; former U.S. Senator Carol Moseley Braun, the first ever Black female U.S. senator; and former U.S. President Barack Obama.","Landmarks":"The following Hyde Park community area properties have been added to the National Register of Historic Places: Chicago Beach Apartments, Arthur H. Compton House, East Park Towers, Chicago Pile-1, Flamingo-on-the-Lake Apartments, Mayfair Apartments, Isadore H. Heller House, Charles Hitchcock Hall, Hotel Del Prado, Hotel Windermere East, Frank R. Lillie House, Robert A. Millikan House, Poinsettia Apartments, Promontory Apartments, Jackson Shore Apartments, Frederick C. Robie House, George Herbert Jones Laboratory, St. Thomas Church and Convent, Shoreland Hotel, German submarine U-505, and University Apartments.\nIn addition, the NRHP Hyde Park-Kenwood Historic District and Jackson Park Historic Landscape District and Midway Plaisance are located, at least in part, within the Hyde Park community area.","Parks":"","Promontory Point":"Promontory Point is an artificial peninsula that extends into Lake Michigan at 55th Street, providing views of the Downtown Chicago skyline to the north. Promontory Point is a common location for picnicking, sunbathing, and swimming. It made news as the location of the wedding reception between George Lucas and Mellody Hobson in June 2013.","Jackson Park":"The southeastern corner of Hyde Park contains the northern end of Jackson Park. Jackson Park consists of lagoons surrounding an island in the middle (called the Wooded Island), on which a small Japanese garden is located. It is home to a large population of beavers and over two dozen species of birds. The Midway Plaisance, a wide boulevard that runs from Stony Island Avenue to Cottage Grove Avenue between 59th and 60th streets, connects Jackson Park to Washington Park (located to the west of Hyde Park).\nJackson Park has been selected by the Obama Foundation as the site of the future Obama Presidential Center.","Retail corridors":"The shopping areas on 53rd, 55th, and 57th streets host most of the retail businesses in Hyde Park.","53rd Street":"53rd Street is Hyde Park's oldest shopping district, lined with many small businesses and restaurants offering various dining options. Harper Court, a small-business-oriented shopping center, extends north of 53rd Street along Harper Avenue. A farmers' market is held there in the summer.","55th Street":"The segment of 55th Street between the Metra line and the lake offers a series of ethnic restaurants serving Thai, Japanese, and Korean cuisine. To the west of the Metra line between 54th and 55th streets lies the Hyde Park Shopping Center.","57th Street":"57th Street is noted for its independent bookstores. 57th Street also offers restaurants along with small grocery stores, hair stylists, and dry cleaners. On the first weekend in June, the venerable 57th Street Art Fair takes up 57th Street between Kimbark and Kenwood avenues.","Museums":"","Educational institutions":"","Churches and houses of worship":"Congregation Rodfei Zedek\nThe First Baptist Church of Chicago, the oldest Baptist church in the city\nFirst Unitarian Church of Chicago\nThe Hyde Park Chapel of the Church of Jesus Christ of Latter-day Saints\nThe Hyde Park Seventh-day Adventist Church\nHyde Park Union Church\nKAM Isaiah Israel\nRockefeller Chapel\nSt. Paul & the Redeemer Episcopal Church\nSt. Thomas Church and Convent\n57th Street Meeting of Friends, a Quaker meeting for worship","Politics":"The Hyde Park community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, Hyde Park cast 10,479 votes for Hillary Clinton and 442 votes for Donald Trump (91.9% to 3.9%). In the 2012 presidential election, Hyde Park cast 9,991 votes for Barack Obama and cast 651 votes for Mitt Romney (91.4% to 6.0%).","Transportation":"Hyde Park is connected to the rest of the city by CTA buses and the Metra Electric Line. CTA buses provide express service to the downtown, and they also allow transfers to Red Line and Green Line trains to the Loop. The Metra Electric Line, which uses the tracks of the former Illinois Central Railroad, has several stops in Hyde Park and provides service to Millennium Station in the downtown.\nCTA bus services:\n\nAdditional CTA bus services, paid for by the University of Chicago:","Notable people":"Gertrude Abercrombie – painter\nMuhammad Ali – boxer\nQuentin Young – physician, a founder of Physicians for National Health Care (PNHP)\nBill Ayers – educator and activist\nSaul Bellow – writer, 1976 Nobel Prize laureate\nLee Botts – environmentalist\nChesa Boudin (born 1980), 30th District Attorney of San Francisco (2020-present). He was raised in Hyde Park by his legal guardians Bill Ayers and Bernardine Dohrn.\nCarol Moseley Braun – U.S. Senator from Illinois\nOscar Brown Jr. – singer, songwriter, playwright, poet, civil rights activist, and actor.\nPaul Butterfield – blues musician\nSubrahmanyan Chandrasekhar – astrophysicist, 1983 Nobel Prize laureate\nJames W. Cronin – physicist, 1980 Nobel Prize laureate\nClarence Darrow – lawyer\nBarbara Flynn Currie, former Illinois House of Representatives Majority Leader\nLeon Despres – civil rights activist\nWilliam Dodd – U.S. Ambassador to Germany\nBernardine Dohrn – lawyer and activist\nPaul Douglas – U.S. Senator from Illinois\nArne Duncan – U.S. Secretary of Education\nAmelia Earhart (day resident as student of Hyde Park High School) – aviator\nKurt Elling – jazz musician\nLouis Farrakhan – leader of the Nation of Islam.\nEnrico Fermi – physicist, 1938 Nobel Prize laureate\nMarshall Field – retail icon and founder of Marshall Field's\nSusan Fiske – social psychologist\nMilton Friedman – economist, 1976 Nobel Prize recipient, taught economics at the University of Chicago (1946-1977)\nFrancis Fukuyama – political scientist\nCaroline Glick – Journalist\nDick Gregory – comedian, activist\nAustan Goolsbee – economist, writer, senior Obama administration official, former Chair of the Council of Economic Advisers\nBonnie Harris – painter\nHugh Hefner – magazine publisher, founder of Playboy\nMaria Hinojosa – journalist\nMahalia Jackson – gospel singer\nElena Kagan – Associate Justice of the Supreme Court\nJim Karvellas – play-by-play sportscaster\nEcho Kellum (born 1982), actor and comedian known for his roles in Arrow and Sean Saves the World. He was a childhood resident of Hyde Park.\nSydney Kamlager-Dove (born 1972), member of the United States House of Representatives from California's 37th congressional district since 2023. She was a childhood resident of Hyde Park\nChaka Khan – singer\nR. Kelly – singer and convicted sex offender\nKaren Lewis (1953-2021) – American labor leader, former reform president of Chicago Teachers Union\nRamsey Lewis – jazz musician\nMary Todd Lincoln – wife of 16th U.S. President Abraham Lincoln\nJohn A. List – Distinguished Service Professor of Economics, University of Chicago\nLeopold and Loeb – convicted murderers\nVic Mensa – rapper\nAlbert Abraham Michelson – physicist, 1907 Nobel Prize laureate\nRobert Andrews Millikan – physicist, 1923 Nobel Prize laureate, Robert A. Millikan House is National Historic Landmark\nElijah Muhammad – former leader of the Nation of Islam\nNeonSeon – writer and illustrator Seon Ricks\nBarack Obama – 44th President of the United States\nClara Peller (1902–1987), actress best known for her appearances in Where's the beef? campaign of Wendy's. She was a longtime Hyde Park resident.\nRichard Posner – former federal judge and senior lecturer at the University of Chicago Law School\nToni Preckwinkle – Cook County Board President, activist\nKwame Raoul – Illinois Attorney General\nJanet D. Rowley – Cytogeneticist and cancer research pioneer\nAntonin Scalia – Associate Justice of the Supreme Court, residency at the University of Chicago Law School (1977-1982)\nJohn Paul Stevens – Associate Justice of the Supreme Court\nGeorge Stigler – economist, 1982 Nobel Prize laureate\nDana L. Suskind – professor\nJames Tiptree Jr. – author\nHarold Washington – Mayor of Chicago\nBernard Wasserstein – professor\nJody Watley – singer\nHenry Clay Work – composer\nHubert Louis Will – federal judge","Gallery":"","References":"","External links":"Official City of Chicago Hyde Park Map\nHyde Park Historical Society\nHyde Park-Kenwood Community Conference\nSouth East Chicago Commission Archived June 29, 2007, at the Wayback Machine"}]