[{"History":"","Beginnings":"Irving Park's development began in 1843 when Major Noble purchased a 160-acre (65 ha) tract of land from Christopher J. Ward, upon which Noble established a farm. The boundaries of that farm today would be Montrose Avenue to the north, Irving Park Road to the South, Pulaski Road to the east and Kostner Avenue to the West. Major Noble's house on the East side of Elston just south of Montrose doubled as the Buckthorn Tavern, serving travelers coming to and from the city of Chicago along the North West Plank Road (Elston). After many years of successful farming Noble sold the farm and retired to McHenry County. Four men from New York, Charles T. Race, John S. Brown, Adelbert E Brown and John Wheeler, purchased the farm in 1869 for $20,000 USD. Shortly thereafter they purchased an additional 80-acre (32 ha) tract immediately south of the Noble farm from John Gray for US$25,000. This parcel, bounded by Irving Park on the north, Grace on the south, Pulaski on the east and Kostner on the west was part of his original 320-acre (130 ha) farm. The intention of the men was to continue farming, but after seeing the success of suburban communities which had recently opened for settlement, they decided to subdivide their land and create an exclusive settlement, seven miles (11 km) from the city.\nAn agreement was reached with the Chicago and Northwestern Railroad allowing their trains to stop in Irving Park if the developers would build a station. This was done, and this station, still at the same location, continues to serve neighborhood residents today. The original name chosen for the new suburb was \"Irvington\" after the author Washington Irving, but it was discovered that another town in Illinois had already used the same name, so the name of Irving Park was adopted.\nThe original developers all built substantial mansions along Irving Park Boulevard between 1870 and 1874. All have since been razed, with the exception of the Steven A. Race mansion, which was moved at the turn of the century and now stands at 3945 N. Tripp Avenue. Another early home, built for Erastus Brown, father of John and Adalbert, also remains at 3812 N. Pulaski Road although greatly altered. The Great Chicago Fire of 1871, which was watched from the cupolas of several area homes, brought a new influx of residents who built many unique, but slightly less pretentious homes.\nIn 1872, the area's first church, the Dutch Reformed Church and Society of Irving Park was constructed on the southeast corner of Keeler Avenue and Belle Plaine Avenue. It remained the only house of worship for thirteen years. The building was completely remodeled in 1908, according to plans by noted architect Elmer C. Jensen. Jensen's spectacular personal residence in the Colonial Revival style built in 1905 still stands in the Old Irving Park neighborhood on North Lowell Avenue. By the turn of the century, congregations representing the Episcopalians, Methodists, Disciples of Christ, Catholics and Baptists had been established.","Annexation to Chicago and subsequent development":"The 1880s found residents beginning to miss some of advantages they had left behind in the city, and in 1889 the community, along with the rest of Jefferson Township, was annexed to Chicago. Water piped to the area from Lake Michigan, and the establishments of a fire department and streetcar service along major streets were some of the improvements to occur during the first year after annexation.\nOver 200 homes had been built in the original subdivision within the first twenty years. Several additions to Irving Park had greatly increased the original 240-acre (97 ha) suburb. Grayland, which was opened for settlement in 1874, extended West from Kostner to Cicero Avenue, between Irving Park and Addison. Subdivided by John Gray, the first Republican sheriff of Cook County, on a portion of his extensive farm, it grew around the Grayland station of the Milwaukee Road Railroad, which is still in active use today. Gray's first home built in 1856 at 4362 W. Grace survives today in a remarkable state of preservation and is the oldest house in Irving Park. Gray later built a lavish mansion on the northwest corner of Milwaukee and Lowell to reflect his new-found wealth and it was a community showplace. Indoor plumbing with gold fixtures, exotic woods and expensive marbles highlighted his home. It was razed around the year 1915.\nThree subdivisions east of Pulaski led to the development of the area in the late 1890s. West Walker is located between Montrose Avenue and Irving Park Road and is characterized by large single family homes in late Victorian, Foursquare and Revival styles. The area south of Irving Park Road was developed by Samuel Gross and was known as \"Gross Boulevard addition to Irving Park\". The housing stock is similar to that of West Walker. The section between Addison and Avondale was developed as the \"Villa addition to Irving Park\" and contains many unique Craftsman and Bungalow style homes fronting on boulevard style streets. The Villa District, as it is known, is a Chicago Landmark district, dubbed by hallowed journalist Mike Royko as \"Polish Kenilworth\" due to its heavily ethnic hue.\nIn 1910 the residents of Irving Park established their own park district and created eight local parks, the largest of which is Independence Park. Considered one of the finest landscaped neighborhood parks in the city for many years, Independence Park also served as the site of local 4th of July celebrations. This annual event features a parade down Irving Park Boulevard involving hundreds of children, athletic events, a band concert and an award-winning display of fireworks. In 1933 the Irving Park District merged with the Chicago Park District. Irving Park continued to grow steadily during the first decades of the 20th century. Several large apartment buildings, featuring elaborate wrought-iron fencing, fountains and terra cotta details were constructed primarily north of Irving Park Boulevard. The depression and war years saw many of the larger homes converted into rooming houses and two family homes. The prosperity following the war was diminished when it was learned that the Northwest Expressway (Kennedy) would cut directly through the heart of Irving Park. This resulted in the displacement of many residents, and loss of many homes and businesses. During the 1960s condominiums replaced several larger homes along Keystone, Kedvale and Keeler north of the expressway.\nThe 1970s provided baseball fans in the area with their own home grown amateur baseball team, the Irving Park White Sox. Founded in 1971 by two Irving Park residents, the late Robert Boomer and William Supernaw, this three time Chicago park champion became one of the top men's baseball clubs in the Chicago area well into the 1980s. They played their home games at Henry Horner Park located at Irving Park and California Avenue.","Present day":"The early 1980s saw a rebirth for Irving Park as a wider audience discovered the beautiful homes and rich history of the area. The Irving Park Historical Society was formed in 1984, to help preserve the neighborhood's heritage and its irreplaceable architecture, which has survived since the late 19th century. Since the society's inception many homes have been restored and many more restorations are in progress. A survey by volunteers of the Irving Park Historical Society documented several hundred buildings in use which predate 1894, many dating as far back as the 1870s. Some remain intact while many have been modified or remodeled. Others retain just a hint of their former Victorian splendor.","Serbian Community":"","Demographics":"","Neighborhoods":"","Old Irving Park":"'Old Irving Park'  aka 'Grayland' is a neighborhood within the Irving Park Community Area of Chicago, comprising its historical core. Its borders are Montrose to the north, Addison to its south, Pulaski Road to the east and Cicero to the west, those of the original two farms that developed here in the 1870s.","The Villa":"The Villa district (Polish: Polskie Wille) - (Pulaski Road to the west, Addison to the south, Avondale Avenue to the north and east), was built in 1902 by a number of architects, many of them visibly influenced by Frank Lloyd Wright's Prairie Style of architecture. Most notable among these were bungalows designed by the architectural firm of Hatzfeld and Knox, whose partner Clarence Hatzfeld would later design the fieldhouse and natatorium at Portage Park. The area was originally developed as the \"Villa addition to Irving Park\" and showcases many unique Craftsman and Prairie style homes fronting on picturesque boulevard style streets. Although St. Wenceslaus church, a majestic Romanesque Revival-Art Deco hybrid draws many of the visitors touring the area, this historic church is actually a few blocks south of the district's formal boundaries.","Independence Park":"'Independence Park' is a neighborhood within Irving Park that was developed in the 1800s. It shares its name with a park of the same name. Its borders are Irving Park Road to the north, the Kennedy Expressway to the west, Elston Avenue and Central Park Avenue to the east, and Addison Street to the south.","West Walker":"'West Walker' is an area bounded by Irving Park Rd to the South, Central Park Ave to the East, Montrose Ave to the North and Pulaski St to the West. The 'West Walker Triangle' is an enclave within West Walker that comprises the area bounded by Irving Park Road to the south, Pulaski Road to the west, and Elston Avenue to the northeast.","California Park":"'California Park' is a neighborhood located in the eastern portion of Irving Park that began development in the 1920s. Understated single-family homes and family-owned businesses are a common feature. Its borders are Montrose Ave. to the north, Addison St. to the south, Kedzie Ave. to the west, and the Chicago River to the east.","Kilbourn Park":"Kilbourn Park (Milwaukee to the north, Belmont to the south, the Union Pacific\/Northwest rail line to the east, and Cicero to the west) is a primarily middle class residential and industrial area. Although technically part of the Irving Park community area, the neighborhood is more akin to neighboring Avondale in terms of both its built environment and the sociology of its residents.","Avondale Gardens":"Avondale Gardens (also known as Merchant Park) (Addison to the north, Belmont to the south, the Union Pacific\/Northwest rail line to the West, Pulaski Road to the east) has been in recent years relabeled as \"South Old Irving Park\" by some. Like Kilbourn Park, the neighborhood is more akin to neighboring Avondale in terms of both its built environment and the sociological makeup of its residents than other areas of the Irving Park Community Area. The name Merchant Park owes its name to John and Clara Merchant, whose house in Old Irving has been designated an official landmark by the City of Chicago.","Little Cassubia":"Little Cassubia (Polish: Małe Kaszuby) was a historical neighborhood in the Irving Park Community Area between Irving Park on the North, Addison to the South, Kimball to the West and Kedzie to the East. The name \"Little Cassubia\" was coined by locals because of the Kaszub people living in the area, who also founded the Roman Catholic Parish of Immaculate Heart of Mary.","Education":"Chicago Public Schools operates public schools in the area. The Kedvale campus of Disney II Magnet School is located in the Old Irving Park neighborhood.Chicago Jewish Day School is in the community area.","Politics":"The Irving Park community has supported the Democratic Party in the past two presidential elections by large margins. In the 2016 presidential election, Irving Park cast 15,179 votes for Hillary Clinton and cast 2,673 votes for Donald Trump (80.44%\tto 14.17%). In the 2012 presidential election, Irving Park cast\n13,415 votes for Barack Obama and cast 3,323 votes for Mitt Romney (78.03% to 19.33%).","Notable people":"Aimee Garcia, actress (The George Lopez Show, Lucifer, Dexter). She spent part of her childhood in Irving Park.\nJohn Nuveen, founder of The John Nuveen Co. which sold the bonds which funded Wacker Drive and Grant Park. He lived in Irving Park during his twenties.\nFrank Piatek, artist and educator, born and raised in Irving Park.\nJeff Tweedy, songwriter, musician, and record producer best known as the singer and guitarist of the band Wilco is a current resident.","See also":"Carl Schurz High School\nCommunity areas of Chicago\nNeighborhoods of Chicago\nVilla District\nWhistle Stop Inn","References":"","External links":"Official City of Chicago Irving Park Community Map\nOld Irving Park Association\nGreater Independence Park Neighborhood Association\nVilla District\nChicago Park District\nHorner Park\nIndependence Park\nKilbourn Park"}]