[{"History":"Settlement in the vicinity of Jefferson Park began in the 1830s with John Kinzie Clark and Elijah Wentworth, whose claim was near what is now the Jefferson Park Metra Station, where he operated a tavern and inn. The tiny settlement of traders, hunters, and farmers consisted of simple one and two room log cabins until Abram Gale, for whom Gale Street is named, built the first frame house in Jefferson. Jefferson Park became the hub of an independent township that was incorporated at the nearby Dickinson Tavern as Jefferson Township in 1850 until annexed by the city of Chicago in 1889. The area was once home to a significant population of Volga Germans, and one of the area's one time local landmarks was a local apartment building in the vicinity of the park along Higgins Avenue known by locals as \"the Russian Hotel\".\nJefferson Park is also home to the Northwest Chicago Historical Society which is dedicated to preserve the area's rich history as well as most historical events and lectures.\nOn January 21, 2021 a Boutique Air Pilatus PC-12 was landing at the Chicago O'Hare Airport when its left main tire separated from the aircraft and landed in Jefferson Park. Police reported the tire, along with several small parts were found on a sidewalk near Leland Avenue. The tire hit two houses before coming to a rest on the sidewalk.","Jefferson Park (Chicago Park District)":"Jefferson Park is a 7-acre (28,000 m2) park operated by the Chicago Park District. The park, which is listed on the National Register of Historic Places is located on the site of the Esdohr Farm.","Education":"Jefferson Park residents are served by Chicago Public Schools, which includes neighborhood and citywide options for students. There are also a number of private parochial schools run by Roman Catholic and Lutheran congregations in the area. The Chicago Public Library operates the Jefferson Park branch for neighborhood residents.","Politics":"The Jefferson Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Jefferson Park cast 6,693 votes for Hillary Clinton and cast 3,490 votes for Donald Trump (62.65% to 32.67%). In the 2012 presidential election, Jefferson Park cast 6,019 votes for Barack Obama and cast 3,129 votes for Mitt Romney (64.42% to 33.49%).","Culture":"Jefferson Park is the home of the historic former Gateway Theatre Movie Palace that is now only part of the Copernicus Center. The Copernicus Center and former Gateway Theatre (renamed the Mitchell P Kobelinski theater) still serve the community as a performing arts center, hosting numerous music concerts, theatrical performances, classes, seminars, community meetings, and cultural events throughout the year.  The Copernicus Center is also a voting location for Jefferson Park residents.  The Copernicus Center \"Annex,\" which includes both an event space and offices, houses the Jefferson Park Chamber of Commerce office.\nJefferson Park is also home to the award-winning Gift Theatre Company, a professional theatre company located at 4802 N. Milwaukee co-founded by Jeff Park native Michael Patrick Thornton.\nThe neighborhood holds two large festivals annually: Jeff Fest in June, and Taste of Polonia over Labor Day weekend. Christina Madonna of \"Chicago All Stars\" fame is a native of Jefferson Park.\nThe Taste of Polonia has brought some of the nation's most prominent political figures to Jefferson Park to woo the support of Chicago's Polish community. President George H. W. Bush hosted the festival in 1992 and in 2000, future Vice-President Dick Cheney as well as Tipper Gore, and Hadassah Lieberman made an appearance. Vice-President Cheney's presence was particularly notorious with coverage in The New York Times of his lively antics which included dancing the polka, serving attendees kielbasa with stuffed cabbage and addressing a cheering crowd by shouting the Polish phrase Sto Lat.","Transportation":"Jefferson Park has long been one of Chicago's transportation hubs, earning the neighborhood the nickname as \"The Gateway to Chicago\". The neighborhood is served by a Blue Line station in the median of the Kennedy Expressway at the intersection of Milwaukee and Gale Street, less than three blocks away from the Copernicus Center and the historic Jefferson Park Congregational Church. The Union Pacific \/ Northwest Line also provides service to Jefferson Park. In 2005, a monument to Thomas Jefferson was placed along the station's entrance along Milwaukee Avenue.","Neighborhoods":"","Jefferson Park":"Jefferson Park is a predominantly middle-class neighborhood of people coming from a variety of diverse backgrounds. Like many neighborhoods on the Northwest Side of Chicago the neighborhood has a heavy Polish-American presence, and is home to the Copernicus Foundation, the Polish parish of St. Constance, as well as a host of other Polish-American organizations, institutions and businesses.\nJefferson Park is also known for having a very high number of resident city and county workers. The area is filled with the homes of Chicago Public School teachers and staff, Chicago Police Department, Chicago Fire Department as well as Cook County Sheriff officers and staff.\nBoundaries are Austin Ave, Chicago River, Railway, Elston Ave, Foster Ave, Edens Expy, Cicero Ave, Montrose Ave, Narraganset Ave, Nagle Ave, Bryn Mawr Ave, Northwest Hwy, Milwaukee Ave.","Indian Woods Community":"","Gladstone Park":"Gladstone Park is a neighborhood in the northern section of the Jefferson Park community area of Chicago. It is centered at the large and confusing intersection of Northwest Highway and Central, Milwaukee, and Foster Avenues. The Kennedy Expressway runs nearby as well and has an entrance from Foster Avenue. The park for which the neighborhood is named is located a few blocks to the northwest between Northwest Highway and Milwaukee, on Menard Avenue.\nThe numerous examples of homes in the Dutch Colonial style has led to the area's nickname as \"Little Rotterdam\", an allusion to the Dutch city of Rotterdam.\nGladstone Park has its own stop on the Union Pacific \/ Northwest Line.","References":"","External links":"Official City of Chicago Jefferson Park Community Map\nThe Jefferson Park Historical Society's official website\nChicago Park District\nJefferson Park\nGladstone Park\nFoster Austin Park\nRoberts Square Playlot\nEncyclopedia of Chicago\nA Short History of Jefferson Park\nThe Jefferson Park Free Press\nCopernicus Center\nTaste of Polonia"}]