[{"Description":"Kenwood was settled in the 1850s by wealthy Chicagoans seeking respite from the increasing congestion of the city. The first of these residents was John A. Kennicott, who built his home near the Illinois Central Railroad at 48th Street. He named the home Kenwood after his ancestral land in Scotland, and when the Illinois Central Railroad built a small depot near 47th Street, they named the station Kenwood as well. Shortly afterwards, the name Kenwood began to be applied to the whole area.The southeastern portion of Kenwood contains the Indian Village neighborhood, which features the Chicago Landmark Powhatan Apartments and the National Register of Historic Places Narragansett. The 1902 Blackstone Library is another well-known landmark in the neighborhood.  It continues to be part of the Chicago Public Library system. The recently reopened Hyde Park Art Center, located on Cornell Avenue just north of 51st Street and East Hyde Park Boulevard, is Chicago's oldest alternative exhibition space, with an on-site school and studio.\nThe Hyde Park community area is to the south of Kenwood and the southern half of Kenwood (south of 47th Street) is sometimes referred to as Hyde Park-Kenwood.In the 1890s, the Kenwood Astrophysical Observatory, established by astronomer George Ellery Hale, was located in Kenwood close to the new (at that time) University of Chicago.","Politics":"As with much of the South Side, the Kenwood community area has supported the Democratic Party in national elections by vast margins. During the 2016 presidential election in particular, Kenwood cast 7,639 votes for Hillary Clinton and cast 251 votes for Donald Trump (94.19% to 3.09%). In the 2012 presidential election, Kenwood cast 8,712 votes for Barack Obama and cast 331 votes for Mitt Romney (95.63% to 3.63%).","Schools":"The public schools in Kenwood are Kenwood Academy, Canter Middle School, King College Prep High School, Ariel Community Academy, William C. Reavis Math and Science Specialty School and Beulah Shoesmith Elementary School.  Private Schools in Kenwood include the Ancona Montessori School, Cambridge School of Chicago, Akiba-Schechter Jewish Day School, and Hales Franciscan High School.","Notable residents":"Muhammad Ali\nLerone Bennett, Jr.\nBarbara Bowman\nMarc Canter\nDavid \"Honeyboy\" Edwards\nLouis Farrakhan\nSeymour Hersh, was raised at 835 East 47th Street.\nValerie Jarrett\nEdward Levi\nAnn Marie Lipinski\nRoberta Martin, lived at 4901 S. Woodlawn Avenue.\nGaston B. Means\nCarol Moseley Braun\nElijah Muhammad\nBarack Obama\nMichelle Obama\nMandy Patinkin\nMaurice Rabb\nJulius Rosenwald\nBill Veeck\nMuddy WatersThe infamous murderers Nathan Leopold and Richard Loeb, and their victim Bobby Franks, were all residents of Kenwood.","Gallery":"","Notes":"","External links":"Official City of Chicago Kenwood Community Map"}]