[{"Profile":"In the 1840s, farming was begun in this area by newly arrived German Americans. Two brothers, Lyman and Joseph Budlong arrived in 1857 to start a commercial pickling operation near what is today Lincoln Avenue and Berwyn. They later opened a commercial green house and flower fields to provide flowers for the then new Rosehill Cemetery. In 1925, to honor Abraham Lincoln, the Chicago City Council named the area Lincoln Square, and a prominent statue of the namesake was erected in 1956.About 44,000 people live in the neighborhood along with over 1,000 small and medium-sized businesses. It is accessible through the Brown Line of the 'L'. The neighborhood is bounded by Bryn Mawr and Peterson Avenues on the north, Montrose Avenue on the south, Ravenswood Avenue on the east and the Chicago River on the west. Its housing stock consists of private residences and small apartment buildings.\nThe commercial heart of Lincoln Square is located at the intersection of Lawrence, Western and Lincoln Avenues. Lincoln Avenue southeast of this intersection is home to a wide variety of restaurants and shops. Lincoln Square is historically known as a heavily German influenced and populated neighborhood, but now one is just as likely to see shops catering to the Thai culture. Still, the neighborhood is home to a number of German businesses, including Merz Apothecary and Lutz Café & Bakery, and is the home of the Chicago branches of DANK (the German American National Congress) and the Niedersachsen Club. The German-language weekly newspaper Amerika Woche was born in Lincoln Square in 1972, though its original headquarters above the Brauhaus is now only a bureau.\nEvents such as festivals and live musical performances are frequently held in Lincoln Square. The Apple Fest is a longstanding tradition in Lincoln Square that brings the community together to celebrate the beginning of fall. Dozens of vendors participate in the event each year selling autumn-themed crafts and apple-themed treats, such as fresh baked apple pies, bushels of apples, hot apple cider and apple pizza. The Square Roots Festival, which is held every summer, celebrates Lincoln Square's history in music and German culture with live performances from local musicians and craft beer from local breweries.","Neighborhoods":"Bowmanville\nBowmanville Woods\nBowmanville Gardens\nBudlong\nBudlong Woods\nBudlong Gardens\nLincoln Square\nLincoln Square North\nLincoln Square East\nLincoln Square South\nLincoln Square West\nRavenswood\nRavenswood Gardens","Politics":"Lincoln Square is a stronghold for the Democratic Party in elections. In 2020, Joe Biden won 18,908 votes, or 85.8% compared to 2,699 for Donald Trump, or 12.2% In the 2016 presidential election, Lincoln Square cast 15,317 votes for Hillary Clinton (83.3%) and cast 1,981 votes Donald Trump (10.3%). In the 2012 presidential election, Lincoln Square cast 13,515 votes for Barack Obama and 2,435 votes for Mitt Romney. In the Illinois General Assembly, the entirety of Lincoln Square is located in the 7th Legislative District and the 13th House District. During the 101st General Assembly, the community area is represented by Senator Heather Steans and House Majority Leader Greg Harris. The Lincoln Square neighborhood encompasses the 40th and 47th wards on the Chicago City Council. The aldermen are Andre Vasquez in the 40th Ward and Matt Martin in the 47th Ward. Both were first elected in the 2019 election.","Points of interest":"Conrad Sulzer Regional Library\nCambodian Association of Illinois\nDANK Haus German American Cultural Center\nOld Town School of Folk Music\nRosehill Cemetery","Hospitals":"Kindred Hospital Chicago North\nSwedish Hospital","Schools":"Chicago Public Schools operates public schools. Many of these schools have benefited from GROW47, an initiative started by Alderman Ameya Pawar, which aims to improve funding for local public schools.\n\nAmundsen High School is the designated CPS high school for most of the community area, while a small section is zoned to Mather High School.Other private or parochial schools:\n\nAdler Schools\nLycée Français de Chicago\/The French International School\nNorth Park Elementary School\nNorth Shore Junior Academy\nPilgrim Lutheran\nQueen of Angels Elementary School\nSt. Hilary's Elementary School\nSt. Mathias School\nWaldorf School","Parks":"Lincoln Square contains several parks, which are maintained by the Chicago Park District.\n\nWinnemac Park covers more than 40 acres at the corner of Damen and Foster. The park contains the campuses of Amundsen High School, Chappell Elementary, and the Jorndt Field athletic complex. The park features natural prairie plants, multiple baseball fields, a soccer field, and a playground. The high school also includes a swimming pool, run by the Chicago Park District, that is open to the public during limited times.\nWelles Park covers 15 acres and sits at the corner of Lincoln and Montrose Avenues, across from the Conrad Sulzer Regional Library. It contains a community center, including a pool, gym, and fitness center. A gazebo stands at the center of the park where concerts are held during the summer. The playground in the northwest corner has swings, climbing equipment and a small splash-pad. There are also several baseball fields, tennis courts and courts to play horseshoes. The park recently won a grant to install a nature area in the southwest corner of the park.\nJacob Park is a small playlot located at Virginia and Leland Avenues, right next to the Chicago River. It features a large sandbox, which neighbors have stocked with trucks and toys. The Chicago \"L\" runs along the southern edge of the park, to the delight of children and adults.\nRiver Park is located along the Chicago River, south of Foster Ave. and west of Francisco Ave. The park includes a community center, an outdoor pool, and a popular splash pad. The park is also the start of the North Shore Channel Trail, which continues 6.7 miles through the Skokie Northshore Sculpture Park and up to Evanston's Ladd Arboretum.\nVogle Playlot is tucked in the corner of Lawrence and Hoyne Avenues. It contains a newly renovated playground and swing-set.\nGross Park is a small park located at the corner of Lawrence and Washtenaw, near the HarvesTime grocery store. It contains several basketball courts, a small soccer field, and an ADA-accessible soft-surface playground.\nSunken Gardens Park is a small park that sits along the Chicago River at the corner of Virginia and Sunnyside Avenues. It contains a small grassy space and a few benches.","Public art":"Berlin Wall Monument (Western Avenue Brown Line Station), 2008\nLincoln\/Leland Mural (Lincoln Quality Meat Market), 2007\nGreater Rockwell Mural (Beans and Bagels), 2005\nLincoln\/Sunnyside Mural, 1997\nThe Maypole (Leland and Lincoln), 1999\nGiddings Square Fountain, 1999\nLombard Lamp (Giddings Square), 1979\nThe Chicago Lincoln statue (Corner of Western, Lawrence and Lincoln), 1956\nThe Lincoln Square Mural (Lincoln Square Athletic Club), 1991","Events":"The following events occur within the neighborhood on an annual basis.\n\nRavenswood Run 5K\nMay Fest\nLincoln Square Summer Concert Series\nSquare Roots\nLincoln Square Poetry Fest\nGerman-American Fest\nLincoln Square Fall Apple Fest\nFriends of the Craft Beer Festival\nFriends of the Grape Wine Festival\nChristmas Tree Lighting in the Square","Notable people":"Russell A. Berg (1917–2002), brigadier general in the United States Air Force. He resided at 4624 North Winchester Avenue for a time in the 1940s.\nGeorge Papadopoulos (born 1987), former advisor to the 2016 presidential campaign of Donald Trump. He was living in Lincoln Square at the time of his arrest.\nMike Simmons (born 1983), member of the Illinois Senate since 2019. His family was one of the first Black families to integrate Lincoln Square after the United States Supreme Court mandated that public housing be built on the city’s North Side.\nNicholas Zagone (1931–2020), member of the Illinois House of Representatives from 1959 to 1965. He was raised in Lincoln Square.","Bordering community areas":"Uptown\nEdgewater\nNorth Park\nAlbany Park\nNorth Center\nWest Ridge","References":"","External links":"Official City of Chicago Lincoln Square Community Map\nLincoln Square Chamber of Commerce"}]