[{"History":"In 1824, the United States Army built a small post near today's Clybourn Avenue and Armitage Avenue (formerly Centre Street). Native American settlements existed along Green Bay Trail, now called Clark Street (named after George Rogers Clark), at the current intersection of Halsted Street and Fullerton Avenue. Before Green Bay Trail became Clark Street, it stretched as far as Green Bay, Wisconsin, including Sheridan Road, and was part of what still is Green Bay Road in Milwaukee County, Wisconsin.In 1836, land from North to Fullerton and from the lake to Halsted was relatively inexpensive, costing $150 per acre ($370\/ha) (1836 prices, not adjusted for inflation). Because the area was considered remote, a smallpox hospital and the city cemetery were located in Lincoln Park until the 1860s.In 1837, Chicago was incorporated as a city, and North Avenue (to the south of today's Lincoln Park neighborhood) was established as the city's northern boundary. Settlements increased along Green Bay Trail when the government offered land claims and Green Bay Road was widened. The area north of Chicago, including today's Lincoln Park, was eventually incorporated as Lake View Township. The city, nonetheless, owned extensive tracts of land north of North Avenue, including what is now the park. The Township was annexed to Chicago in 1889. The Lincoln Park Zoo opened in 1868.In the period following the Civil War, the area around Southport and Clybourn became home to a community of Kashubian immigrants. Arriving from what is now north-eastern Poland, Chicago's Kashubians brought their own distinct culture and language, influenced by their rustic traditions and by their close contact with their German neighbors. In 1882, St. Josaphat's Roman Catholic parish was established specifically for the Kashubian community. The resulting nicknames of \"Jozafatowo\" (Polish for \"Josaphat's Town\") as well as \"Kaszubowo\" (Polish for \"Cassubian Town\") made the neighborhood one of Chicago's Polish Patches. The current Romanesque Revival church building was completed in 1902. A Pomeranian Griffin Crest visible on the school south of the church is a nod to the parish that once anchored one of the communities in Chicago dubbed Little Cassubia.\"\nFrom 1896 to 1903, the original Ferris Wheel was located at a small amusement park near Clark St. and Wrightwood Ave. The site was from 2619 to 2665 N. Clark St., which is now the location of a McDonald's and a high-rise residential building. On February 14, 1929, seven mob associates and a mechanic were shot to death in an automobile garage at 2122 N. Clark St.During the Great Depression, many buildings in Lincoln Park fell into disrepair. In 1954 the Lincoln Park Conservation Association was founded to prevent deterioration of housing in the neighborhood and by 1956 Lincoln Park received urban renewal funds to renovate and restore old buildings and schools.In 1968, a violent confrontation between demonstrators and police in Lincoln Park occurred during the week of the 1968 Democratic National Convention.\nI pointed out that it was in the best interests of the City to have us in Lincoln Park ten miles away from the Convention hall. I said we had no intention of marching on the Convention hall, that I didn't particularly think that politics in America could be changed by marches and rallies, that what we were presenting was an alternative life style, and we hoped that people of Chicago would come up, and mingle in Lincoln Park and see what we were about.\nIn the 1950s, 1960s, and 1970s, Lincoln Park became home to the first Puerto Rican immigrants to Chicago. Jose Cha Cha Jimenez transformed the local Young Lords gang into human rights activists for Latinos and the poor. They published newspapers, mounted sit-ins and takeovers of institutions and churches at Grant Hospital, Armitage Ave. Methodist Church, and McCormick Theological Seminary.\nIn 1969, members of the Puerto Rican Young Lords and residents and activists mounted gigantic demonstrations and protested the displacement of Puerto Ricans and the poor including the demolition of buildings on the corner of Halsted and Armitage streets, by occupying the space and some administration buildings at McCormick Theological Seminary. There were civil rights arrests and martyrs including the unsolved murders of United Methodist Rev. Bruce Johnson and his wife Eugenia Ransier Johnson who were strong supporters of the poor. Today their history is archived at DePaul University's Richardson Library and at Special Collections at Grand Valley State University.\nOn June 29, 2003, a porch collapse occurred during a party at 713 W. Wrightwood Ave. The disaster was the deadliest porch collapse in U.S. history; 13 people were killed and 57 seriously injured.\nAs of 2015, the neighborhood is primarily made up of young urban professionals, recent college graduates, and young families. The slang terms Trixie and Chad have their origins in Lincoln Park.","Community area":"Lincoln Park's boundaries are precisely defined in the city's list of official community areas. It is bordered on the north by Diversey Parkway, on the west by the Chicago River, on the south by North Avenue, and on the east by Lake Michigan.\nIt encompasses a number of neighborhoods, including Lincoln Central, Mid-North, Old Town Triangle, Park West, RANCH Triangle, Sheffield, and Wrightwood Neighbors. The area also includes most of the Clybourn Corridor retail district, which continues into the Near North Side. Lincoln Park neighborhood associations include: Lincoln Central Association, Mid-North Association, Old Town Triangle Association, Park West Community Association, RANCH Triangle Community Conservation Association, Sheffield Neighborhood Association, and Wrightwood Neighbors Association. All are affiliated with the Lincoln Park Conservation Association.\nLincoln Park is home to Lincoln Park High School, Francis W. Parker School, and DePaul University. Many students who attend these schools now live in this neighborhood. Lincoln Park is also home to five architecturally significant churches: St. Vincent de Paul Parish, St. Clement Church, St. Josaphat's (one of the many so-called 'Polish Cathedrals' in Chicago), St. James Lutheran Church and St. Michael's Church in the Old Town Triangle area of Lincoln Park. Visible from throughout the neighborhood, these monumental edifices tower over the neighborhood, lending the area much of its charm. Five Lincoln Park churches are affiliated with the Catholic Church (St. Bonaventure Oratory, Saint Clement Church, St. Michael in Old Town, St. Teresa de Avila Catholic Parish, St. Vincent de Paul Parish). The neighborhood also houses Children's Memorial Hospital (recently moved to Streeterville and was renamed Ann & Robert H. Lurie Children's Hospital of Chicago) and the currently closed Lincoln Park Hospital (formerly known as Grant Hospital and before that German-American Hospital), which is slated for redevelopment to condominiums, apartments, medical offices, and retail to be renamed Webster Square.\nThe neighborhood contains a large number of upscale national retailers, boutiques, bookstores, restaurants and coffee shops. There are also many bars and clubs in the area.\nA. Finkl & Sons Steel operated on the west side of Lincoln park along an approximately 22-acre lot by the Chicago River for 113 years. The site is now vacant and is the site of the proposed Lincoln Yards project.\nLincoln Park is one of the wealthiest and most expensive communities in which to live. While the average single-family house is priced around $1 million, many homes in the area sell for more than $10 million. In 2007, Forbes magazine named the area between Armitage Avenue, Willow Street, Burling Street, and Orchard Street as the most expensive block in Chicago.","Namesake park":"Lincoln Park, for which the neighborhood was named, now stretches miles past the neighborhood of Lincoln Park. The park lies along the lakefront from Ohio Street Beach in the Streeterville neighborhood, northward to Ardmore Avenue in Edgewater. The section of the park adjacent to the Lincoln Park neighborhood contains the Lincoln Park Zoo, Lincoln Park Conservatory, an outdoor theatre, a rowing canal, the Chicago History Museum, the Peggy Notebaert Nature Museum, the Alfred Caldwell Lily Pool, the North Pond Nature Sanctuary, North Avenue Beach, playing fields, a very prominent statue of General Ulysses S. Grant, as well as a famous statue of Abraham Lincoln (and many other statues).Many smaller parks, such as Oz Park, Bauler Park (named for 'Paddy' Bauler, former Alderman of the 43rd ward) and Jonquil Park are scattered throughout the Lincoln Park community area.","Transportation":"The Lincoln Park neighborhood is accessible via mass transit operated by the CTA. These include the Chicago \"L\"'s Red, Brown and Purple lines at the Fullerton station and the Purple and Brown lines at the Armitage and Diversey stations, as well as CTA bus service.\nThe Union Pacific North and Northwest lines have a stop at Clybourn at the western side of Lincoln Park.\nVia car, Lincoln Park can be reached by using Lake Shore Drive or the Kennedy Expressway.","Politics":"","Local":"Most of Lincoln Park is currently part of the 43rd ward of the Chicago City Council, represented by Timmy Knudsen. The extreme south and extreme western sections of the neighborhood are part of the 2nd and 32nd wards, represented respectively by Brian Hopkins and Scott Waguespack. All three aldermen are Democrats.","State":"In the Illinois House of Representatives, the lakefront portion of the neighborhood is part of the 12th district, represented by Margaret Croke. Central Lincoln Park is part of Ann Williams’ 11th District, and the riverside portion of the neighborhood is represented by Jaime Andrade in the 40th district. The Sheffield Neighbors area is part of Jawaharial Williams’s 10th district, and a small southern portion of the neighborhood is represented by Lakesia Collins. All representatives are Democrats. \nIn the Illinois Senate, most of the area is part of District 6, represented by Democrat Sara Feigenholtz, while the southwest quarter is part of District 5, represented by Democrat Patricia Van Pelt.[1]","Federal":"In the United States House of Representatives, the vast majority of the area is in Illinois's 5th congressional district, represented by Democrat Mike Quigley. A minuscule portion in the south is part of Illinois's 7th congressional district, represented by Democrat Danny K. Davis.\nThe Lincoln Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Lincoln Park cast 24,197 votes for Hillary Clinton and cast 5,072 votes for Donald Trump (77.31% to 16.20%). In the 2012 presidential election, Lincoln Park cast 19,268 votes for Barack Obama and cast 9,592 votes for Mitt Romney (65.37% to 32.54%).","Education":"","Public schools":"Lincoln Park residents are served by Chicago Public Schools, which includes neighborhood and citywide options for students.\nLincoln Park High School serves as the sole neighborhood secondary education institution and is ranked one of Chicago's best public high schools. Nationally, Lincoln Park High School is ranked as the 90th best high school in the country by U.S. News & World Report.Additionally, two zoned elementary schools (grades K-8), Abraham Lincoln Elementary School and Louisa May Alcott School. are found in the neighborhood. LaSalle Language Academy, Oscar Mayer Elementary School, and the Newberry Math and Science Academy, all magnet schools, serve the neighborhood.\nMelanie Ann Apel, author of Lincoln Park, Chicago, described Lincoln School as \"the school most often associated with Lincoln Park\".The French-American School of Chicago, a program for advanced French speakers, holds its classes at Lincoln Elementary and Lincoln Park High.","Private schools":"The Roman Catholic Archdiocese of Chicago operates the Saint Clement School, a K-8 school, in the Lincoln Park area.\nSaint James Lutheran School, a K-8 school, is located at 2101 N. Fremont St.\nFrancis W. Parker School, a K-12 school, is in the area.","Public libraries":"Chicago Public Library operates the Lincoln Park Branch at 1150 W. Fullerton Ave.","Cuisine":"Lincoln Park has numerous restaurants, including Chicago's only 3-Michelin star restaurant,  Alinea, and Galit, a 1-Michelin star restaurant. The Lettuce Entertain You restaurant company started at R.J. Grunts at 2056 N. Lincoln Park West, which is also home to one of the first salad bars. The Wieners Circle on Clark and Wrightwood is a fast food restaurant that is known for its Polish sausage and the mutual verbal abuse between staff and customers. Demon Dogs was a popular hot dog restaurant that stood under the Fullerton 'L' station from 1983 until 2006. The first Potbelly Sandwich Works opened in 1977 on Lincoln Avenue in Lincoln Park, where it is still in operation today. Chicago Pizza and Oven Grinder Company is a popular restaurant on Clark Street.","Music":"Lincoln Park currently has a number of music venues including the Park West, Lincoln Hall, Neo nightclub, Kingston Mines and B.L.U.E.S.Jelly Roll Morton recorded early jazz work in 1926 at the Webster Hotel ballroom (now Webster House) at 2150 N. Lincoln Park West.In 1972, Chicago folk singer Steve Goodman wrote the song \"Lincoln Park Pirates\" about Lincoln Towing Service.","Religion":"The Roman Catholic Archdiocese of Chicago operates the St. Clement Catholic Church. In 2018 the archdiocese bought a 3,044-square-foot (282.8 m2) residence, with four bedrooms, to house priests at the church, paying $1,650,000.","Notable residents":"Lincoln Park was home to a number of important historic figures including:\n\nJ. J. Bittenbinder (1942–2023), police officer, television host, and author. He was a childhood resident of the DePaul neighborhood in Lincoln Park.\nRoger Brown, an important Chicago Imagist painter, lived at 1926 N. Halsted St. The house is now site to the Art Institute of Chicago's Roger Brown study center.\nMother Frances Xavier Cabrini, the first American saint, lived at 2520 N. Lakeview Ave.  This address was part of the Columbus Hospital site which is now a high-rise condominium development.  The National Shrine of Saint Francis Xavier Cabrini, the former chapel of Columbus Hospital, is adjacent to the newer development.\nHenry Darger, the outsider artist, lived at 851 W. Webster Ave. and worked as a janitor at Children's Memorial Hospital.\nHenry Gerber, the founder of the first homosexual rights organization in the US, lived at 1710 N. Crilly Court.\nBruce Graham, the famous Skidmore, Owings and Merrill architect, lived in a house he himself designed in 1969.\nRichard Hunt, the famous sculptor, has his studio at 1017 W. Lill Avenue, a decommissioned electrical substation.\nBruce Heyman, 30th United States Ambassador to Canada. Heyman is a resident of Lincoln Park.\nJose \"Cha Cha\" Jimenez, founder of the Young Lords who fought the forced displacement of Puerto Ricans and the poor from Lincoln Park.\nKelly Loeffler (born 1970), United States Senator and businesswoman. She lived in Lincoln Park while studying at Kellstadt Graduate School of Business.\nLászló Moholy-Nagy, the Bauhaus and IIT designer, lived at 2622 N. Lakeview Ave.\nJohn Mulaney, comedian, was raised in Lincoln Park and attended St. Clement school.\nWalter Netsch, an architect, and his wife Dawn Clark Netsch, the 4th Illinois Comptroller, lived at 1700 N. Hudson Ave. The house was designed by Walter in 1974.\nAlbert Parsons and Lucy Parsons, the prominent union organizers and socialist leaders, lived at 1908 N. Mohawk St.\nGene Siskel and Roger Ebert, film critics, both lived in Lincoln Park.\nSargent Shriver and Eunice Kennedy. They moved to Lincoln Park from the Near North Side shortly after Shriver was appointed President of the Chicago Board of Education.\nRuth Ann Steinhagen, typist notable for attempting to murder Eddie Waitkus.\nCharlie Trotter, chef.\nLuis Vicente Gutiérrez, politician, grew up in Lincoln Park until the age of 13.\nGeorge Kirke Spoor, film pioneer, lived in Old Town.\nJonathan Toews, NHL hockey player\nMelvin Alvah Traylor (1878–1934), lawyer and banker. He resided in Lincoln Park at his time of death.A large number of significant business and civic leaders currently live in Lincoln Park, including Penny Pritzker, Fred Eychaner, and Joe Mansueto.","Gallery":"","References":"","External links":"\"Official City of Chicago Lincoln Park Community Map\" (PDF). cityofchicago.org.\n\"Lincoln Park Chamber of Commerce\". lincolnparkchamber.com.\n\"Francis Parker Neighbors\". francisparkerneighbors.org.\n\"Young Lords in Lincoln Park\". gvsu.edu."}]