[{"History":"In the late 19th century, Pilsen was inhabited by German, Polish, Italian, and Czech immigrants. Czech immigrants were the most prominent and named the district after Pilsen (German for Plzeň), the fourth largest city of the Czech Republic. They replaced the Germans and Irish who had settled there before them, in the mid-nineteenth century. These German and Irish residents lived in poor conditions throughout the 1850s and ‘60s. The Pilsen area was overcrowded and suffered from flooding, lack of indoor plumbing, and illness. A cholera outbreak that killed hundreds, eventually led the German and Irish residents to move in search of better living conditions. The population also included smaller numbers of other ethnic groups from the Austro-Hungarian Empire, such as Slovaks, Slovenes, Croats and Austrians, as well as immigrants of Polish and Lithuanian heritage. Many of the immigrants worked in the stockyards and surrounding factories. Like many early 20th century American urban neighborhoods, however, Pilsen was home to both wealthy professionals and the working class, with the whole area knitted together based on the ethnicities, mostly of Slavic descent, who were not readily welcome in other areas of the city.Although there was some increase in the Hispanic presence in the late 1930s, it was  until the  late 1960s that there was a great spurt in the numbers of Latinos in Pilsen. This was due to the displacement of Latinos from the neighborhood UIC currently occupies, south of Hull House, and from other urban revitalization projects. In 1970, Latinos became the majority population in Pilsen, with about 25,000 people out of the community's 43,341 people surpassing the population of people of Eastern European descent. In particular, Mexicans made up about 36% of the residents of Pilsen in 1973.In the 1980s, the Mexican-origin population grew. During that decade 95% of the people in Pilsen had some Mexican descent, and 80% of the overall population of Pilsen were first or second generation immigrants from Mexico and Mexican-Americans. Mexican growth continued into the 1990s. During that decade 40% of the Mexican-origin population in Pilsen had migrated directly there from Mexico, and about 33% of the Mexican-origin population in the Chicago area lived in Pilsen.As of 2005, many of the newer residents of the neighborhood were not Latino, and it is projected that the neighborhood will continue to become more diversified in the years ahead. The non-Latino  population in Pilsen is still a minority as of the 2010 Census.\nThe Chicago Housing Authority's plan for transformation of the ABLA projects has spilled over into Pilsen proper, with the now nearly complete Chantico Loft development, Union Row Townhomes, as well as the defunct Centro 18 on 18th Street in East Pilsen. Infill construction of condominiums and single-family homes is now in full force on the east side of the neighborhood, as Pilsen becomes one of the next major development areas for infill construction. Some local advocacy groups have formed, urging the neighborhood's alderman to curtail gentrification to preserve the Mexican-American culture.","Neighborhoods and sub-areas":"The Lower West Side includes two neighborhoods; Pilsen and Heart of Chicago. It also contains several areas considered to have historic significance including the Schoenhofen Brewery Historic District, part of the Cermak Road Bridge Historic District, and part of the Chicago Sanitary and Ship Canal Historic District, and the South Water Market.","Chicago Sanitary and Ship Canal Historic District":"The Chicago Sanitary and Ship Canal Historic District is part of the Illinois Waterway Navigation System Facilities multiple property submission; extends through Cook County west of Chicago, DuPage County and Will County to Lockport","Cermak Road Bridge Historic District":"The Cermak Road Bridge Historic District was added to the N.R.H.P. in May 2012. It consists of Cermak Road and the South Branch of the Chicago River.","Heart of Chicago":"According to the results of a 1978 survey which asked residents the name of their neighborhood and its boundaries, the approximate borders for the Heart of Chicago neighborhood are the BNSF Railway to the north, South Ashland Avenue to the east, Interstate 55 to the south, and South Western Avenue to the west.\nAlong Oakley Boulevard, from 24th Street to 25th Street, is found a group of restaurants which remain as a residue of a previously large pocket of Northern Italians.  In 1890, the McCormick Reaper factory at Western Avenue and the south branch of the river recruited skilled machine operators from Northern Provinces of Italy (Tuscany, Torino, Milano), offering them salaries twice that available in Italy and a paid transatlantic ship ticket. The community grew as workers paid for relatives to join them.  St. Michael's parish on 25th street was their community center. The archdiocese closed that parish in 2000.  Restaurants opened by these families that remain, as of 2019, include on Oakley Boulevard: Bruna's (1933), Bacchanalia's (1971), La Fontanella (1974), Ignotz's (1999) and on Western Avenue Il Vicinato (1983).","Pilsen":"The Pilsen neighborhood is a historically working class, residential neighborhood and gateway for immigrants coming to the City of Chicago. The area was initially settled by Czech immigrants to the United States who named the district after Plzeň, a city in what is now the Czech Republic. According to the results of a 1978 survey which asked residents the name of their neighborhood and its boundaries, the approximate borders for Pilsen neighborhood are West 16th Street to the north, the Dan Ryan Expressway to the east, Interstate 55 to the south, and South Ashland Avenue to the west. In 2006, Pilsen Historic District was listed on the National Register of Historic Places.","Schoenhofen Brewery District":"The Schoenhofen Brewery Historic District is centered on the former site of the Peter Schoenhofen Brewing Company at 18th and Canalport Avenue. Seventeen buildings once occupied the site when the brewery reached maximum capacity in 1910 at 1,200,000 barrels a year. Two of the remaining buildings demonstrate the change in architectural styles that occurred at the turn of the century in the United States. The facility also manufactured Green River. The brewery district was listed on the National Register of Historic Places on December 27, 1978, and the Administration Building and Powerhouse were later designated Chicago Landmarks on July 13, 1988.","South Water Market":"The South Water Market relocated to the Lower West Side in 1925. As of 2014, the five block facility had been redeveloped into the University Commons condominiums.","Demographics":"According to a 2015 analysis by the Chicago Metropolitan Agency for Planning, there were 34,410 people and 11,958 households on the Lower West Side. The racial makeup of the area was 13.4% White, 3.2% African American, 1.7% Asian, 1.1% from other races. Hispanic or Latino of any race were 80.5% of the population.\nIn the area, the population was spread out, with 27.4% under the age of 19, 30.8% from 20 to 34, 20.6% from 35 to 49, 12.9% from 50 to 64, and 8.4% who were 65 years of age or older. The median age was ~30 years which is younger than the citywide median of ~34 years.Figures from the United States Census Bureau demonstrate a level of gentrification from 2000 to 2010. The Mexican American population, constant between 1970 and 1999, decreased significantly from 2000 to 2010. This loss was primarily in the Pilsen neighborhood. This change corresponded with a simultaneous decline of families and an increase in one person households. Families decreased by 20.4% and families with children decreased 40.9%. During the same period, single person households increased 17.8%","Layout":"The east side of the neighborhood, along Halsted Street, is one of Chicago's largest art districts, and the neighborhood is also home to the National Museum of Mexican Art. St. Adalbert's dominates the skyline with the opulence typical of churches in the Polish Cathedral style.Pilsen is home to a multitude of murals and other forms of street art. With an initiative from the Chicago Urban Art Society and support from the National Museum of Mexican Art artists have been able to construct murals around the Pilsen neighborhood, adding to the history, culture, and community of the area.West 18th Street is an active commercial corridor, with Mexican bakeries, restaurants, and groceries, though the principal district for Mexican shopping is W 26th Street in Little Village, Chicago's other formerly majority Pan-Slavic community.\nThe United States Postal Service operates the Pilsen Post Office on 1859 S Ashland Avenue.The National Museum of Mexican Art is located in the Pilsen neighborhood.\nPodmajersky incorporated is a major property owner in the Pilsen area.","Street art":"The Pilsen neighborhood of Chicago has become a hub for muralists and street artists to convey their identity, passion, and activism. Murals are historically connected to Mayan and Aztec cultures which have influenced Mexican artists from the 1920s-present day.Mario Castillo painted Peace or Metafisico in 1968. This piece was the first Mexican and anti-Vietnam War murals in Pilsen. In 1969, he painted The Wall of Brotherhood which was inspired by an artwork located in the Bronzeville neighborhood.Some murals have remained the same or have been updated throughout the years and others have been modified to portray current events. In 1980, Marcos Raya created Fallen Dictator which portrays an anti-war and anti-imperialist message. This particular mural has been redone three times. The most recent update has images of Donald Trump and Hillary Clinton drawn as snakes and battling each other.In 2016, Sam Kirk and Sandra Atongiori created Weaving Cultures to highlight women of different backgrounds. The mural paints five different women, including a transgender Latina, with the goal of representing women of all demographics and promote acceptance of others.","Cuisine":"Robb Walsh of the Houston Press wrote that the Mexican restaurants in Pilsen are \"unconsciously authentic\" to original Mexican cuisine. According to Rick Bayless, the chef and owner of Frontera Grill,  this is because Mexican-Americans in Chicago do not encounter a substantial Chicano community in the United States that prefers a Tex Mex-style of cuisine, so the immigrants use the same frame of reference that they had in Mexico.","Transportation":"Public transit on the Lower West Side is provided by the Chicago Transit Authority and Metra. The Pink Line, part of the CTA's Chicago \"L\" train system, has three stops on the Lower West Side; the Western station, the Damen station, and the 18th Street station. The Orange Line has a single station, Ashland station, on the Lower West Side, but its ridership is primarily from neighboring Bridgeport and McKinley Park. The BNSF Railway has two stations on the Lower West Side; Halsted Street\/U.I.C. station and Western Avenue station. The CTA also operates 8 bus routes that go through the neighborhood; 9 Ashland, X9 Ashland express, 18 16th\/18th, 21 Cermak, 50 Damen, 49 Western, X49 Western Express, and 60 Blue Island\/26th. Routes 8 Halsted and 12 Roosevelt skirt the neighborhood too.\nThe Stevenson Expressway has exits at Damen Avenue and Ashland Avenue on the Lower West Side. The Canal Street railroad bridge, a Chicago landmark, is located on the Lower West Side. There are also bikeways on Blue Island Avenue, 18th, and Halsted Streets.","Politics":"In the 2016 presidential election, the Lower West Side cast 9,792 votes for Democrat Hillary Clinton and cast 715 votes for Republican Donald Trump. In the 2012 presidential election, the Lower West Side cast 14,028 votes for Democrat Barack Obama and 4,989 votes for Republican Mitt Romney. At the local level, the Lower West Side is located in the 25th ward, which is represented on the Chicago City Council by Alderman Daniel Solis. Solis is also the ward's Democratic Committeemen. His Republican counterpart is Martin Ozinga.In the United States House of Representatives, the Lower West Side is located in Illinois's 4th congressional district represented by Democrat Chuy García. In the Illinois General Assembly, the Lower West Side is in the 1st Legislative District, represented by Democrat Tony Munoz in the Illinois Senate, and the 2nd House district, represented by Democrat Theresa Mah in the Illinois House of Representatives.","Education":"Residents are zoned to Chicago Public Schools. Benito Juarez Community Academy, located in the Lower West Side, serves much of it. Other parts are zoned to Thomas Kelly High School.Lower West Side is home to the following educational institutions:\n\nJosiah L. Pickard Elementary School\nJungman Elementary School\nIrma C. Ruiz Elementary School\nJose Clemente Orozco Community Academy\nPeter Cooper Duo Language Academy\nCristo Rey Jesuit High School – private, Jesuit 9-12 school of the Roman Catholic Archdiocese of Chicago\nGads Hill Center – nonprofit youth and adult education center\nRudy Lozano Library – Chicago Public Library branch\nInstituto Health Sciences Career Academy – charter high school\nInstituto Justice and Leadership Academy – alternative high school\nSt. Ann School - Catholic, pre-kindergarten through eighth-grade school\nSt. Pius V School - Catholic, pre-kindergarten through eighth-grade school\nSt. Procopius School – Catholic, dual language elementary school\nWhittier Dual Language Community School – pre-kindergarten through 8 school\nJohn A. Walsh Elementary School","History of education":"Prior to the 1970s, Pilsen residents attended Jungman Elementary School for grades 1–6; Cooper School, adjacent to Jungman, for grades 7–8; Froebel School for grades 9-10, and Harrison Technical High School in South Lawndale for grades 11–12.Jungman opened in 1903. In 1914 an addition was installed. The building was converted into a junior high school in 1933 due to a decision by the Chicago Board of Education. It later became a branch of Harrison Tech, and then in 1947 a branch of Walsh Elementary.Froebel served as a branch for Harrison Tech due to overcrowding on the main campus; it was originally an elementary school.Teresa Fraga, Mary Gonzales and Raquel Guerrero are the three founding mothers of Benito Juarez Community High School. In the late 1960s, the three mothers shared concerns for their own children when the only public high school available was Harrison High school. Harrison High School was located in a neighborhood plagued with gang violence and racial tension between African Americans and Mexican Americans. The mothers wanted a safe and conducive school for Spanish speaking students. The school was proposed to Chicago's Board of Education multiple times but ultimately rejected. This led to protests and boycotts from many Mexican students and families. Finally, in June 1974, Chicago's Board of Education approved $8.9 million in funding to build a high school in Pilsen. Benito Juarez Community Academy opened in 1977 and now has a 94 percent Latino student body. The school is decorated with murals and statues that portray Mexican culture and famous leaders such as Benito Jaurez.","Notable residents":"Anton Cermak, 34th Mayor of Chicago (1931-1933)\nStuart Dybek, short fiction writer and poet.\nJames Foley, journalist and first American killed by I.S.I.L. He lived in Pilsen while attending the Medill School of Journalism.\nGeorge Halas, coach and owner of the Chicago Bears. He was raised in Pilsen and attended Peter Cooper School.\nJames Chico Hernandez, First sambo champion to be featured on a box of Wheaties Energy Crunch. He was raised in Pilsen.\nOtto Kerner Jr., 33rd Governor of Illinois (1961-1968). He was raised in Pilsen.\nOtto Kerner Sr., 28th Illinois Attorney General (1932-1938) and Judge of the United States Court of Appeals for the Seventh Circuit. He resided in Pilsen.\nAbigail Beasley\nJake Allex Mandusich (1887–1959), soldier who received the Medal of Honor for his service in the United States Army during World War I. In 1951, he resided at 1915 South Loomis Avenue.\nDaniel Solis, member of the Chicago City Council from the 25th ward (1996–2019). He resides on the Lower West Side.","See also":"H. Kramer and Company\nMexicans in Chicago","References":"","External links":"Official City of Chicago Lower West Side Map\nPilsen Portal\nArt Pilsen\nPilsen Neighbors Community Council\nPilsen, New York Times (1\/28\/15)"}]