[{"History":"McKinley Park has been a working-class area throughout its long history. Settlement began around 1836 when Irish immigrants working on the Illinois and Michigan Canal took squatter's rights to small tracts of land in the area. By the 1840s, a few farmers had purchased and drained land, displacing the Irish squatters. Brighton was plotted in 1840 and incorporated in 1851.\nThe completion of the Illinois and Michigan Canal in 1848 and the arrival of the Chicago and Alton Railroad in 1857 spurred further subdivision of the area. The rails amplified the transportation advantages of the area, and during the Civil War, industries grew along the waterways and the railroad. The Union Rolling Mill was founded in 1863 along the south fork of the Chicago River and produced 50 tons of rail per day. Eventually, the firm became part of U.S. Steel. The Rolling Mill employed many newly arrived Welsh immigrants, who lived in nearby homes on Ashland and Archer Avenue's.\nMany steelworkers lived in the triangle formed by Ashland Avenue, Archer Avenue and 35th Street in an area called Mt. Pleasant. The name was probably ironic, because of the adjacent steel mills, and because much of the area was swampy and undrained. Standing water bred hordes of mosquitoes, and spring flooding was so severe that many houses were built on stilts. Not surprisingly, a portion of McKinley Park was called \"Ducktown.\" Some landowners desperate to elevate their holdings invited scavengers to dump ashes and thereby fill low areas. Unfortunately the scavengers dumped not only ashes, but garbage as well. Thus the area was not only wet, but fetid. Even with these problems, McKinley Park was annexed to Chicago in 1863.\nThe fire of 1871 displaced numerous industrial operations and many relocated to this area. Within five years after the fire, 11 factories opened—most in iron and steel—along with 27 brickyards. During this same period, meatpacking operations just to the south moved into high gear. The result was the creation of the solid working-class community that still exists today.\nThe packing houses fouled the environment and dumped wastes directly into the south fork of the Chicago River. Here the stream was such a hellish mess of decomposing material that a tributary became known as \"Bubbly Creek\" because of the bubbles that constantly roiled its surface. The situation finally became so horrendous that the stream's upper reaches were filled in to rectify the problem.\nIf industries created pollution, they also created many good industrial jobs and led to a period of unprecedented growth and prosperity. Irish, Germans, Swedes, English, and native-born Americans filled the industrial jobs of the 1870s. Even after 1900, when Poles and other Central Europeans came to the area, English prevailed as the street language, and the area was the most American of all settlements in the stockyard districts. Transportation had always been poor, but the 1880s and 1890s saw improvement and extension of the car lines on Archer Avenue and on 35th Street. As time passed, steel mills and brickyards closed and industries changed, replaced by new activities. The Central Manufacturing District was begun in 1905 on some 260 acres (1.1 km2) along the south fork. In the late 1990s it was still operating, Pepsi-Cola was opening a new bottling plant, and the Wrigley Company was still making chewing gum. Meanwhile, the Chicago Sun-Times was building a mammoth publishing and distribution plant west of Ashland along the Chicago River.\nThe beginning of the twentieth century led, after years of complaints by residents, to the creation of a park, which was named for President McKinley after his assassination. The park replaced Brighton Trotting Park established in 1855. The 69-acre (280,000 m2) park now boasts a swimming pool and ice-skating rink. It is the area's showplace and led to the naming of the entire community.\nAfter years of declining populations, during the 1990s the population grew from 13,297 to 15,962, with Mexicans joining the ethnic mix. Well-kept two and four-flat buildings dominate the landscape, but new infill housing has begun to appear. Two stops on the Orange Line rapid transit have boosted property values and spurred development of a shopping mall on Archer and Ashland Avenue.","Politics":"The McKinley Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, McKinley Park cast 2,696 votes for Hillary Clinton and cast 538 votes for Donald Trump (78.12% to 15.59%). In the 2012 presidential election, McKinley Park cast 2,340 votes for Barack Obama and cast 452 votes for Mitt Romney (81.70% to 15.78%).","Culture":"McKinley Park is served by three neighborhood newspapers: the Bridgeport News, the Archer Journal News and the Brighton Park\/McKinley Park Life, in addition to the online McKinley Park News. The neighborhood newspapers are delivered weekly on Wednesdays to homes, businesses and other establishments throughout the neighborhood.\nNumerous environmental justice groups are based in and serve McKinley Park, including Neighbors for Environmental Justice, and the Southwest Environmental Alliance.","References":"","External links":"Official City of Chicago McKinley Park Community Map"}]