[{"History":"William Sayre bought the land that would become Montclare at a Jefferson Township land sale. The 1870s brought the railroad and a housing development. The developers named the area Montclare, after Montclair, New Jersey. In 1889, the area was annexed into Chicago with the rest of Jefferson Township. At the time of annexation, the rural, agricultural area had fourteen houses and 120 residents. In 1912, the Grand Avenue streetcar was extended to the area and Tudor houses were built in response. The area continued to be relatively undeveloped during this period.During the latter half of the twentieth century, the area saw an increase in brick bungalows and residents attracted by the suburban character of the area.","Geography":"The area is bordered by Harlem Avenue on the west, Belmont Avenue on the north and railroad tracks to both the south and east. These railroad tracks include those that service the area via the Milwaukee District\/West Line at Mont Clare station and the former Dunning spur line that the Milwaukee Road used to serve the Chicago-Read Mental Health Center and several factories among the Brickyard. The Dunning spur was torn up by Canadian Pacific, the successor to the Milwaukee Road. Located at Chicago's city limits, it borders the village of Elmwood Park to the west. \nConsistent with the area's history the majority of land use in the area is single family residential and transportation with acreage of 250 acres and 193 acres respectively. Other land uses include 63 acres of multi family residential, 55 acres of commercial development, 6 acres of mixed use development, 19 acres of industrial development, 29 acres of institutional development and 11 acres of open space.It is often paired with the neighboring Galewood neighborhood in Austin.","Demographics":"According to a 2016 analysis by the Chicago Metropolitan Agency for Planning, there were 12,887 people and 4,429 households residing in the area. The racial makeup of the area was 31.60% White, 3.60% African American, 5.70% Asian, 0.80% from other races. Hispanics or Latinos of any race were 58.20% of the population. The age distribution is 27.30% under the age of 19, 22.60% from 20 to 34, 20.80% from 35 to 49, 18.20% from 50 to 64, and 11.80% who were 65 years of age or older. The media age was 35 years.The median household income for the area was $41,593 as opposed to $47,831 for the city; 24.4% of Montclare residents earned less than $25,000, 33.4% of residents earned between $25,000 and $49,999, 14.8% earned between $50,000 and $74,999, 12.4% earned between $75,000 and $99,999, 11.1% earned between $100,000 and $149,999, 3.9% earned $150,000 or more. There were 6,381 residents in the labor force. 12% of workers were employed in manufacturing, 11.6% were employed in healthcare, 11% were employed in retail, 10.1% worked in administration, and 9% worked in hospitality and food services. The area had an unemployment rate of 12.3%.","Politics":"In the 2016 presidential election, Montclare cast 3,492 votes for Hillary Clinton and cast 984 votes for Donald Trump. In the 2012 presidential election, Montclare cast 2,973 votes for Barack Obama and 883 votes for Mitt Romney.","Notable people":"Luis Arroyo (born 1954), Former Democratic member of the Illinois House of Representatives.\nMax Bedacht (1883–1972), political activist and functionary who helped establish the Communist Party of America. Bedacht lived at 3101 North Nordica Avenue, from 1923 to 1928, according to his testimony before HUAC in 1949.\nTony Canadeo (1919–2003), professional football player. He was a childhood resident of 2643 North Rutherford Avenue.\nLawrence DiPrima  (1910–1991), Democratic member of the Illinois House of Representatives from 1963 to 1985  He resided in, and represented, Montclare in the House.\nRay Soden (1925–2012), member of the Illinois Senate and National Commander of the Veterans of Foreign Wars. Soden was raised at 2309 North New England Avenue in the Montclare area.\nGilbert Villegas, member of the Chicago City Council from the 36th ward since 2015. He is a Montclare resident.","References":"","External links":"Official City of Chicago Montclare Community Map"}]