[{"History":"The community was initially settled in the mid-19th century and known as North Blue Island because of its geographic relationship to the already established settlement of Blue Island to the south and because of its position on the Blue Island Ridge. Thomas Morgan became the area's largest landholder when he purchased all of the property between what is today 91st St. on the north, 119th St. on the south, Western Avenue on the west, and roughly Vincennes Ave. to the east. Morgan was born in Surrey, England, and came to the United States in 1843, briefly settling in Albany, New York.  He was the son of a London banker and was left a large fortune by his father which he used to establish himself on the ridge in 1844. Here he cleared trees and operated a cattle and sheep ranch for the next quarter of a century.  Morgan's son Henry was for a time the village president of Hyde Park before that community was annexed to the City of Chicago in 1889. In 1869, the Blue Island Land and Building Company purchased three thousand acres of this property from the Morgan family and laid out streets, planted thousands of trees, and built houses for those who were attracted to the bucolic atmosphere of the new community. The goal of the organization was to create a suburban community \"..free from smoke and other nuisances that [were] becoming more and more intolerable in the city\".Both the president and the treasurer of the Blue Island Land and Building Company were executives of the Rock Island Railroad at the time the former company was incorporated, and they immediately used their influence to have a spur line built to serve the new community. This arrangement lasted until 1889, when the \"Suburban Line\" as it exists today was built between Gresham and the Vermont Street station in Blue Island, at which time the dummy line, as it was called, was removed, much to the consternation of those who lived immediately nearby. At this point Morgan Park received three handsome passenger depots (at 107th St., 111th St., and 115th St.), with the 111th Street station being an elaborate Queen Ann structure designed by John T. Long that is sited immediately east of Bohn Park.\nMorgan Park (and especially the area of it depicted in western part of the map included with this article) is primarily an upper middle-class community, with a housing stock to reflect this demographic, although there are several estate-sized houses on the ridge at Longwood Drive. Many of the buildings in the neighborhood were designed by notable architects, including Dwight Perkins, Dankmar Adler, Murray Hetherington, John Hetherington, Palliser, Palliser & Co., Normand S. Patton and Harry H. Waterman. The community is home to the Beverly Arts Center.\nBecause of its ecclesiastical associations (George Walker's father was affiliated with the old University of Chicago and Walker himself would play an influential role in the creation of the present University of Chicago, both of which were founded by organizations with Baptist connections) Morgan Park prohibited the sale of alcohol east of Western Avenue when it was incorporated as a village in 1882 – a ban which stands to this day. The suburb became a city neighborhood when it was annexed in 1914.","Geography":"Morgan Park is located south of the Beverly neighborhood and shares a border at 107th St. with Beverly on the north, Halsted St. (north of 115th St.) and Ashland Ave. (south of 115th St.) on the east, 119th St. on the south, and (roughly) California Ave. on the west, as well as Mount Greenwood Cemetery. Beverly and Morgan Park share the same ZIP Code.","Horse Thief Hollow":"In the early 1840s, a small section of what was to become southern Morgan Park had an unsavory reputation with the settlers in the region. What follows are the recollections of Isaac T. Greenacre, an early 19th-century resident who settled at the north end of the ridge.  The area he describes below is today what is roughly the stretch of Vincennes Avenue from 115th Street to 121st Street:\n\n\"On the edge of the hill on which Morgan Park is situated, and a little south, is a deep and exceedingly steep ravine. This in early times was covered with long grass and thick underbrush, and was not only a very discreet hiding place, but a very formidable fortress for horse thieves. These notable gentry were rather nocturnal in their habits, as they traveled during the night and by day were wont to refresh themselves in Horse Thief Hollow. I imagine it must have been a solitary place as the long grass, thick underbrush, and the forest overhead must have entirely excluded the sunlight from it. The farmers are confident of the character of this den, having found in it bags of oats and other commodities which proved the use of the ravine for horse stealing. The bottom of the ravine was trampled into a mire by horses' hoofs, and once in a while they would find a horse shoe. The farmers have watched these gentry and proved to themselves the purpose of their frequent visitations. The horse thieves generally traveled by the aid of a buggy, in which they kept all the utensils necessary for their business.\"","Rotary International":"Rotary International, the first world-wide community service organization, was formed in Chicago in 1905. Rotary's founder Paul P. Harris, married Jean and they moved to Morgan Park at 10856 S. Longwood Drive.  Today the house is owned and maintained as a memorial to Paul P. Harris and his wife, Jean, and as an inspiration for Rotarians around the world.","Demographics":"As of 2013 54.8% of the residents were black and 37.2% of the residents were white. As of that year it was, within Chicago, the black-majority area with the highest percentage of whites.","Government and infrastructure":"The United States Postal Service operates the Morgan Park Post Office.","Politics":"The Morgan Park community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, Morgan Park cast 10,084 votes for Hillary Clinton and cast 1,708 votes for Donald Trump (82.78% to 14.02%). In the 2012 presidential election, Morgan Park cast 11,848 votes for Barack Obama and cast 2,062 votes for Mitt Romney (84.39% to 14.69%).","Education":"Chicago Public Schools operates public schools in Morgan Park. Morgan Park High School, Clissold School, and Esmond Elementary School (one of the Chicago Public School's oldest school buildings, having been being built in the 1890s, and added to in the early years of the 20th century and again in the 1970s) represent the public educational institutions that today call Morgan Park home.\nZoned K-8 schools include Clissold, Esmond, Shoop, Mount Vernon, Higgins, and Haley. Morgan Park High serves most of Morgan Park, while small sections of the community area are zoned to Julian High School and Fenger High School.St. Cajetan and St. Walter, both private Catholic schools, are located in Morgan Park.","History of education":"There was a serious attempt made by the Blue Island Land and Building Company to have Morgan Park become a great center of learning, an effort which was successful to a degree in that it brought to the community Morgan Park Academy (founded in 1873 as Mt Vernon Military & Classical Academy), the Chicago Female College (established 1875), Baptist Union Theological Seminary (which relocated to Morgan Park from Chicago in 1877 and where the noted educator William Rainey Harper was granted a professorship at the age of twenty-three), and the American Institute of Hebrew.\nThere was also an effort made in 1888 to bring the new University of Chicago to the community, although that project developed in another direction when its primary benefactor, John D. Rockefeller, indicated a preference for the significantly larger site at 57th Street and Ellis Avenue in Hyde Park that was donated by Marshall Field. It was thought by virtue of its size and its location in what was then the city proper that that property would allow for a much grander vision, and the \"proposals (in Morgan Park) were at once laid aside in view of the greater plan\". When the university opened in 1892, it absorbed the Chicago Female College and the Baptist Union Theological Seminary (the latter then becoming the university's divinity school), and for the next fifteen years Morgan Park Academy became a preparatory school for the university (at which time it was known as Morgan Park Academy of the University of Chicago) until the death of U of C president William Rainey Harper in 1906 ended the university's sponsorship and it passed into other hands. The school continues to operate today serving a highly diverse student body. It was recently ranked among the top private schools in Chicago.In 1988 the Walgreen family donated their home on the ridge at 116th & Longwood Drive to the Mercy Home for Girls.Morgan Park High School is home to the Morgan Park Mustangs, who are one half of the biggest rivalry in Chicago Public Schools between themselves and the Simeon Wolverines","Notable people":"Lee Bernet, offensive tackle who played professionally for the Denver Broncos in the American Football League from 1965 to 1966.\nEmmet Byrne (1896–1974), member of the U.S. House of Representatives from Illinois's 3rd congressional district from 1957 to 1959. He resided at 2124 West 116th Street while a member of Congress.\nPeter Cetera, former bassist, vocalist and founding member of the band Chicago, lived on Vincennes Avenue when growing up.\nAyo Dosunmu, professional basketball player for the Chicago Bulls of the NBA. Dosunmu graduated from Morgan Park High School, played for Illinois, then was drafted by his hometown Bulls in 2021.\nFred Evans, defensive tackle who played for the Minnesota Vikings.\nAja Evans, Olympic bobsled bronze medalist in 2014 and World Championships Bobsled Bronze medalist in 2017.\nPaul P. Harris, founder of Rotary International. He lived at 10856 S. Longwood Dr. The home is now owned and managed by the Paul and Jean Harris Home Foundation; affiliated with Rotary International.\nMae Jemison (born 1956), engineer, physician and astronaut. She became the first African-American woman to travel in space as part of a NASA crew on the Space Shuttle Endeavour.\nJeremih (born 1987), recording artist and producer\nEmil Jones, 37th president of the Illinois Senate, born in Morgan Park.\nJeremiah E. Joyce (born 1943), member of the Illinois Senate from 1979 to 1993. He was a resident of Morgan Park while serving on the Chicago City Council.\nOtis McDonald (1933–2014), plaintiff in McDonald v. City of Chicago, which struck down Chicago's longstanding ban on handguns based on the Due Process Clause of the Fourteenth Amendment.\nJeremy Rifkin, economist, writer and public speaker; founder of Foundation on Economic Trends.","In popular culture":"Lena Younger in \"A Raisin in the Sun\", reminisces about her early life as a married woman with dreams of buying a \"two-story house\" in the Morgan Park section of Chicago.","References":"Anderson, Jon (July 14, 2005). \"Hilltop mansion holds history of a fellowship; Century-old Rotary International took shape in gatherings at a picturesque and inviting home on the Far South Side, now preserved as a legacy to its founder\". Chicago Tribune: Section 2c p.3.\nPaul Harris Home","External links":"Official City of Chicago Morgan Park Community Map\nRidge Historical Society"}]