[{"History":"In the mid-nineteenth century, German and Dutch farmers settled the area. The region received its name in 1879 when the surveyor George Washington Waite platted an eighty-acre land grant that he had received from the federal government.The proliferation of saloons led to a movement to turn Mount Greenwood into a \"dry area\" like the nearby communities of Morgan Park and Beverly. To prevent this, a group of citizens successfully campaign to incorporate Mount Greenwood as a village. Twenty years later, in 1927, the community voted to be annexed into Chicago to receive better services. The promised infrastructure took longer than anticipated to be delivered due to the Great Depression. Those services finally came nine years later, in 1936, when the Works Progress Administration installed sewers. Residents were still seeking improvements such as curbs into the 1960s. Despite being annexed by Chicago, the area maintained a character similar to nearby blue collar city-suburbs.Mount Greenwood was home to the last farm in Chicago, owned by Peter Ouwenga until the mid-1980s when he sold his farm to the Chicago Public School system. The district built the Chicago High School for Agricultural Sciences on Peter Ouwenga's land, an experimental magnet high school devoted to teaching agricultural science to urban students. It was the second school of its kind after W.B. Saul High School in Philadelphia.","Racial tension":"Mount Greenwood's history has been characterized by racial tension. In the 1970s, a Mount Greenwood civic group, joined two other community groups to file a complaint with the Department of Justice over racial quotas at the Robert Black Mini-Magnet school that allegedly favored minorities. In 1992, The New York Times interviewed over one hundred residents of Mount Greenwood and Roseland in which Mount Greenwood residents seemingly endorsed the de facto segregation and expressed their beliefs in welfare queens and other stereotypes. Around the same time as the New York Times piece, residents successfully managed to restrict the number of minority students who could attend Chicago High School for Agricultural Sciences which at the time had a predominantly black student body. In the late 1990s, an African-American family alleged that they were driven out of the neighborhood by persistent vandalism and harassment. In 2016, the area was the site of a clash between the Blue Lives Matter and Black Lives Matter movements after the latter came to Mount Greenwood to protest after the shooting of 25-year-old Joshua Beal by an off duty police officer.","Geography":"Its approximate borders are 103rd Street to the north, 117th Street to the south, Pulaski Road to the west, and Sacramento Avenue to the east. Mount Greenwood is a rarity amongst Chicago community areas as residents, the city and academics largely agree on its boundaries. The area has three neighborhoods; Mount Greenwood, Mount Greenwood Heights and Talley's Corner.Land use in Mount Greenwood consists mostly of single family residential housing of which there is 748 acres, most of which was built between 1940 and 1970. The presence of the Chicago High School for Agricultural Science and St. Xavier University contribute to the 523 acres of institutional land use. Additionally, there is 365 acres of transportation use, 37 acres of commercial use, 30 acres of open space, 19 acres of multifamily residential housing and 8 acres of mixed use buildings.Mount Greenwood is home to a large number of cemeteries and, for a time, was nicknamed the Seven Holy Tombs. Although completely surrounded by the City of Chicago, Mount Greenwood Cemetery is in unincorporated Cook County.","Demographics":"The Mount Greenwood area has a reputation as a historical bastion of the South Side Irish. Mount Greenwood has the fourth highest percent of self-reported Irish Americans in the United States, at 46%. The area has historically been predominantly white and Mount Greenwood was the destination for many Chicagoans during the white flight of the latter half of the twentieth century. As recently as 1998, an African-American family moving into Mount Greenwood was a newsworthy item.According to a 2016 analysis by the Chicago Metropolitan Agency for Planning, there were 18,357 people and 6,416 households in Mount Greenwood. The racial makeup of the area was 86.5% White, 4.5% African American, 2.2% Asian, 1.1% from other races. Hispanic or Latino of any race were 5.7% of the population. In the area, the population was spread out, with 29.5% under the age of 19, 18.2% from 20 to 34, 22.5% from 35 to 49, 18.8% from 50 to 64, and 11% who were 65 years of age or older. The median age was 36 years.The median household income was $89,728 compared to a median income of $47,831 for Chicago at-large. The area had an Income distribution in which 10.8% of households earned less than $25,000 annually; 13.5% of households earned between $25,000 and $49,999; 16.1% of households earned between $50,000 and $74,999; 16.3% of households earned between $75,000 and $99,999; 27.8% of households earned between $100,000 and $149,999 and 15.5% of households earned more than $150,000. This is compared to a distribution of 28.8%, 22.8%, 16.1%, 10.7%, 11.3% and 10.3% for Chicago at large. Mount Greenwood's status as one of the wealthier Chicago community areas is further reflected in a home ownership rate of 87.5% compared to 44.7% rate for Chicago-at-large.\nOver 95% of Mount Greenwood residents have graduated from high school and over one third of residents have graduated from college.","Economy":"The top 5 employing industry sectors of Mount Greenwood residents are public administration (21.8%), education (16.0%), health care (11.3%), retail trade (6.9%) and accommodation and food service (6.2%). A plurality of the workforce works in the surrounding suburbs with the remainder working in the central business district. A small number of Mount Greenwood residents work in Mount Greenwood. A significant portion of residents are City of Chicago employees.Over two thirds of these workers reside outside of Chicago and one fifth reside in Mount Greenwood and the surrounding neighborhoods. The area's main commercial corridor is along 111th Street. The corridor has seen an increase in the construction of new shopping centers since the creation of a TIF district in 2009.","Transportation":"The nearest Metra stations to Mount Greenwood are on the Rock Island District line and include the 103rd Street and 107th Street stations in Beverly and the 111th Street and 115th Street stations in Morgan Park. Nearly 90% of commuters drive to work.","Schools and libraries":"In 1956, Saint Xavier University moved to Mount Greenwood from the Douglas area. By the 1980s, Mount Greenwood was home two of the last surviving farms in the city, one of which was developed as the Chicago High School for Agricultural Sciences at the southeast corner of 111th and Pulaski. Mount Greenwood is home to one Catholic elementary school, three Catholic high schools (Brother Rice High School, Marist High School, and Mother McAuley Liberal Arts High School). Public grade schools in the area are Mt. Greenwood Elementary School, George F. Cassell Elementary School, and Annie Keller Regional Gifted Center. The neighborhood is zoned to Morgan Park High School.  Mount Greenwood, like many other Chicago neighborhoods, has its own branch of the Chicago Public Library. The library in this area looks identical to the Hegewisch Branch of the Chicago Public Library. The library has a significant Irish heritage collection.","Parks":"Mount Greenwood has 2.8 acres of park land per 1,000 residents. The booming Mount Greenwood community was among the neighborhoods identified for park development in the Chicago Park District's Ten Year Plan to provide increased recreational opportunities in post-World War II Chicago. In 1946, the Mount Greenwood Civic Council urged the acquisition of vacant Board of Education land along 111th Street. The park district purchased the 24-acre (97,000 m2) site in 1949, and slowly began improving the property. The park district constructed a fieldhouse in 1966, and added a swimming pool in 1973. The 1990s brought further improvements. A soft surface playground featured an airport\/train station-themed play area. A refrigerated ice skating rink provides winter recreation.\nSeveral features of Mount Greenwood Park honor noted local citizens. A parking area is dedicated to Frederick G. Abrams Sr. a Chicago Alderman and Treasurer of the Village of Mount Greenwood from 1918 to 1927. A baseball diamond bears the name Rooney Field, in honor of Rooney Richardson (--1982), who took an active role in community affairs.","Politics":"In the 2016 presidential election, Mount Greenwood was the only community area in the city of Chicago won by Donald Trump. The area cast 5,445 votes for Trump and cast 3,320 votes for Hillary Clinton. Mount Greenwood had also gone for the Republican candidate in 2012 with 4,908 votes cast for Mitt Romney and 3,983 votes cast for Barack Obama.In the Illinois General Assembly, Mount Greenwood is located in the 18th legislative district and represented by Democratic Senator Bill Cunningham, Democratic Representative Frances Ann Hurley and Democratic Representative Kelly M. Burke.Mount Greenwood has always been in the 19th ward. The current alderman is Matthew O'Shea of neighboring Beverly.Aldermen who have represented Mount Greenwood since 1927\n1927–1928: Donal S. McKinlay\n1928–1929: Vacant\n1929–1935: O.E. Northrup, Republican\n1935–1950: Brian J. Ducey\n1950–1951: Vacant\n1951–1957: David T. McKiernan, Republican (died in office)\n1957: Vacant\n1957–1975: Thomas F. Fitzpatrick, Democratic\n1975–1979: Jeremiah E. Joyce, Democratic\n1979–1991: Michael Sheahan, Democratic\n1991–2011: Virginia Rugai, Democratic\n2011–present: Matthew O'Shea, Democratic","Notable people":"Lar \"America First\" Daly, perennial political candidate whose eccentric campaigns received national media attention due to the equal-time rule.\nTom Dart, Sheriff of Cook County since 2007. He is a Mount Greenwood resident.\nTerrence A. Duffy, chairman and CEO of CME Group which operates the world's largest options and futures exchange. He was raised in Mount Greenwood.\nBridget Gainer, Democratic member of the Cook County Board of Commissioners. Gainer, now a Lake View resident, was raised in the Mount Greenwood neighborhood.\nFran Hurley, Democratic member of the Illinois House of Representatives. A Mount Greenwood native, she has represented the 35th district since 2013.\nJeremiah E. Joyce, Democratic member of the Illinois Senate from 1979 to 1992. He was a member of the Mount Greenwood Lions Club.\nNorman J. Kansfield, senior scholar in residence at Drew University who was suspended from being a minister in the Reformed Church in America in 2005 after officiating at his daughter's same-sex marriage. He was baptized in a Mount Greenwood Church.\nJordan Lynch, quarterback for the Edmonton Elks of the Canadian Football League. He was raised in the neighborhood.\nPat O'Connor, defensive end for the Tampa Bay Buccaneers of the National Football League. He was raised in Mount Greenwood.\nJohn R. Powers, author of Do Black Patent Leather Shoes Really Reflect Up? and the Eddie Ryan Trilogy, a fictionalized trilogy of his experience growing up in the neighborhood.\nMargaret Smith, six-time Emmy Award winning standup comic, actress, writer and producer.","References":"","External links":"Official City of Chicago Mount Greenwood Community Map\nEncyclopedia of Chicago entry on Mount Greenwood"}]