[{"Neighborhoods":"","West Loop":"The West Loop lies along the western bank of the Chicago River. It generally includes the districts of Fulton River, Fulton Market, and Greektown.  It is approximately bounded by Grand Avenue on the north, Ashland Avenue on the west, the Eisenhower Expressway on the south, and the Chicago River on the east. Popular restaurants line Randolph Street, including Girl and the Goat by Stephanie Izard, and Leña Brava, founded by Rick Bayless who has since departed the establishment.  The area has experienced rapid gentrification. A former manufacturing and warehousing area, many of the buildings have been converted to loft condominiums, restaurants, bars, and art galleries. Oprah Winfrey's Harpo Studios were located on Randolph Street; the site is now the recently constructed corporate headquarters of McDonald's. Soho House was one of the first boutique hotels in West Loop; Ace Hotels followed in 2017 but  closed and re-branded. The Hoxton and Nobu Hotel and Restaurant later joined the neighborhood. Retailers in West Loop include Billy Reid, Lululemon, Slowear, Free People, and Madewell.","Fulton River District and Fulton Market":"","Greektown":"","Little Italy":"The neighborhood between the Illinois Medical District and UIC's east campus is known as Little Italy. An Italian community developed in the late nineteenth century.\nItalians never actually constituted a majority in the polyglot area, but the neighborhood is still home to several Italian-American landmarks, such as the Shrine of Our Lady of Pompei and the National Italian American Sports Hall of Fame, as well as Italian-American social clubs. Taylor Street is home to the Italian restaurants Rosebud, Francesca's, Pompei and Al's No. 1 Italian Beef. There are other schools in this neighborhood. For example, Village Leadership Academy (VLA).\nPart of the Italian-American population of the neighborhood was displaced in the 1960s and 70s by the construction of UIC's east campus. The university is the source of the current name for the area.\nThe 1980 novel Paper Fish by Tina De Rosa takes place in this community.","University Village\/Maxwell Street":"University Village is a  neighborhood consisting of residential and retail properties. University Village, along with other major developments such as University Commons and University Station, is conveniently located near the University of Illinois at Chicago (UIC) campus, the medical district, and Maxwell Street.\nThe blocks around the intersection of Maxwell and Halsted Streets, the heart of University Village, once served as a weekly outdoor market. The area was also a center in the development of the Chicago Blues in the mid-twentieth century. The Market was moved twice in the 1990s and 2000s, and continues on Des Plaines Street. In the 2000s, UIC led a redevelopment of the area, which included new dormitories, parking garages, commercial buildings, and housing.\nThe borders are 16th Street to the south, the Dan Ryan Expressway to the east, Racine to the west, and Harrison Street to the north.  Taylor Street is part of University Village.","South Water Market":"Chicago's original produce market sat along the south side of the Chicago River, west of what is now Michigan Avenue. Incoming vessels could bring fruits and vegetables from the states located around the Great Lakes. This market became known as South Water Market because of its location.By the 1920s, the market was congested and overcrowded. The City of Chicago built new streets parallel to the Chicago River and moved the market to the neighborhood, alongside the St. Charles Air Line. The three-story buildings were originally designed by the architects Fugard & Knapp.\nOn July 10, 2003, the Chicago Planning Commission granted their approval on the sale of the produce market for a cost of approximately $36 million to Enterprise Companies of Chicago redevelop into retail and housing.","Illinois Medical District":"The Illinois Medical District is one of the largest medical districts in the United States, and the largest in the state. John H. Stroger Jr. Hospital of Cook County (formerly known as Cook County Hospital), one of the largest county-run hospitals in the U.S. and inspiration for the TV shows ER and The Fugitive, is located here. The District had its start in the 1870s when Cook County Hospital, Rush Medical College, and the College of Physicians and Surgeons were established on the Near West Side following the great Chicago fire of 1871. The cornerstone for the Medical Center was the building of Cook County Hospital in 1876. In 1877, Rush Medical College erected a building next to County at Harrison and Wood. Presbyterian Hospital (affiliated with Rush) was built in 1883. The University of Illinois at Chicago's origins in the District can be traced to the College of Physicians and Surgeons, founded in 1881. In 1917, the State acquired the vacated West Side Park located at Polk and Wolcott for the University.\nThe district is also home to University of Illinois Medical Center, Rush University Medical Center, Rush University, University of Illinois College of Medicine, Illinois Eye and Ear Infirmary, UIC College of Dentistry, UIC College of Pharmacy, Jesse Brown VA, The Neuropsychiatric Institute, Ruth M. Rothstein CORE Center, Chicago Lighthouse, Illinois Forensic Science Center, West Side CDC, the Chicago Children's Advocacy Center, the Chicago office of the Federal Bureau of Investigation, the Cook County Juvenile Temporary Detention Center, Chicago Department of Public Health and the Cook County Medical Examiner's Office.","Tri-Taylor":"The Tri-Taylor neighborhood lies directly west of the Illinois Medical District. The neighborhood area roughly resembles a triangle with Interstate 290, Ogden Avenue, and industrial railroad tracks west of Western Avenue as the borders. The neighborhood is traditionally an extension of the Little Italy neighborhood to its east, although it has consistently been one of the most diverse neighborhoods in Chicago as it was situated on the borders of African American, Irish, Hispanic, and Italian areas. It is a residential area for students from UIC. The neighborhood is also home to the Chicago Technology Park research center as well as the West Side Center for Disease Control, the office for the Medical Examiner of Cook County, and Chicago Hope Academy (a private Christian high school that opened in the former St. Callistus School in 2005).","United Center area":"The United Center opened its doors in 1994, replacing Chicago Stadium, which was located on the opposite side of Madison Street. The United Center is the home arena for the Chicago Bulls and Blackhawks, and also occasionally hosts concerts and other special events. The venue can seat between 20,000 and 25,000 people, depending on the event. A statue of Michael Jordan sits in front of the arena. The area around the United Center used to be known for its notoriously high crime rate and housing projects off Lake Street and Damen known as the Henry Horner Homes, also known as \"the Hornetz nest\".","Landmarks":"Designated Chicago Landmarks in the Near West Side include:\n\nFirst Baptist Congregational Church, aka Union Park Congregational Church and Carpenter Chapel\nGroesbeck House\nMonument of the Haymarket Riot\nHolden House\nHull House\nJackson Boulevard District and Extension\nLake Street Schlitz Tied House\nMetropolitan Missionary Baptist Church\nSt. Ignatius College Prep\nUnion Station\nUnion Park Hotel (formerly the Viceroy Hotel)\nWest Town State Bank Building\nFulton-Randolph Market District\nFire Station 18 (Location Of Chicago Fire TV Show)","Politics":"","Local":"In the Chicago City Council, the plurality of the area is within 27th ward, represented by Democrat Walter Burnett Jr., while substantial parts are located within the 25th and 28th wards, represented by Democrats Daniel Solis and Jason Ervin, and smaller parts are within the 11th and 42nd wards, represented by Democrats Patrick Daley Thompson and Brendan Reilly.","State":"In the Illinois Senate, the Near West Side is located almost entirely in the 5th Legislative District, represented by Democratic Senator Patricia Van Pelt. In the Illinois House of Representatives, it is located in the 9th House District and the 10th House District represented by Democratic Representatives Jawaharial Williams and Lakesia Collins.Small portions of the Near West Side are located in the 1st Legislative District, represented by Democratic Senator Antonio Munoz, the 3rd Legislative District, represented by Democratic Senator Mattie Hunter, the 2nd Representative District, represented by Theresa Mah, and the 6th Representative District, represented by Sonya Harper.","Federal":"Almost all of the area is part of Illinois's 7th congressional district, the most Democratically leaning district in the State of Illinois according to the Cook Partisan Voting Index, with a score of D+38, represented by Democrat Danny K. Davis. The southeasternmost jog is part of Illinois's 4th congressional district, the second-most Democratically leaning district in the state, with a Cook score of D+33, represented by Democrat Luis Gutiérrez.\nThe Near West Side community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Near West Side cast 20,622 votes for Hillary Clinton and cast 3,094 votes for Donald Trump (82.68% to 12.40%). In the 2012 presidential election, the Near West Side cast\n18,068 votes for Barack Obama and cast 4,234 votes for Mitt Romney (79.51% to 18.63%).","Government":"The United States Postal Service (USPS) operates the main Chicago Post Office at 433 West Harrison Street in the Near West Side. The post office is the only 24-hour post office in the United States. USPS also operates the Nancy B. Jefferson Post Office at 116 South Western Avenue.The Federal Bureau of Investigation Chicago Field Office is at 2111 W. Roosevelt Road.","Transportation":"","Private transportation":"Interstates 290 and 90 both run through the Near West Side. Their interchange is a major transportation hub for the region. The southern and western boundaries of the area are defined by busy rail-road tracks. The St. Charles Air Line, at the area's southern edge is also a major passenger train route.","Public transportation":"There are many bus routes in the area.\nFor rapid transit, the area is served by the Blue, Green, and Pink Lines on the Chicago \"L\". The Lake Street Elevated, the portion of the Green Line running through the area, has been in operation since 1893. The Metropolitan West Side Elevated Railroad, another company that built the \"L\", opened several branches of rapid transit in the area in 1895 and 1896. These branches included the Logan Square, Garfield Park, and Douglas Park branches, which all converged into the Metropolitan main line at Marshfield station in the area. The Garfield Park branch and main line were replaced by the Congress Line in the 1950s, which continues as part of the Blue Line. The Logan Square branch was replaced in revenue service by the Milwaukee-Dearborn subway in 1951, but was retained for non-revenue linkage to the rest of the \"L\" system as the \"Paulina Connector\"; it was renovated in the 2000s and reactivated as part of the Pink Line in 2006. The Douglas Park branch was part of the Blue Line until it was joined with the Connector to become a part of the Pink Line.\nUnion and Ogilvie stations, major terminals for Metra and Amtrak trains, are on the eastern edge of the Near West Side. The Chicago Aurora and Elgin Railroad (AE&C), an interurban, used the Garfield Park branch and Metropolitan main line's tracks in the area to access downtown from 1905 to 1953; however, within Chicago it only boarded westbound passengers and alighted eastbound passengers lest it compete with the \"L\".","Economy":"Orbitz has its headquarters in the Citigroup Center in the Near West Side.McDonald's moved its headquarters to West Loop in 2018.PepsiCo's Chicago offices are in the Near West Side. Aeroméxico operates the Chicago Downtown Location on the first floor at 954 West Washington Boulevard.The Consulate-General of Mexico in Chicago is located at 204 South Ashland Avenue.Previously, Trizec Properties's headquarters and Chicago-area offices were in 10 S. Riverside Plaza.","Education":"","Colleges and universities":"University of Illinois at Chicago\nChicago-Kent College of Law\nRush University","Primary and secondary schools":"Chicago Public Schools (CPS) operates public schools.K-8 schools serving the Near West Side include W. Brown, Calhoun North, Dett, Herbert, Washington Irving, King, Mitchell, Otis, Plamondon, Skinner, and Smyth.Crane High School previously served as the zoned high school for the Near West Side. CPS announced in 2012 that Crane was to be converted into a magnet school for medical sciences. Whitney M. Young Magnet High School is also in the Near West Side.\nWashington Irving School is located in Tri-Taylor. In the 2000–2001 school year, of the area children who attended CPS schools (the figure does not include those who attended private schools nor charter schools), 69% attended Irving. By the 2013–2014 school year this declined to 46%, and Linda Lutton of WBEZ stated that Irving \"is largely ignored by the families who live here.\" As of that school year, 80% of Irving students originated from outside of the school's attendance zone, and according to Lutton it was \"a neighborhood school in name only.\"Moses Montefiore Academy, a CPS special school for at-risk youth, was located in the Near West Side.\nChicago Virtual Charter School, a public K-12 charter school, is also located in the Near West Side.\nSt. Ignatius College Prep is an elite Catholic high school located in the Near West Side.","Notable people":"Frank Jeremiah Armstrong (1877-1946), physician, first African-American graduate of Cornell College, and assistant to Booker T. Washington. He and his wife resided on the Near West Side at 2239 West Maypole Avenue.\nChloe Bennet (born 1992), actress and singer. She was a childhood resident of the Near West Side.\nCornelius Coffey (1902–1994), one of the first Black aviators and founder of the first Black-owned airport in the United States. He resided at 1046 West Van Buren Street in 1939.\nJoseph Ferriola (1927–1989), criminal associated with the Chicago Outfit. He was a childhood resident of the Near West Side.\nDaniel V. Gallery (1901–1977), rear admiral in the United States Navy notable for his participation in the Revolt of the Admirals. He was raised at 1256 West McCallister in what is now the Near West Side.\nMary Onahan Gallery (1866–1941), writer, editor and newspaper critic. She resided at 1256 West McCallister in what is now the Near West Side.\nPhilip D. Gallery (1907–1973), Rear admiral in the United States Navy.\nWilliam O. Gallery (1904–1981), naval aviator and Rear admiral in the United States Navy. He was raised at 1256 West McCallister in what is now the Near West Side.\nCarter Harrison Sr. (1825–1893), 29th & 33rd Mayor of Chicago. He resided at what is now approximately 201 South Ashland Avenue.\nCarter Harrison Jr. (1860–1953), 37th & 40th Mayor of Chicago and Chicago's first native born Mayor. He was raised at what is now approximately 201 South Ashland Avenue.\nJoseph J. McCarthy (1911–1996), recipient of the Medal of Honor for actions taken during the Battle of Iwo Jima. He resided at 720 West Vernon Park Place for a period of time after World War II.\nMary Onahan Gallery (1866–1941), newspaper writer. She resided at 1256 West McCallister in what is now the Near West Side.\nDavid Schwimmer (born 1966), actor, director and producer. He owned a condominium at 850 West Madison Street from the early 1990s until 2020.","References":"","Works cited":"\"The Metropolitan West Side Elevated Railroad of Chicago\". The Street Railway Review. 5: 263–274. January 15, 1895.\nMoffat, Bruce G. (1995). The \"L\": The Development of Chicago's Rapid Transit System, 1888–1932. Chicago: Central Electric Railfans' Association. ISBN 0-915348-30-6.","External links":"Official City of Chicago Near West Side Community Map\nIn The Vicinity of Maxwell Halsted Street 1890-1930\nTaylor Street Archives; UIC:...Flawed History\nLittle Italy\/University Village WBEZ"}]