[{"History":"The Near South Side is one of the most dynamic of Chicago's communities. It has undergone a metamorphosis from a Native American homeland to a blue collar settlement, to an elite socialite residential district, to a center for vice, to a slum, to a public housing and warehouse district, and finally to the home of a newly gentrified residential district.","Beginnings and continuous change":"The Near South Side was initially noted for wagon trails winding through a lightly populated bend of Lake Michigan. It was on one of these trails that the Fort Dearborn Massacre occurred in 1812. This area was first populated by settlers working for the Illinois & Michigan Canal, who subsequently worked in the lumber district. Proximity to the railroads attracted light manufacturing and shops. In 1853, the community was absorbed by the extension of the city limits to 31st Street; in the same period, the Illinois Central Railroad was built into Chicago.  In 1859, a South State Street horse-drawn streetcar line, linking the area to downtown, attracted wealthy families to the area. By the time of the Great Chicago Fire in 1871, it was home to some of the city's finest mansions and most elite social families, and in the 1890s the railroad's Central Station opened at 12th Street. However, by the start of the 20th century, rapid transit evolved and many families moved slightly farther from the Loop business district. The railroads brought warehouses and light manufacturing. Michigan Avenue between 14th Street and 22nd Street became an auto row. The \"Levee\" vice district of brothels and gambling dens around Cermak Street and State Street prospered until 1912. Burnham Park and several accompanying institutions were built in the 1910s and 1920s. World War I and post World War I Great Migration settlers moved in and created the low-rent \"Black Belt\". Urban renewal and public housing projects later replaced some of the slums. In the 1940s, some of the city's slums were on the Near South Side.","Century of Progress":"The Century of Progress International Exposition was the name of the World's Fair held on the Near South Side lakefront from 1933 to 1934 to celebrate the city's centennial.  The theme of the fair was technological innovation over the century since Chicago's founding. More than 40 million people visited the fair, which symbolized for many hope for Chicago and the nation, then in the midst of the Great Depression.","Modern day":"West of Lake Shore Drive, much of the Near South Side, in the middle of the twentieth century, consisted largely of railroad tracks and interchanges until the 1960s, when middle-class housing developments were built in the community area. In 1977, George Halas surrendered 51 acres (210,000 m2) of railyards for redevelopment as Dearborn Park apartments, townhouses and accompanying tree-lined walkways. In 1988, the second phase of Dearborn Park construction began between State St. and Clark St., south of Roosevelt Rd. A housing boom emerged in the 1990s and continues to the present day with the construction of many new condominium and apartment towers.\nConstruction of the Central Station development commenced in 1990. This was a mixed-use development on 72 acres (290,000 m2) of former rail yards and air rights east of Indiana Avenue between Roosevelt Road and 18th Street. Simultaneously, loft conversion spread to the warehouses and light manufacturing structures along the major north-south Avenues of Michigan, Indiana, and Wabash, which returned them to residential properties 100 years after the flight of the elite Chicago socialites. Among the prominent buildings are One Museum Park and One Museum Park West along a redeveloped Prairie Avenue.","Parks and museums":"Landfill use created Burnham Park and Northerly Island in the 1920s and 1930s along Lake Michigan. The Field Museum of Natural History, Soldier Field, Adler Planetarium and the John G. Shedd Aquarium were constructed on this newly reclaimed land at this time. Later, Merrill C. Meigs Field Airport was built. Northerly Island connects to the rest of the Museum Campus through a narrow isthmus along Solidarity Drive dominated by Neoclassical sculptures of Kościuszko, Havliček and Nicolaus Copernicus.The newly developed Central Station area includes three park areas. Mark Twain Park lies between South Indiana Avenue and Lake Shore Drive at 15th Place. Daniel Webster Park is bounded by 14th Street, South Indiana Avenue and townhouse developments. The Grant Park Extension lies east of One Museum Park and South of Roosevelt. The developers donated 1.5 acres (6,100 m2) for one park to the city and developed the other two as part of its approval process. The donated tract protects the northward view of Grant Park.","McCormick Place":"Fairs and exhibitions held on the lakefront sites created demand for an exhibition hall. In 1960, construction was begun on McCormick Place, a huge exposition and convention complex at 23rd Street and Lake Shore Drive named for newspaper magnate Robert R. McCormick. The original building burned in 1967, and was rebuilt and reopened in 1971 at the behest of mayor Richard J. Daley. Large expansions were added in 1986, 1997 and 2007. The current redevelopment includes greatly expanded hotel accommodation. McCormick Place also houses the Arie Crown Theater, and it is the annual location for the Chicago Auto Show.","Historic structures":"The area includes the Prairie Avenue Historic District (with both the John J. Glessner House and the Henry B. Clarke House) and the historic (former) R. R. Donnelley & Sons printing company building (which now houses network routers and switches for much of the city).  The Glessner House, which is perhaps the best known historic structure in this district, is now a museum.  William Wallace Kimball's home is now home to the United States Soccer Federation headquarters. Formerly, several important residences were located in this region. Additionally, the Fort Dearborn Massacre sculpture was on the property of the George Pullman residence as a tribute to the massacre, which occurred in the neighborhood. Many of the Prairie Avenue families worship at the historic Second Presbyterian Church on South Michigan Avenue in the heart of the district.\nAdler Planetarium, R.R. Donnelley and Sons Co. Calumet Plant, Henry B. Clarke House, Coca-Cola Company Building (on Wabash), Field Museum of Natural History, John J. Glessner House, William W. Kimball House, Maxwell-Briscoe Automobile Company Showroom, Quinn Chapel AME Church, Harriet F. Rees House, Reid House, St. Luke's Hospital Complex, Second Presbyterian Church, Shedd Aquarium, Soldier Field, and Wheeler-Kohn House are all located in the community area and are all listed on the National Register of Historic Places (NRHP). Raymond M. Hilliard Center Historic District, Motor Row District, and Prairie Avenue District are districts largely within the community area that are also listed on the NRHP.","Redevelopment":"Beginning in the mid-1990s, factories started being replaced with or converted to loft condominiums.  The redevelopment continued through the early 2000s decade.  South Loop residential development has expanded to the Dearborn Park neighborhood (between State and Clark Streets South of Roosevelt Road). The new Central Station neighborhood is the site of major mixed use development that includes One Museum Park, One Museum Park West, numerous residential condominiums and luxury townhomes. This development is built on 72 acres (290,000 m2) of former rail yards and air space rights east of Indiana Avenue between Roosevelt Road and 18th Street that include the former location of the Central Station terminal. Also, a wave of loft conversions in Printer's Row that has spread to major North-South Avenues such as Michigan, Wabash, and Indiana is making them residential streets again in this neighborhood after a century of other uses. The planned development has expanded from 69 to 80 acres (320,000 m2) and includes properties between Michigan and Indiana Avenues. In 2006, the Prairie District Neighborhood Alliance, a non-profit organization was formed to provide representation for thousands of South Loop residents, including the Prairie District, Central Station and Museum Park, Motor Row, the South Michigan Ave Corridor, as well as other areas of the Near South Side.","Streets":"Lake Shore Drive was reconstructed in 1996 so that it no longer cut through the Museum Campus. Previously, the northbound lanes ran east of Soldier Field. After reconstruction, both northbound and southbound lanes ran west of Soldier Field.Its northern boundary (Roosevelt Road) marks the end of consecutively named east–west streets. East–west streets north of Roosevelt Road have street names, except between State Street and Michigan Avenue. There are two block-long 8th and 11th Streets and a four-block 9th Street. Most streets south of Roosevelt simply use street numbers. Streets in this neighborhood from 13th to 26th are mostly numbered. Cullerton Street (20th Street) and Cermak Road (22nd Street) are two of the few named east–west cross streets. Numbering continues southward in Chicago into the upper hundreds at a pace of 8 blocks per mile.","Politics":"The Near South Side community area has supported the Democratic Party in the 2012 and 2016 presidential elections. In the 2016 presidential election, the Near South Side cast 9,761 votes for Hillary Clinton and cast 1,425 votes for Donald Trump (83.43% to 12.18%). In the 2012 presidential election, the Near South Side cast 9,252 votes for Barack Obama and cast 2,253 votes for Mitt Romney (79.33% to 19.32%).","South Loop\/Printer's Row overlap":"Because neighborhood line drawing is sometimes imprecise, there is some confusion regarding where the South Loop neighborhood (which incorporates Printer's Row) begins and ends. Some sources do not define its northern boundary, while defining its southern boundary as Cermak Street (22nd Street) and its western boundary as Canal Street. The Prairie District Neighborhood Alliance, a not-for-profit neighborhood organization, has grown to provide support and representation to thousands of residents living in and around the South Loop and Near South Side of Chicago, including the Prairie Avenue District, Central Station and Museum Park, Motor Row and the South Michigan Avenue corridor, but the organization does not exclude those that are part of the broader South Loop and Near South Side community.  The Greater South Loop Association represents residents living between Congress to the North, the Chicago River to the west and the Stevenson Expressway (approximately 25th Street) to the south. South Loop Neighbors serves residents only as far south as \"approximately\" 15th Street and as far west as the river. Fodor's has its own definition of the South Loop as the area bounded by Cermak, Michigan Avenue, the Chicago River, and Congress Parkway-Eisenhower Expressway.\nThe South Loop is described as the neighborhood immediately south of \"the Loop\", yet \"the Loop\" has multiple meanings. The Loop is a community area bounded by the Chicago River, Lake Michigan and Roosevelt Road. However, the term is also used to refer to the specific area bounded by the circular portion of the Chicago \"L\", which goes as far south as Van Buren Street or Congress Avenue (and this is described as the northern border of Printer's Row and the South Loop). Some primary sources cite Printer's Row and the South Loop as part of the Near South Side community area. This transit-related area is the northern portion of the community area. Saying it is south of the former places it in the Near South Side, while saying it is part of the latter places it in the Loop. The Official City of Chicago Loop Map supports the latter.","Notable people":"Philip Danforth Armour (1832–1901), meatpacking industrialist and founder of Armour and Company. He resided at 2115 South Prairie Avenue during the latter years of his life.\nRichard M. Daley (born 1942), 54th Mayor of Chicago. He moved from Bridgeport to the Near South Side in 1993 while Mayor of Chicago. He moved to the Gold Coast after his time as Mayor.\nWilliam Kimball (1828–1904), businessman and founder of  the Kimball Piano Company. He resided at 1801 South Prairie Avenue during the 1890s.\nMajor Robert Henry Lawrence Jr. (1935–1967), officer in the United States Air Force and first Black astronaut. He was a childhood resident of 11 West 23rd Street.\nFrank Leland (1869–1914), baseball player, field manager and club owner in the Negro leagues. He resided at 2348 South Dearborn Avenue.","Education":"Residents are zoned to schools in Chicago Public Schools. K-8 schools serving sections of the Near South Side include Drake School, National Teacher Academy, and South Loop School. Phillips Academy High School is the zoned high school of the Near South Side.","Notes":"","Further reading":"Eds. Grossman, James R., Keating, Ann Durkin, and Reiff, Janice L., 2004 The Encyclopedia of Chicago. The University of Chicago Press, ISBN 0-226-31015-9","External links":"Chicago\/Near South travel guide from Wikivoyage\nOfficial City of Chicago Near South Side Community Map\nPrairie District Neighborhood Alliance Website"}]