[{"Neighborhoods":"","Gold Coast":"The Gold Coast consists mostly of luxury high-rise apartment towers and buildings and stone mansions throughout. Its borders are generally defined as North Avenue to the north, Lake Michigan to the east, Chicago Avenue to the south, and Clark Street to the west.\nThe Gold Coast became the home of the super-rich in 1885, when Potter Palmer, former dry goods merchant and owner of the Palmer House hotel, built a fanciful castle on Lake Shore Drive. Over the next few decades, Chicago's elite gradually migrated from Prairie Avenue to their new homes north of the Loop.\nAlong almost every boulevard of the Gold Coast has upscale boutiques and shops. Many upscale auto dearlerships are located here. Many of Chicago's best known and highly rated restaurants are located here as well. Also in the area are Lou Malnati's Pizzeria, Gibsons Steakhouse, and the original Morton's The Steakhouses.\nThe \"Gold Coast Historic District\" was listed on the National Register of Historic Places on January 30, 1978.\nThe Gold Coast is zoned to the following Chicago Public Schools schools: Ogden School and the prestigious Latin School of Chicago.","Old Town":"Old Town is a Chicago neighborhood bounded by North Avenue on the north, Larrabee Street on the northwest, Division Street on the south, Clybourn Avenue on the southwest, and LaSalle Street on the east. It crosses portions of the community areas of southern Lincoln Park, as well as the northern Near North Side, and is part of Chicago's 43rd ward. \nOld Town includes the Old Town Triangle Historic District which is bounded on its northwest side by the former Ogden Avenue right-of-way, its northeast side by Lincoln Avenue and Wells Street, and on its south side by North Avenue. This historic district sits within the Old Town Triangle Association (OTTA), a Lincoln Park neighborhood bounded by the former Ogden Avenue right-of-way, Clark Street, and North Avenue. It sits inside the community area of Lincoln Park and is part of Chicago's 43rd ward. Old Town north of North Avenue is in Lincoln Park, and south of North Avenue is part of the Near North Side. It is now an affluent neighborhood.\nOld Town is now an affluent and historic neighborhood, home to many of Chicago's older Victorian-era buildings. However, in the 1950s, most of this area was an enclave to the first emigrants from Puerto Rico to Chicago, who referred to it as part of \"La Clark\" until commercialization decorated late 1960s shop signs with the name of Old Town. The neighborhood is home to St. Michael's Church, originally built to serve German immigrants, and one of only 7 to survive the great Chicago fire. St. Michael's, Holy Name Cathedral, Immaculate Conception, and St. Joseph's Catholic churches all catered to Latinos with a Mass in Spanish.\nMany of the streets and alleys, particularly in the Old Town Triangle section, predate the Great Chicago Fire and do not all adhere to the city's typical grid pattern. In 1927, sculptors Sol Kogen and Edgar Miller purchased and subsequently rehabilitated a house on Burton Place, near Wells Street, into the Carl Street Studios. Through the 1930s, an art colony emerged in the neighborhood as artists moved from the Towertown neighborhood near Washington Square Park.\nOld Town was home to many gays and lesbians from the 1950s through the 1980s. This was the first \"gay ghetto\" in Chicago, predating the current large Lake View neighborhood which also contains the Boystown district. There were numerous gay establishments in Old Town (now mostly closed as Lake View is now the main gayborhood) along Wells Street and Old Town was home to the longstanding gay-themed Bijou Theater until it closed in September 2015. As Old Town gentrified, the LGBT population of the nearby Lake View neighborhood continued to increase, as well as the LGBT populations of the Lincoln Park and Andersonville areas.\nOld Town is home to the famous Second City improvisational comedy troupe which has launched the careers of many successful comedians and actors.\nOld Town has three \"L\" rapid transit stations: North\/Clybourn, Sedgwick, and Clark\/Division.","Goose Island":"Goose Island is an island in Chicago covering 160 acres on the Chicago River that is completely surrounded by the rest of the city. It is separated from the mainland by the North Branch of the Chicago River on the west and by the North Branch Canal on the east. The canal was dug in 1853 by mayor William Butler Ogden's administration and was dug for industrial purposes, thus forming the island. After Irish immigrants settled on the island, it took the name Goose Island, as well as that of Kilgubbin, which was the immigrants' original home in Ireland. The Goose Island Brewery makes Kilgubbin Red Ale, in honor of this name.The large facility on the north end of Goose Island (visible from North Avenue, but by car only reachable from the south: Division Street to North Branch to 1132 W. Blackhawk) is the Wrigley Global Innovation Center, a 193,000-square-foot (17,900 m2) facility, which opened in September 2005 and was designed by Gyo Obata of Hellmuth, Obata and Kassabaum. While cars are able to approach from the south, trains, bicycles, and pedestrians can reach the site via the rail\/pedestrian Cherry Avenue Bridge spanning from North Avenue to Goose Island. Additionally, there is seasonal access from the north via the Chicago Water Taxi service dock at the south end of the Cherry Avenue Bridge.On the south end of the island is Kendall College's Riverworks campus. The southern end of the island is currently undergoing redevelopment with upscale condominiums, townhouses, and apartments.","RiverNorth":"River North is a neighborhood known for its fine dining, galleries, nightlife, and riverwalk amenities. It is home to the world headquarters of ConAgra, Groupon, Motorola Mobility, and the regional offices of Yelp. It is bounded by Michigan Avenue to the east, Chicago Avenue to the north, and the Chicago River to the south and west. River North has many towers and high-rises and some of its other famous structures include the Merchandise Mart, the Wrigley Building, Holy Name Cathedral, the Marina City towers, and the House of Blues.","Smokey Hollow":"","Little Sicily":"","Cabrini–Green":"","River North":"River North is a neighborhood known for its fine dining, galleries, nightlife, and riverwalk amenities. It is home to the world headquarters of ConAgra, Groupon, Motorola Mobility, and the regional offices of Yelp. It is bounded by Michigan Avenue to the east, Chicago Avenue to the north, and the Chicago River to the south and west. River North has many towers and high-rises and some of its other famous structures include the Merchandise Mart, the Wrigley Building, Holy Name Cathedral, the Marina City towers, and the House of Blues.","Streeterville":"Streeterville is the easternmost neighborhood in Chicago north of the Chicago River. It is bounded by the river on the south, Michigan Avenue on the west, and Lake Michigan on the north and east.\nStreeterville houses some of Chicago's tallest skyscrapers (such as the John Hancock Center); many upscale stores, hotels, restaurants; and Northwestern University's Northwestern Memorial Hospital, Feinberg School of Medicine, School of Professional Studies, Kellogg School of Management's downtown campus, and School of Law.\n\nThe number one tourist attraction in the Midwest, Navy Pier, is located in Streeterville. The neighborhood also houses the Museum of Contemporary Art, Chicago.","Magnificent Mile":"","Attractions":"","Economy":"Google's Chicago offices are in the Dearborn Plaza building. Etihad Airways and Qatar Airways have offices in the John Hancock Center. The Wrigley Company had its headquarters in the Wrigley Building before moving to Goose Island, also within the community area, in 2012.After American Airlines acquired Simmons Airlines, and before Simmons was dissolved, Simmons had its headquarters on the Near North Side. At one point Indigo Airlines was headquartered on the Near North Side. The Tribune Company had its headquarters in the eponymous Tribune Tower before moving to One Prudential Plaza in the Loop in 2017. Potbelly Sandwich Works likewise was located in the Merchandise Mart complex before moving to the West Loop in 2015.","Politics":"","Local":"The Near North Side is currently part of the 2nd, 27th, 42nd, and 43rd wards of the Chicago City Council, which are respectively represented by Democratic aldermen Brian Hopkins, Walter Burnett Jr., Brendan Reilly, and Michele Smith.\nIn the Cook County Board of Commissioners the majority of the area is in the 3rd district, represented by Democrat Bill Lowry. The westernmost part, including the majority of Goose Island, and much of the southwestern part, including the majority of River North, is in the 12th District, represented by Democrat John Fritchey. Two parts of the area in the extreme south—the respective vicinities of Wolf Point and the Wabash Avenue Bridge—are part of the 2nd District, represented by Democrat Dennis Deer.","State":"In the Illinois House of Representatives the community area is roughly evenly split lengthwise between, from east to west, Districts 26, 5, 9, and 10, represented respectively by Democrats Christian Mitchell, Juliana Stratton, Art Turner, and Melissa Conyears. The southwest portion of the area—the western half of River North—is within District 6 represented by Democrat Sonya Harper, and the northeastern part—the eastern half of Old Town and the northern half of the Gold Coast—is within District 12, represented by Democrat Sara Feigenholtz.\nIn the Illinois Senate the biggest portion of the community area is in District 3, represented by Democrat Mattie Hunter, while Streeterville and the southern half of the Gold Coast is in District 13, represented by Democrat Kwame Raoul, Cabrini–Green, Goose Island, and the western half of Old Town is in District 5, represented by Democrat Patricia Van Pelt, and the eastern part of Old Town and the northern half of the Gold Coast is in District 6, represented by Democrat and Illinois Senate President John Cullerton.","Federal":"In the US House of Representatives, the area is mostly within Illinois's 7th congressional district, which is the most Democratic-leaning district in the State of Illinois according to the Cook Partisan Voting Index with a score of D+38 and represented by Democrat Danny K. Davis. Small parts in the north are within Illinois's 5th congressional district, which is represented by Democrat Mike Quigley.\nThe Near North Side community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, the Near North Side cast 32,150 votes for Hillary Clinton and cast 8,778 votes for Donald Trump (74.5% to 20.4%). In the 2012 presidential election, the Near North Side cast 24,592 votes for Barack Obama and cast 12,939 votes for Mitt Romney (64.5% to 34.0%).","Diplomatic missions":"Several consulates are located on the Near North Side. The main building and visa office of the Consulate-General of the People's Republic of China are here. Other countries with missions here include Austria, Bosnia and Herzegovina, Brazil, Bulgaria, Chile, Colombia, Denmark, Egypt, Germany, Greece, India, Republic of Ireland, Italy, Japan, South Korea, Lithuania, Poland, Serbia, Switzerland, Thailand, the United Kingdom, and Ukraine.Three trade missions have offices at 500 North Michigan Avenue: the Austrian Trade Commission is located in Suite 1950, the Italian-American Chamber of Commerce Midwest is located in Suite 506, and the Trade Commission of Spain is here.","Education":"","Colleges and universities":"Northwestern University School of Law\nNorthwestern University Medical School\nLoyola University Chicago School of Law\nLoyola University Chicago Graduate School of Business, School of Social Work, Institute of Pastoral Studies, School of Continuing and Professional Studies, and School of Communication\nThe Chicago School of Professional Psychology\nUniversity of Chicago's Booth School of Business Gleacher Center\nErikson Institute\nMoody Bible Institute","Primary and secondary schools":"Chicago Public Schools serves residents of the Near North Side.\n\nZoned elementary schools include Ogden International School (Jenner School has merged into Ogden)\nSome students are zoned to Wells Community Academy High School while others are zoned to Lincoln Park High SchoolMagnet schools:\n\nWalter Payton College PrepCharter schools:\n\nNoble AcademyPrivate schools:\n\nLatin School of Chicago","Adult education":"Feltre School","Libraries":"Newberry Library\nChicago Public Library Near North Branch\nChicago Public Library Water Works Branch","Notable residents":"Conor Allen, AHL player with the Rochester Americans. He was raised in Old Town.\nHenry A. Courtney Jr. (1916–1945), officer of the United States Marine Corps Reserve and a posthumous recipient of the Medal of Honor. He resided at 30 West Chicago Avenue while studying at Loyola University's School of Law.\nMitch Glasser (born 1989), Israeli-American baseball player\nNellie Grant (1855–1922), daughter of President Ulysses S. Grant. At the time of her death, she resided at 1130 North Lake Shore Drive with her husband Frank Hatch Jones.\nDwight H. Green (1897–1958), 30th Governor of Illinois (1941–1949). He resided at 1360 North Lake Shore Drive at the time of his death.\nRobert Halperin (1908–1985), athlete and businessman who founded Lands' End. He resided on the Near North Side.\nSuzanne Le Mignot, television news anchor and reporter.\nPolo G (born 1999), rapper.\nGene Siskel (1946–1999), film critic. He resided at 1301 N. Astor St.","References":"","External links":"Official City of Chicago Near North Side Community Map\nStreeterville Chamber of Commerce\nDowntown Chicago's Comprehensive Website\nGold Coast Neighbors Association\nInteractive map of Near North Side\nChicago Park District:\nConnors Park\nWashington Square Park\nNavy Pier\nTravel Essay on River North by Max Grinnell\nLa Clark neighborhood and Young Lords origins"}]