[{"Neighborhoods":"","Back of the Yards":"Back of the Yards is an industrial and residential neighborhood so named because it was near the former Union Stock Yards, which employed thousands of European immigrants in the early 20th century. Life in this neighborhood was explored in Upton Sinclair's 1906 novel The Jungle. The area was formerly part of the town of Lake until it was annexed by Chicago in 1889. In the late 19th and early 20th centuries, the area was occupied largely by Eastern European immigrants and their descendants, who were predominantly ethnic Lithuanian, Bohemian, Moravian, and Slovak.In the 1930s, the activist Saul Alinsky did community organizing in this area, as its people suffered during the Great Depression. This work led to his founding the Industrial Areas Foundation in 1940, which trained community organizers.Jane Jacobs, in her 1961 book The Death and Life of Great American Cities, cites the Back of the Yards as an area able to \"unslum\" in the 1960s, due to a beneficial set of circumstances. This included a stabilized community base with skilled members who were willing to trade work to upgrade housing, as well as active and well-led local social and political organizations. Jacobs often cited the Back of the Yards as a model for other depressed neighborhoods to follow to upgrade their communities.Some time after the 1970s, when the stockyard operations closed and the number of nearby jobs decreased, many people left to move to newer housing and work in the suburbs. The population of the neighborhood gradually reflected a new wave of settlement, predominantly Mexican-American.","Canaryville":"The Canaryville neighborhood is one of the oldest neighborhoods in Chicago, and borders the Bridgeport neighborhood. According to the Encyclopedia of Chicago, the neighborhood extends from Pershing Road to 49th Street and centers around Halsted Street. The area's residents experienced the development, and then decline, of the meat packing industry, when Chicago was, in the words of Carl Sandburg, \"hog butcher for the world\". Many of its residents found other work in the post–World War II years.\nHistorically, Canaryville was a largely Irish American neighborhood, starting Irish immigrants escaping the Great Famine in the mid-19th century. They were deeply entrenched in the neighborhood, considering it their territory, and attempted to defend it against later arrivals of all races –including non-Irish White, Black, Hispanic, and Asian people. Its Irish gangs were active in attacks on Black people in the Chicago Race Riot of 1919. Since the late 20th century, Latin American (predominantly Mexican) immigrants and their descendants have moved into the area. Canaryville is now largely both Irish and Mexican.\nCanaryville's name may refer to the sparrows who fed in the stockyards and railroad cars in the late 1800s. The name may also refer to white youth gangs in the neighborhood from the early 1900s, who were known as \"wild canaries\".","Politics":"The New City community area supported the Democratic Party in the 2012 and 2016 presidential elections. In 2016, New City cast 8,897 votes for Hillary Clinton and 1,331 votes for Donald Trump (84.40% to 12.63%). In 2012, New City cast 9,053 votes for Barack Obama and 1,009 votes for Mitt Romney (89.36% to 9.96%).","References":"","External links":"Official City of Chicago New City Community Map\nBack of the Yards Neighborhood Council (oldest community organization in the United States, founded by Alinsky in 1939)"}]