[{"History":"","Annexation to Chicago and first waves":"Once part of Cicero Township in 1869, the eastern section of North Lawndale to Pulaski Road was annexed to Chicago by an act of the state legislature. Thereafter, streets were platted and drainage ditches were installed between Western (2400 west) and Pulaski Road (4000 west). The name \"Lawndale\" was supplied by Millard and Decker, a real estate firm which subdivided the area in 1870. In 1871, after the Great Chicago Fire, the McCormick Reaper Company (later International Harvester) constructed and occupied a new large plant in the South Lawndale neighborhood, and many plant workers moved to eastern North Lawndale. The remaining area west of Crawford Avenue was annexed in 1889 by a resolution of the Cook County Commissioners.\nBy 1890, North Lawndale was beginning to be heavily populated by Bohemian immigrants from the Austro-Hungarian Empire. Czechs moved most heavily to the area from Crawford (Pulaski) west, and from 12th St. (Roosevelt Rd.) to 16th St. Real estate firm W.A. Merigold & Co. was the chief developer of that part of the community, which resulted in the name \"Merigold\" being associated with the neighborhood. Czech institutions popped up in Merigold, beginning in 1890 with the Slovanska Lipa\/Sokol Tabor (Czech fraternal & gymnastic organization) at 13th & Karlov.\nIn 1892, the Bohemian Catholic Church, Our Lady of Lourdes, was established at the corner of 15th & Keeler. In 1909 the Czech Freethinkers School, Frantisek Palacky, was built at 1525 S. Kedvale. The Merigold neighborhood was also known as Novy Tabor (New Camp) by the Czech immigrants who settled there. The premier Czech institution, established in 1912, was the Ceska Beseda (Bohemian Club) at 3659 W. Douglas Blvd. This club was attended by Chicago's Czech elite, as well as the visiting Czech elite of the rest of the United States and Czechoslovakia.\nIt was the place for its members to celebrate and enjoy literature, drama, and music by the most renowned and talented Czech artists. The ethnic Bohemians spread throughout the rest of the North Lawndale neighborhood; they were the original owners of many of the beautiful greystone buildings that graced the picturesque streets of the neighborhood. Many of the elite members of the Bohemian community resided in the vicinity of the 1800 and 1900 blocks of South Millard Avenue.\nThese wealthy men, as well as the rest of the Czech residents of North Lawndale, were strongly committed to their neighborhood, and were involved in civic affairs. Anton Dvorak Public Elementary School at 3615 W. 16th St. was named after the revered 19th-century Czech composer Antonín Dvořák. Several members of the North Lawndale Czech community occupied positions in city as well as county government. In the post-World War I years, the Czechs began leaving the neighborhood for newer housing in the western suburbs of Cicero, Berwyn, Riverside, and Brookfield.\nBy the 1920s, many of the Czechs were gone, and Jews became the majority ethnic group of the neighborhood after having left the crowded confines of the Maxwell Street ghetto. North Lawndale later became known as being the largest Jewish settlement in the City of Chicago, with 25% of the city's Jewish population.From about 1918 to 1955, Jews, overwhelmingly of Russian and Eastern European origin, dominated the neighborhood, starting in North Lawndale and moving northward as they became more prosperous. In the 1950s, blacks migrated into the area from the South Side and from southern states. Unscrupulous real-estate dealers all but evacuated the white population by using blockbusting and scare tactics related to the change in ethnicity. In a span of about ten years, the white population of North Lawndale dropped from 87% to less than 9%, but the number of total residents increased.","Housing and racial discrimination; decline":"In 1966, the Rev. Dr. Martin Luther King Jr. visited North Lawndale and \"stayed in an apartment there to highlight the deplorable conditions, which included broken doors and rodent infestations. He used the experience to campaign against discriminatory housing practices nationwide, which helped pave the way for the Fair Housing Act.\"\nAccording to the Steans Family Foundation, in the decades following the 1960s:\nthere were a series of economic and social disasters ... Riots followed the assassination of Martin Luther King Jr., in 1968, destroying many of the stores along Roosevelt Road and accelerating a decline that led to a loss of 75% of the businesses in the community by 1970. Industries closed: International Harvester in 1969, Sears (partially in 1974 and completely by 1987), Zenith and Sunbeam in the 1970s, Western Electric in the 1980s. By 1970 African Americans who could also left North Lawndale, beginning a precipitous population decline that continues to this day.The poverty resulting from the loss of thousands of jobs due to restructuring of industries from the 1960s to the 1980s meant that money was not available for property maintenance. Houses were abandoned and thousands of structures were leveled during this time. Much land sat vacant until the building and real estate boom of the 2000s. Due to these factors, the total neighborhood population dropped from 124,937 in 1960 to 41,768 by 2000.Writer Jonathan Kozol devotes a chapter of Savage Inequalities: Children in America's Schools (1991) to North Lawndale. He notes that a local resident called it \"an industrial slum without the industry.\"  At the time, it had \"one bank, one supermarket, 48 state lottery agents ... and 99 licensed bars.\" According to the 1980 census, 58 percent of men and women 17 and older had no jobs.\nIn 1986, the Steans Family Foundation was founded to concentrate on grantmaking and programs in North Lawndale. In the 1990s, the foundation noted signs of revitalization, \"including a new shopping plaza and some new housing\" associated with Homan Square, stabilization of the declining population, and a rise in new residents, mostly Hispanic. They constituted 4.5% of the population.\nAccording to Charles Leeks, director of NHS, North Lawndale has the greatest concentration of greystones in the city. In late 2004, the City of Chicago enacted \"The Historic Chicago Greystone Initiative\" to promote the preservation of the neighborhood's greystone structures.","Contract Buyers League":"The Contract Buyers League (CBL) was a grassroots organization formed in 1968 by residents of the North Lawndale community. Assisted by Jack MacNamara, a Jesuit seminarian, and twelve white college students based at Presentation Roman Catholic Church, led by Msgr. Jack Egan, the CBL fought the discriminatory real estate practice known as \"contract selling\".\nGroups similar to the CBL formed in cities around the country to combat contract selling. The CBL was the most influential in winning justice for exploited black homebuyers. The CBL renegotiated 400 contracts for its members, saving residents an estimated $25,000,000. The FHA finally responded to pressure from the CBL by reforming its discriminatory underwriting policies in order to lend to blacks.North Lawndale was featured in a video explaining the impact of housing discrimination and predatory lending in Chicago.","Revitalization":"Though the departure of Sears and other businesses from the area had devastated the neighborhood, the repurposing of the Sears complex – known as Homan Square – would aid in rebuilding the community. Beginning in the mid 1990s, homeowners came to fill approximately 350 affordable housing units, and a new grocery store and the neighborhood's first Starbucks opened. However, the financial crisis of 2007–2008 set the area back; the grocery store and Starbucks closed, replaced with a grocery store with more limited options and creating a food desert. In the following years, community nonprofit organizations led change in the area: UCAN, a center for disadvantaged youths moved to the area in 2016, and violence prevention groups led by READI Chicago, Communities Partnering 4 Peace, and Chicago CRED reduced violence and crime in the area by tens of percentage points after beginning area operations in 2021, returning $3-$7 to the community for every $1 invested. Later in 2021, the city opened the community-led Community Safety and Coordination Center, a centralized community resource center for many types of issues.In 2022, the neighborhood's first black-owned grocery store opened, using produce and grocery giveaways that served 300-500 families per day to build trust in the neighborhood, following a strategy from the Black Panther Party. This followed a black-owned health food store that opened in the neighborhood in 2018.","Subsections":"","K-Town":"K-Town is a nickname for an area in Humboldt Park, North Lawndale, and West Garfield Park between Pulaski Road and Cicero Avenue in which the names of many north–south avenues begin with the letter K (Karlov, Keating, Kedvale, Keeler, Kenneth, Kenton, Keystone, Kilbourn, Kildare, Kilpatrick, Kirkland, Knox, Kolin, Kolmar, Komensky, and Kostner). The pattern is a historical relic of a 1913 street-naming proposal, by which streets were to be systematically named according to their distance from the Illinois-Indiana border; K, the eleventh letter, was to be assigned to streets within the eleventh mile, counting west from the state line. The eleventh mile is the easternmost area in which the plan was widely implemented, as many neighborhoods to the east were already developed and had street names in place. The portion of K-Town bounded by W. Kinzie St,  W. Cermak Rd, S. Kostner Ave, and S. Pulaski Rd was listed as a historic district on the National Register of Historic Places on September 9, 2010.\nJohn W. Fountain wrote in his 2005 memoir:\n\nK-Town is a city within a city, a fifteen-minute drive from downtown Chicago's skyscrapers ... I used to joke that the \"K\" stood for \"kill.\" I was only half-joking ... it had developed a reputation for being one of the rougher places in the city. ... K-Town is where my grandfather ... and all the other black folk that flocked to the West Side during the mid-to-late-1950s bought proud brick houses on tree-lined streets with crackless cement sidewalks. ...","Homan Square":"The site of the former Sears headquarters was redeveloped beginning in 1988 as Homan Square. In 1993, residents at a community discussion expressed fear of being developed out, with renters having few protections from rising rent. The development has included new construction of owned and rental mixed-income housing; adaptive reuse and restoration of historic properties for use as community center, school, and other facilities; a new community pool and recreation center; and associated retail. Homan Square is often used as an example of the revitalization of North Lawndale. The former Sears tower was rehabbed and reopened to the public as \"The John D. and Alexandra C. Nichols Tower\" in 2015. It now houses non-profit groups and youth association offices. Despite the renaming, the tower retains the \"Sears Roebuck\" plaque on top of the building. The 14th floor of the tower is now used as a space for parties and other community events. A windowless portion of the building indicates the tower's former connection to the Sears Merchandise Building. The complex before demolition was situated along the former Baltimore and Ohio Chicago Terminal Railroad line (now CSX).\nHoman Square was the area that housed a police compound \"likened to a CIA black site\" in 2012, where people were held without  their rights being respected.","Infrastructure and transportation":"The United States Postal Service operates the Otis Grant Collins Post Office at 2302 South Pulaski Road.The Chicago Transit Authority's Pink Line serves this neighborhood. Stations are located at Kedzie, Central Park, Pulaski, and Kostner.\nIn 2022, the city heard proposals for the Altenheim Line, an elevated park similar to the Bloomingdale (606) Trail, that would be developed on the site of former rail lines with existing rail running near the park. Some residents expressed concerns about gentrification; Alderman Michael Scott Jr. expressed that he was confident the community could avoid gentrification and keep residents there due to being able to control the market price with much land being owned by both the city and the Cook County Land Bank Authority.","Crime":"Historian Paul Street, citing a 2001 demographic study by Claritas Inc., writes that more than 70% of men aged 18–45 residing in North Lawndale had criminal records.Beginning in 2021, violence prevention groups led by READI Chicago, Communities Partnering 4 Peace, and Chicago CRED began using large-scale relationship-based intervention tactics in the neighborhood. Flatlining Violence Inspires Peace provided street outreach workers, a major component of the joint movement. The initiatives also included providing the residents – with a focus on young men – with social services such as trauma-informed cognitive behavioral therapy and economic opportunities such as job training and legal support. Three years ago, the city's budget for violence prevention had been less than $1 million per year. In 2021, the city spent approximately $50 million on violence prevention, with additional support from private funds, which allowed violence prevention groups to work collaboratively instead of competing for grants. The funds also supported the summer 2021 creation of a new, community-led Community Safety and Coordination Center, a central site for resources for gender-based violence, housing initiatives, youth programs, and physical and mental health, as well as job readiness programs partnered with labor unions. In 2022, the budget accounts for $85 million towards similar services.Evaluations from the University of Chicago Crime Lab in 2022 found that participants in the youth program Choose to Change had \"48% fewer violent crime arrests and 32% fewer school misconduct incidents than their control group peers,\" while participants in the male gun violence prevention program READI Chicago had \"63 percent fewer arrests and 19% fewer victimizations for shootings and homicides.\" The Crime Lab further stated that there is \"about 85% confidence that for every dollar invested in a program like READI Chicago, society reaps $3 to $7 in return.\"From 2021 to 2022, North Lawndale saw a 58% decrease in gun violence.","Education":"The area is in Chicago Public Schools and is served by the following high schools: Farragut Career Academy and North Lawndale College Prep High School.\nAs of 2020, North Lawndale experienced much student loss, much of it due to people leaving the city but also due to having \"the most charter schools and [the] highest percentage of students enrolled in charter schools\" out of all Chicago community areas. Less than 30% of students in the West Side attended their zoned public schools. Early the same year, charter elementary school Frazier Preparatory Academy was closed for performance reasons, and students were split between Lawndale Community Academy, Sumner Math and Science Community Academy, and Crown Community Academy of Fine Arts. Later that year, the community heard proposals to merge the three schools into one new STEAM school due to low enrollment.\nBy 2022, the neighborhood received a new proposal to create the new STEAM elementary school without consolidating the other three schools; the new school's student body would be made of 80% Lawndale residents and 20% from elsewhere in the city.","Notable people":"","Arts, literature, and entertainment":"Shelley Berman (1925–2017), comedian, actor, writer, teacher, lecturer and poet. He was a childhood resident of North Lawndale.Andre Braugher (born 1962), actor (Glory, Homicide: Life on the Street, Brooklyn Nine-Nine). He was born and raised in North Lawndale.\nSteelo Brim (born 1988), television personality, host, and actor\nRuth Duskin Feldman (1934–2015), Quiz Kids panelist and author. She was a childhood resident of 1660 South Troy Street.\nBenny Goodman, clarinetist nicknamed the \"King of Swing,\" grew up at 1125 S. Francisco Avenue\nAhuvah Gray, author, grew up in the neighborhood, she now lives in Israel.\nIrv Kupcinet (1912–2003), newspaper columnist and radio personality. He was a childhood resident of North Lawndale.\nMichael Peña, actor (Crash, Million Dollar Baby, End of Watch, Fury, Ant-Man). Born and raised in North Lawndale.\nRamsey Lewis (born 1935), jazz composer\nKim Novak (born 1933), actor,  lived at 1910 S. Springfield Ave.\nHarold Ramis (1944–2014), actor, comedian, director and writer. Ramis was a childhood resident of North Lawndale living at 13th Street and Keeler Avenue and 14th Street and Kostner Avenue before his family moved to Rogers Park as part of the white flight of the era.\nJean Terrell, singer who replaced Diana Ross as the lead singer of The Supremes in January 1970.\nTwista, rapper.\nDinah Washington, \"Queen of the Blues,\" lived at 1518 S. Trumbull Avenue.","Athletes":"Kevin Garnett, basketball player\nMickey Johnson, basketball player\nDarryl Stingley, football player for the New England Patriots.\nMarques Sullivan, football player, grew up at 1818 S. Kedzie Avenue\nErnie Terrell, (1939 – 2014) singer and former WBA heavyweight boxing champion, brother of Jean Terrell of The Supremes.\nIsiah Thomas, basketball player for the Detroit Pistons.","Business":"Julius Rosenwald, co-founder and president of Sears, Roebuck & Co.","Military":"Hyman G. Rickover, United States Navy Admiral known as the \"Father of the Nuclear Navy\"","Politics, law, activism, and nonprofits":"Jacob Arvey (1895–1977), politician and influential leader in the Cook County Democratic Party.\nErtharin Cousin, 12th Executive Director of the United Nations World Food Programme. She was raised in North Lawndale.\nDanny K. Davis (born 1941), U.S. Representative, former executive director of the Greater Lawndale Conservation Commission\nElmer Gertz (1906–2000), lawyer and civil rights activist notable as the plaintiff in Gertz v. Robert Welch, Inc.. He was a childhood resident of North Lawndale.\nAndrea Jenkins (born 1961), first black openly transgender woman elected to public office in the United States upon her election to the Minneapolis City Council in 2017. Jenkins was a childhood resident of North Lawndale.\nMartin Luther King Jr. (1929–1968), civil rights leader, lived at 1550 S. Hamlin Ave. in 1966 while campaigning against housing discrimination in Chicago.\nMeyer Levin (1905–1981), attorney. He was a childhood resident of North Lawndale.\nBenjamin F. Lewis (1909–1963), member of the Chicago City Council from Chicago's 24th ward from 1958 until he was murdered in his ward office in 1963. He was a resident of 3457 West 13th Place.\nWilliam Lorimer (1861–1934), Republican member of the United States Senate from 1909 until his expulsion in 1912. He resided in a mansion at 3659 West Douglas Boulevard.\nAbraham Lincoln Marovitz (1905–2001), Judge of the United States District Court for the Northern District of Illinois from 1963 to 1975. He was a resident of 1323 South Independence Boulevard while a member of the Illinois Senate in the 1930s and 1940s.\nGolda Meir, Prime Minister of Israel. She briefly lived at 1306 S. Lawndale Avenue in 1917 while working at the Lawndale Branch Library\nGloria Pughsley, delegate to the Sixth Illinois Constitutional Convention","Popular culture":"Since 2011, the neighborhood has been the primary filming location for the Showtime series Shameless, although the show is set in the city's Back of the Yards neighborhood.Another Showtime TV series, The Chi, which debuted in 2018 and is set on the South Side of Chicago, films in the neighborhood.","Notes":"","References":"","External links":"Official City of Chicago North Lawndale Community Map\nNorth Lawndale: Profile of an Illinois Workforce Advantage Target Area. Parisa Arash, Office of the Governor, State of Illinois\nChicago Park District\nDouglas Park\nK-Town, entry in the Chicago Historical Society's Electronic Encyclopedia of Chicago\nNorth Lawndale History Steans Family Foundation website.\nHoman Square Homan Square website."}]