[{"Neighborhood":"Originally a Swedish community and later a stronghold of Orthodox Jews, it more recently has been adopted by newer American immigrants, from Latinos to Middle Easterners, Koreans and Central Europeans (Poles). It is part of the 60625 and 60659 zip codes.\nNorth Park received its name from North Park University that built the Old Main building in 1894 along Foster Avenue west of Kedzie, on the north side of the river. Further north is the campus of Northeastern Illinois University, which opened in 1961. Other major land uses include two large cemeteries, LaBagh Woods Forest Preserve, Peterson Pulaski Industrial Park, and North Park Village, which includes housing, park facilities, and a nature center.\nThe Good Counsel Province of the Polish Felician Sisters is headquartered in this neighborhood, as is Chicago's PBS station, WTTW, in the Chicago Production Center.  Two universities – North Park University and Northeastern Illinois University – and a Yeshiva make for concentrated educational resources.\nThe closest CTA 'L' station is the Kimball Brown Line terminal.\nNorth Park is in Jefferson Township, which was annexed into Chicago in 1889.","Economy":"The Korean-American Chamber of Commerce is located at 5601 North Spaulding Avenue.The education section of the Consulate-General of the People's Republic of China in Chicago is located at 3322 West Peterson Avenue, several blocks away from the rest of the consulate at 4747 West Peterson Avenue.","Politics":"The North Park community area has overwhelmingly supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, North Park cast 4,897 votes (70.02%) for Hillary Clinton and cast 1,799 votes (25.72%) for Donald Trump. In the 2012 presidential election, North Park cast 4,563 votes (66.40%) for Barack Obama and cast 2,199 votes for Mitt Romney (32.00%).","Notable people":"Seymour Simon (1915–2006), politician who served as President of the Cook County Board of Commissioners and a Justice of the Illinois Supreme Court. He resided in the Hollywood Park neighborhood for many years.","Schools":"","Public":"","Public Elementary":"","Publich High School":"","Private":"","Elementary":"","High school":"","Higher education":"North Park University\nNorth Park Theological Seminary\nNortheastern Illinois University\nTelshe Yeshiva","Library":"Albany Park Library","See also":"Chicago Public Schools","References":"","External links":"Official City of Chicago North Park Community Map\nLakeside Community Development Corporation"}]