[{"Northcenter":"The neighborhood known as Northcenter refers to a neighborhood in the North Side of Chicago, Illinois. Boundaries of Northcenter are Addison on the south, Montrose on the north, the Chicago River on the west and Ravenswood (1800 W) on the east.\nNorthcenter has grown since the 1870s when the area was only accessible by the Chicago River and Little Fort Road (now known as Lincoln Avenue). North Center is considered a vibrant neighborhood with an eclectic mix of retailers, restaurants, live music, live theater, and service-oriented businesses. It is also home to some of the best public schools in the City of Chicago. Lane Tech High School, a top ranked well-rounded and diverse high school in the state; as well as North Park Elementary School, Coonley & Bell Elementary. North Center was voted one of Chicago's best neighborhoods by the Chicago Magazine in 2014.Northcenter's history is deeply rooted in European cultural influences, from German, Polish, Czech, Romanian, Serbian, Greek, Croatian, French making the majority and that history can be seen in the architectural charm of the homes and buildings from the late 19th and early 20th centuries. Also during this time, the Selig Polyscope Company produced some of America's earliest motion pictures and was based in Chicago. Along Byron Street near Oakley Ave and Western Ave, historic production buildings of the company are still standing and being used as residences and retail businesses. The neighborhood continues to grow and become more culturally diverse.\nThe neighborhood includes bowling alleys, three city parks - including an indoor ice arena, a nearby library, a nearby movie theater complex, and Northcenter Town Square. The Northcenter Chamber of Commerce hosts many free family and community events throughout the year. Northcenter Town Square is also home to a Farmer's Market on Saturdays from June to October.","Roscoe Village":"Roscoe Village refers to a neighborhood in the North Side of Chicago, Illinois. While not part of any official city map, Chicago residents perceive the boundaries of the neighborhood to be Addison Street to the north, Belmont Avenue to the south, Ravenswood Avenue to the east and the Chicago River to the west. The primary feature of Roscoe Village is Roscoe Street, which bisects the neighborhood's boundaries between Addison Street and Belmont Avenue. Roscoe Street is populated by businesses and residents. Local historian and longtime neighborhood resident Chuck Betzold notes that people have been living in Roscoe Village since the 18th century, when the area was inhabited by the Fox Indians. Today the area is home to over 6200 residents.\nFrom 1904 to 1967, Roscoe Village was home to the \"largest amusement park in the world\" Riverview Park, a 76-acre amusement park stretching from Belmont Avenue to Lane Tech High School, and from Western Ave. to the Chicago River. Today, the Area 3 Police Headquarters, DePaul College Prep, and Riverview Plaza Center now stands on the space.","St. Ben's":"St. Ben's is an unofficial neighborhood with boundaries at Irving Park Road on the north, Addison Street on the south, Damen Avenue on the east, and Western Ave. on the west. It is named for Saint Benedict's Parish, with its Roman Catholic school, on Leavitt Street.","Hamlin Park":"The Hamlin Park neighborhood is bounded by Belmont Avenue on the north, Ravenswood Avenue on the east, the Diversey Parkway on the south and the North Branch of the Chicago River on the west. It has its namesake park in the center of the neighborhood. This neighborhood also has the northern half of the Julia C. Lathrop Homes, a CHA housing project.","Politics":"North Center has reliably supported the Democratic Party in recent years.","Places of interest":"Cook County Circuit Court\nAmerican Theatre Company\nWGN-TV Studios\nChicago Fire Soccer Center\nClark Park Boat House\nKerry Wood Cubs Field","Schools":"Audubon Elementary School\nBell Elementary School\nCoonley Elementary School\nChamberlain College of Nursing\nDeVry Institute of Technology\nDePaul College Prep (formerly known as Gordon Tech High School)\nJahn Elementary School\nJames Adams Alternative High School\nLane Technical High School\nNorth Park Elementary School\nPilgrim Lutheran School\nSt. Benedict Elementary School\nSt. Benedict High School\nHamilton Elementary School","Former places of interest":"Riverview Park, now the site of DePaul College Prep High School (see above)","Notable people":"Robert E. Gerstung (1915–1979), soldier and recipient of the Medal of Honor for heroic actions during World War II. In 1951, he resided at 3042 North Oakley Avenue.\nSteve Wilkos (Born 1964), Television personality\nJohn J. Hoellen Jr. (1914–1999), member of the Chicago City Council from 1947 until 1975. Hollen resided at 1842 W. Larchmont Ave. for most of his life.","Notes":"","References":"\"Roscoe Village Chamber of Commerce Map\" (http:\/\/www.rvcc.biz\/map.asp). Retrieved Oct. 24, 2006\n\"Roscoe Village Chamber of Commerce Directory\" (http:\/\/www.rvcc.biz\/directory.asp). Retrieved Oct. 24, 2006\nHadley, Chuck (2002). \"A History of Roscoe Village and RVN\" (http:\/\/www.roscoevillage.org\/Default.aspx?pageId=46910). Retrieved Sept. 10, 2008.\n\"2000 U.S. Census: Table DP-1. Profile of General Demographics Characteristics: 2000. Geographic area: Roscoe village, Illinois\" (http:\/\/censtats.census.gov\/data\/IL\/1601765611.pdf) Retrieved Mar. 22, 2005.","External links":"Official City of Chicago North Center Community Map\nNorthcenter Neighborhood Association\nNorthcenter Chamber of Commerce\nRoscoe Village Neighbors\nEncyclopedia of Chicago entry on North Center\nLakeside Community Development Corporation\nPhotographs of North Center by Jordan Bettis"}]