[{"History":"The first inhabitant of European descent in the area was Mark Noble, who arrived in 1833 and constructed a house that is still standing as of 2018, the oldest in the Chicago city limits. English farmers were the main group in the 1830s, although they would later be supplanted by Germans and to a lesser extent Poles and Scandinavians. In 1853 the Illinois and Wisconsin Railroad, which would eventually become the Chicago and North Western Railway and is currently Metra's Union Pacific \/ Northwest Line, laid tracks in the area, and in 1868 the Norwood Land and Building Association was formed and purchased the land. A hotel was constructed shortly thereafter in an attempt to lure tourists from Chicago, although it was ultimately unsuccessful. The first Post Office and store were built respectively in 1870 and 1871.Upon its incorporation the Village of Norwood Park prohibited the sale of alcohol. As of April 2014 there were still eight dry precincts in the community area. The first liquor store in the area in 50 years opened in 2016, without controversy about its existence but with such restrictions on its operation as early closing hours and a price minimum of $5.99.During the 1920s such roads as Foster Avenue, Milwaukee Avenue, Devon Avenue, Northwest Highway, and Harlem Avenue were improved, further facilitating transportation between Norwood Park and its surroundings. The fieldhouse of the eponymous Norwood Park was built in 1928. Between 1930 and 1940 the area added approximately 2,000 residents despite the Great Depression. The Kennedy Expressway was constructed nearby in the 1950s although the historic buildings of Old Norwood were unaffected. The Norwood Park Chamber of Commerce was incorporated on May 20, 1977. The City of Chicago recognized the Norwood Park Historical District in 1986 and declared the Noble-Seymour-Crippen House a Chicago Landmark on May 11, 1988. The Noble-Seymour-Crippen House was placed on the National Register of Historic Places on August 11, 2000.","Neighborhoods":"","Norwood Park Historical District (Old Norwood)":"The Norwood Park Historical District, also known as Old Norwood, was recognized by the City of Chicago in 1986. It contains the Noble-Seymour-Crippen House, Wingert House, Taft High School, and the Norwood Park Public School.","Norwood Park East":"Norwood Park East is bounded by Niles, the north branch of the Chicago River, Devon Avenue, Indian Road, Austin Avenue, Bryn Mawr Avenue, Avondale Avenue and Harlem Avenue. The Roden branch of the Chicago Public Library system is located in the neighborhood. The public school that is located in the central part of the area and that the area is mostly zoned to is William J. Onahan Public School, located on  West Raven Street. Rufus M. Hitch Public School, located on North McVicker Avenue, is in the area and zoned to as well. The neighborhood is also home to St. Thecla Catholic School and Parish.","Norwood Park West":"Norwood Park West is bounded by Devon Avenue, Harlem Avenue, the Kennedy Expressway and Canfield Road. It is home to Edison Park Elementary School, despite the name implying a location in Edison Park. It is also home to Immaculate Conception Catholic School, Resurrection Medical Center and Resurrection High School.","Big Oaks":"Big Oaks is bounded by Foster Avenue to the north, Nagle Avenue to the east, Gunnison Street to the south, and Harlem Avenue to the west. Opposite of the neighborhood's southern border at Gunnison Street is the suburb of Harwood Heights and an unincorporated area housing Ridgemoor Country Club. Many of the city's police officers live in Big Oaks, and in recent years the area has seen an increase in the number of Polish immigrants.\nAt one time, the area was dominated by a large golf course called Big Oaks Golf Course. In the early 1950s, the golf course was demolished and hundreds of homes replaced it.\nThe neighborhood contains two schools: Daniel Carter Beard Magnet School, located on West Strong Avenue, and St. Monica Catholic School, located on North Mont Clare Avenue.","Oriole Park":"Oriole Park is bordered by the Kennedy Expressway to the north, Foster Ave to the south, Harlem Avenue to the east, and Cumberland Avenue to the west.\nThe area is home to Oriole Park, which is located in the center of the neighborhood south of Bryn Mawr Avenue. The park covers over 18 acres (7.3 ha) of land.  The park is a Chicago Park District facility.\nThe Oriole Park Library is located on Balmoral Avenue next to Oriole Park Elementary School. It operates under the Chicago Public Library.\nThe neighborhood contains two schools: Oriole Park Elementary School, located on Oketo and Balmoral Avenues, and St. Eugene Catholic School, located on Foster and Canfield Avenues.\nDue to its proximity on the edge of Chicago and its suburban feel, Oriole Park residents are primarily city workers, such as teachers, police officers, union workers and firefighters.","Union Ridge":"Union Ridge, one of the highest points of Cook County, is bounded by Bryn Mawr, Foster, Nagle, and Harlem Avenues.  Union Ridge contains one school, John W. Garvy School. Union Ridge Cemetery is located on Higgins and Talcott Avenues.","Demographics":"As of 2015, the  median household income of the community area was $71,282 and the median age was 44.3. 80.1% of the population was White, 0.9% was Black, 4.2% was Asian, and 2.2% was Other. Hispanics or Latinos of any race were 11.8% of the population. This is a marked change from 2000, when Whites were 92.7% of the population and Hispanics or Latinos were 6.4%.The Norwood Park neighborhood has a substantial Serbian-American community, centered on Serbian Road and the Serbian Orthodox Cathedral.  There is a K-8 Serbian-American School, Saint Sava Academy, and an annual Serbian festival \"Serb Fest\" which takes place on Serbian Road. During 1990-1999 more than 500 Serbian families from Croatia and another 700 from Bosnia became settled refugees in Norwood Park. Although many have since moved into Edison Park, Park Ridge, Harwood Heights, and Schiller Park, Norwood Park remains the hub of Serbian migrants in Chicago.","Politics":"","Local":"The community area is split between the 39th, 41st, and 45th wards of the Chicago City Council, where it is represented by Democrat Samantha Nugent, Independent Anthony Napolitano, and Democrat Jim Gardiner respectively.\nIn the Cook County Board of Commissioners the large majority of the area is in the 9th district, represented by Republican Peter N. Silvestri, while the eastern parts of Norwood Park East, Union Ridge, and Big Oaks are in the 10th district, represented by Democrat Bridget Gainer. As of 2018 Silvestri is the only Republican County Commissioner representing a part of the City of Chicago.","State":"In the Illinois House of Representatives the majority of the community area is located within District 20, represented by Republican Michael P. McAuliffe, while most of Union Ridge and Big Oaks is in District 19, represented by Democrat Robert Martwick, and a tiny fraction in the northeast is part of District 15, represented by Democrat John D'Amico.In the Illinois Senate the vast majority of the community area is located within District 10, represented by Democrat John G. Mulroe, while a tiny part in the northeast is part of District 8, represented by Democrat Ira I. Silverstein.","Federal":"In the United States House of Representatives it is split between Illinois's 5th and Illinois's 9th congressional districts, where it is respectively represented by Democrats Mike Quigley and Jan Schakowsky.\nNorwood Park has supported the Democratic nominee for President in the past two presidential elections. In the 2016 presidential election, Norwood Park cast 9,894 votes (51.81%) for Hillary Clinton and cast 8,280 votes (43.36%) for Donald Trump. In the 2012 presidential election, Norwood Park cast 8,441 votes (54.19%) for Barack Obama and cast 6,833 votes (43.86%) for Mitt Romney.","Education":"Chicago Public Schools serves Norwood Park, as the aforementioned schools are located in and serve the area. Taft High School is in Norwood Park, serving the entire community area for public education, while for secondary education Luther North and Resurrection High Schools are also in the area.","Relation to <i>Grease<\/i> Musical":null,"Notable residents":"Ral Donner (1943–1984),  early American rock and roll musician and singer.\nJohn Wayne Gacy (1942–1994), American serial killer and rapist, lived in Norwood Park from August 1971 until his arrest in December 1978.\nRobert Hanssen (1944–2023), former FBI agent who spied for Soviet and Russian intelligence services against the United States from 1979 to 2001.\nJim Jacobs (born 1942), creator of the musical Grease. He was raised in Norwood Park.\nTerry Kath (1946–1978), guitarist, founding member of the band Chicago\nEdward Stanley Michael (1918–1994), pilot in the United States Army Air Forces and awardee of the Medal of Honor. He was raised at 6616 West Schreiber Avenue.\nLouise Schaaf (1906–2020), supercentenarian notable for being, at the time of her death, the oldest person in Illinois and the oldest known person born in Germany. She resided in Norwood Park from 1959 until her death in 2020\nJoseph Sikora (born 1976), actor known for his portrayal of Tommy Egan in Power. He was a childhood resident of Norwood Park.\nJack Suwinski (born 1998), professional baseball player playing for the Pittsburgh Pirates in the MLB. Suwinski was born and lived in Norwood Park for his childhood.","References":"","External links":"Grease gets its grit back, Chicago Tribune Article\nOfficial City of Chicago Norwood Park Community Map\nChicago landmarks\nNoble-Seymour-Crippen House\nWingert House\nChicago Park District\nNorwood Park\nOriole Park"}]