[{"History":"The Oakland neighborhood originally formed out of a settlement named \"Cleaverville\". In 1851, Charles Cleaver, an industrialist, purchased 22 acres near 38th Street and Lake Michigan. Real-estate developers subdivided the area and renamed it Oakland in 1871. Between 1872 and 1905, Cleaver constructed a soap factory and company town that included a commissary, church, town hall, and homes for the local factory workers. Camp Douglas, located nearby, attracted residents to the area. The adjoining stockyards and commercial district included popular saloons and attracted new citizens. Over a five-year span, Oakland became home to many of the city's elite. City transportation was greatly improved in the area when the Illinois Central Railroad terminal was constructed at 39th Street and Cottage Grove Avenue in 1881. After the opening of the terminal, 39th and Cottage Grove Avenue became known as the “Five Crossings.” By the end of the century, the elite residents moved out and were replaced by working-class Irish residents. The Abraham Lincoln Center was founded by Jenkin Lloyd Jones. The center served as a meeting place for people of various races, religions, and nationalities in 1905. Located at 700 E. Oakwood Boulevard, the historic landmark designed by Frank Lloyd Wright now serves as the home of Northeastern Illinois University's Center for Inner City Studies.","Population":"During the first wave of The Great Migration between 1916 and 1920, Many African-Americans settled in Oakland.By the 1930s, The area experienced the greatest diversity, with a mixture of African-Americans, Germans, Jews, English, Irish, Canadians, and Japanese. Due to this, racial tensions escalated as the African American population increased due to southern families moving to Chicago. As tensions flared, White residents resorted to violence and restrictive covenants to prevent African-Americans from moving into the area. These efforts were ultimately unsuccessful. By 1950, The African-American population was around 77% in Oakland while other ethnic groups moved from the neighborhood.Oakland's population decreased by two-thirds over a 15–year period, from 1962 to 1977 which resulted in the neighborhood becoming nearly 100% African–American.","Housing":"Due to the increase of Irish immigrants in the area, numerous  single-family houses and apartments were constructed to accommodate them. Part of the Oakland area was annexed to Chicago in 1863; the rest in 1889. Between 1939 and 1941, the then–newly formed Chicago Housing Authority constructed the Ida B. Wells Homes housing project. Bordered by 37th-39th Streets and Cottage Grove Avenue and Martin Luther King Drive (then South Park Avenue), It was the site of Aldine Square town homes, which by 1935 were old and dilapidated. The housing project increased the African–American population in the area and Oakland became a part of the Bronzeville neighborhood. Due to the rapid population growth in the area, The housing authority constructed more public housing. The sites were the Clarence Darrow Homes in 1961, located at the north end of Oakland and Lake Michigan High-Rises, which consisted of six-buildings bordered between 39th and 43rd Streets and Oakenwald and Lake Park Avenues during 1962 and 1963. The last public housing high-rises to be built in the area were the Madden Park Homes in 1970.","Economic decline":"Oakland experienced a drastic declining economic base between 1961 and 1965 due to the poverty that fell upon the area. The housing projects in the area became crime-infested and controlled by street gangs. Street gangs such as the Disciples, Vice Lords and Black P. Stones were rampant and controlled the area by 1968. The notorious Black P. Stone Nation (later renamed El Rukn) had the largest presence in the area. The Oakland Theatre, which operated from 1907 until 1973, located at 3947 South Drexel Avenue, in the heart of Oakland became the Black P. Stone street gangs' headquarters in 1976. The headquarters, which was named \"The Fort\" and \"Grand El Rukn Temple\" was a constant target for police raids, until eventually being taken after a raid by the FBI in 1990. The building was demolished a few years later. By 1979, the city of Chicago had demolished dilapidated buildings, in return leaving vacant lots scattered throughout the area. The Oakland neighborhoods' average income fell below the poverty level as middle-class residents moved from the area, it was one of the poorest neighborhoods in Chicago by 1990.","Gentrification":"During the 1990s, under the leadership of Robert Lucas, the Kenwood-Oakland Community Organization (KOCO) rehabilitated several buildings in the community and successfully pressured the city to invest in Oakland. Beginning in 1994, the North Kenwood–Oakland Conservation Community Council, led by Shirley Newsome, cosponsored the Kenwood-Oakland Parade of Homes, which helped the further development of single-family houses, townhouses, and rehabbed buildings. The housing projects in the area were demolished over an eleven-year span, beginning with the Darrow Homes in 1996. The four of the original six Lake Michigan High-Rises were vacated in late 1985 and sat vacant for 13 years until being imploded by the housing authority in December 1998. The other two buildings were renovated and renamed Lake Parc Place in 1991. Sullivan Station, named after a railway station that existed in the area is a complex that is made up of mid-rise and high-rise buildings in the area; constructed on the former high-rise site.On March 25, 1992, the Chicago City Council declared a portion of Oakland to be a Chicago Landmark.","Politics":"The Oakland community area has supported the Democratic Party in the past two presidential elections by overwhelming margins. In the 2016 presidential election, Oakland cast 2,270 votes for Hillary Clinton and cast 40 votes for Donald Trump (96.68% to 1.70%). In the 2012 presidential election, Oakland cast 2,111 votes for Barack Obama and cast 25 votes for Mitt Romney (98.64% to 1.17%).In the United States House of Representatives the Oakland community area is located in Illinois's 1st congressional district and Illinois's 7th congressional district represented by Congressman Bobby Rush and Congressman Danny K. Davis respectively. In the Illinois General Assembly, the Oakland community area is represented by Senator Robert Peters (D-13th) in the Illinois Senate and Representative Kam Buckner (D-26th) in the Illinois House of Representatives.","Notable residents":"Hannah Greenebaum, 19th-century women's rights and Jewish activist, lived in Oakland.","References":"","External links":"City of Chicago Neighborhood Guide to Oakland and Kenwood\nOfficial City of Chicago Community Map"}]