[{"History":"In 1850, along with construction of the Northwest Plank Road (present Milwaukee Avenue), Jefferson Township was incorporated at the legendary Dickinson Tavern. Jefferson Township was part of a large swath of land annexed to the city in 1889 in advance of the World's Columbian Exposition. Much of the area was still largely rural in the early 20th century until the extension of streetcar lines into the area along Milwaukee, Irving, and Cicero lured in immigrants from the overcrowded tenements of the city's ethnic enclaves. Soon Scandinavian, German, Italian, Polish and Irish families from the industrial areas by the Chicago River such as Polish Downtown and Goose Island were buying lots in the vicinity to build their homes. Area developers such as Szajkowski, Schorsch as well as Koester and Zander subdivided what had been farmland into subdivisions of what became part of Chicago's famous \"bungalow belt\".","Demographics":"","Transportation":"The Portage Park neighborhood is accessible via mass transit through the Blue Line. The Montrose station is located on Portage Park's northeastern edge in the Kennedy Expressway median and the Irving Park station is located on Portage Park's southeaster edge in the Kennedy Expressway median as well. The Milwaukee District \/ North Line has a station stop at Mayfair, just west of the Kennedy Expressway.","Neighborhood":"The neighborhood of Portage Park is a primarily residential area. The area's building stock is composed primarily of bungalows and two-flats. There are two large business districts in Portage Park; one, Six Corners, at the intersection of Irving, Cicero, and Milwaukee, and another at Belmont and Central extending south into Belmont-Cragin.\n\nThe area was home to a number of movie palaces, among which were the Portage, Patio, and Belpark theaters. While the Belpark is now closed, the Portage Theater has been renovated with public TIF funds and is now home to a performing arts center showing arthouse and silent films. The Patio was privately restored and now hosts musical and theater acts.\nPortage Park is also home to a cluster of architecturally significant churches, and is one of the few neighborhoods on the city's North Side highlighted in Marilyn Chiat's The Spiritual Traveler: Chicago and Illinois. The spires and steeples of these monumental edifices such as St. Ladislaus, St. John of Rila the Wonderworker, St. Bartholomew, St. Ferdinand, and Our Lady of Victory tower over the neighborhood, giving the area much of its charm.","Portage Park (Chicago Park District)":"Portage Park served as the focus that brought together the different communities in the area and created the neighborhood.\nThe field house at Portage Park was designed by Clarence Hatzfeld, whose firm Hatzfeld and Knox would later design many of the Prairie and Craftsman-style bungalows just east in the Villa District in Irving Park near historic St. Wenceslaus.\nThe park originally had a dirt bottom pond that blended into a concrete bottom pool. The hill to the east of the pool that exists now, was the dirt that was removed when the pool was first created when the park was first established. The pond portion of the pool extended to the western edge of this 'hill'. The earliest building in the park is the gymnasium, followed by the field house. The staircase to the field house was a circular affair, supported by several cement posts under the platform that was created by a large landing at the second floor.\nThe WPA was very involved in the creation of the long gone Rock House at the south end of the Park. This Rock House had a small pond area that had goldfish and flower basins. Until the polio epidemic, the water was kept at a substantial depth to support the fish over winter. The flower planters to the north and east of the main entrance off Central at Irving Park Road will give an idea of just what the Rock House looked like. There were seats throughout the half circle structure of flagstone. Except for the overhead wooden canopy, every where you looked there was white flagstone - walls, seats, floor, support pillars. The Chicago Park District has WPA photos of the structure. The park predates all of the buildings that surround it.\nThe swimming events of the Pan-American Games were held here in 1959 in the second pool constructed in the park, as were the US swimming trials for the 1972 Summer Olympics.","Other parks":"The neighborhood of Portage Park has a number of other greenspaces aside from the neighborhood's namesake park:\n\nChopin Park\nDickinson Park\nDunham Park\nGrace Zwiefka-Thuis Playlot Park\nLucy Gonzales-Parsons Playlot Park\nWilson Park","Education":"Portage Park residents are served by Chicago Public Schools, which includes neighborhood and citywide options for students. There are also a number of private parochial schools run by Roman Catholic and Lutheran congregations in the area.","Public Elementary Schools":"Peter A. Reinberg Elementary\nChicago Academy Elementary\nWilliam P. Gray Elementary\nPortage Park Elementary School\nPrussing Elementary School\nSmyser Elementary School","Public High Schools":"Edwin G. Foreman High School\nCarl Schurz High School\nRickover Naval Academy School","Private Elementary Schools":"St. John's Lutheran School\nMidwestern Christian Academy\nOur Lady of Victory School (Closed 2016)\nPope Francis Global Academy\nSt. Bartholomew School (Closed 2023)\nSt. Ladislaus (Closed 2015)\nSt. Robert Bellarmine","Private High Schools":"St. Patrick High School\nLuther North College Prep (Closed after the 2016–17 school year)","Politics":"Portage Park has supported the Democratic Party in the past two presidential elections by large margins. In the 2016 presidential election, Portage Park cast 15,884 votes for Hillary Clinton and cast 5,344 votes for Donald Trump (71.11%\tto 23.93%). In the 2012 presidential election, Portage Park cast\n14,028 votes for Barack Obama and cast 4,989 votes for Mitt Romney (72.34% to 25.73%).","Public libraries":"Chicago Public Library operates three branches located in the Portage Park community area: Portage-Cragin, Austin-Irving and Jefferson Park.","Culture":"The Patio Theater, built in 1927, is a single-screen atmospheric style movie palace screening repertory and independent films.\nThere are preliminary plans to erect a statue of pianist Frédéric Chopin in Chopin Park for the 200th anniversary of Chopin's birth in addition to a 1:1-scale replica of Wacław Szymanowski's Art Nouveau found in Warsaw's Royal Baths along Chicago's lakefront.\nPortage Park is the childhood home of Francis Cardinal George, O.M.I., the late Cardinal Archbishop Emeritus of Chicago (1937-2015; served 1997–2014; cardinal, 1998; president of the U.S. bishops, 2007–2010; formerly, Bishop of Yakima, WA, and Archbishop of Portland, OR). He grew up in a working class area of the neighborhood in a small red-brick house. There is a street, near Byron Street, named for him.","References":"","External links":"Official City of Chicago Portage Park Community Map\nPDF file on Portage Park Bungalows from the Historic Chicago Bungalow Association\nChicago Landmarks\nPeoples Gas Irving Park Neighborhood Store\nChicago Park District\nChopin Park\nDunham Park\nPortage Park\nWilson Park"}]