[{"History":"","Beginnings":"Historic Pullman was built in the 1880s by George Pullman as workers' housing for employees of his eponymous railroad car company, the Pullman Palace Car Company. He established behavioral standards that workers had to meet to live in the area and charged them rent. Pullman's architect, Solon Spencer Beman, was said to be extremely proud that he had met all the workers' needs within the neighborhood he designed. The distinctive rowhouses were comfortable by standards of the day, and contained such amenities as indoor plumbing, gas, and sewers.","Pullman Strike":"During the depression that followed the Panic of 1893, demand for Pullman cars slackened. The Pullman company laid off hundreds of workers and switched many more to pay-per-piece work. This work, while paying more per hour, reduced total worker income. Despite these cutbacks, the Company did not reduce rents for workers who lived in the town of Pullman.\nWorkers initiated the Pullman Strike in 1894, and it lasted for 2 months, eventually leading to intervention by the US government and military. The Strike Commission, set up in 1894, ruled that the aesthetic features admired by visitors had little monetary value for employees.","Incorporation into Chicago":"After George Pullman died in 1897, the Illinois Supreme Court required the company to sell the town because operating it was outside the company's charter. In 1899, the town and other major portions of the South Side were annexed by the city of Chicago. Within ten years, the city sold the houses to their occupants. After the strike, Pullman gradually was absorbed as a regular Chicago neighborhood, defined by distinguishing Victorian architecture. But the fortunes of the neighborhood continued to rise and fall with the Pullman Company for many years.","Deindustrialization":"With industrial and railroad restructuring beginning in the 1950s, many jobs were lost in the city. The neighborhood gradually declined along with work opportunities and income. People began to move to newer housing in the suburbs. In 1960 the original Town of Pullman, approximately between 103rd and 115th Streets, was threatened with total demolition for an industrial park. Forming the Pullman Civic Organization, the residents lobbied the city and saved their community. It reached its peak of population in 1970.","Revival":"By 1972 the Pullman Historic District had obtained National, State, and City landmark status to protect the original 900 rowhouses and public buildings built by George Pullman. (It was designated a National Historic Landmark District in 1969 and listed on the National Register of Historic Places. In 1970 it was designated as a State landmark by the Illinois Historic Preservation Agency; and in 1972, South Pullman was declared a City of Chicago Landmark). To protect the character of the historic districts, the city has established guidelines for new building and renovation, administered by the City of Chicago. These are explained in the Beman Committee's Homeowner's Guide (the committee is named after Pullman's original architect, Solon Spencer Beman )The district was designated the Pullman National Monument under President Obama in February 2015 and redesignated a national historical park in December 2022.","Demographics":"The Pullman community area is a predominantly African American, older community area, though this is not consistent among each of its neighborhoods. According to a June 2017 analysis by the Chicago Metropolitan Agency for Planning, there were 6,501 people and 2,894 households in Pullman. The racial makeup of the area was 7.1% White, 82.8% African American, 0.5% Asian, 1.1% from other races. Residents who identified as Hispanic or Latino of any race were 8.5% of the population. In the area, the population's age distribution was spread out, with 23.6% under the age of 19, 20.8% from 20 to 34, 19.6% from 35 to 49, 20.2% from 50 to 64, and 15.8% who were 65 years of age or older. The median age was 40 years compared to a citywide figure of 33 years.The Pullman neighborhood is 29% White, 31% African American, and residents of any race who identify as Hispanic or Latino comprise 36% of the neighborhood's 1,422 residents. By contrast, 96% of North Pullman's 1,995 residents are African American and 98% of Cottage Grove Heights' 3,084 residents are African American.","Media and entertainment":"Pullman has been featured in several major motion pictures.  Road to Perdition (starring Tom Hanks and Paul Newman) was filmed in historic Pullman, with scenes featuring the factory and how it \"once was\" with workers, as well as many other scenes of the neighborhood. The 1993 film The Fugitive had several key scenes in Pullman. Harrison Ford was featured in a local bar, next running down an alley, and over the tops of several Pullman rowhouses.  In April 2007, Universal Studios filmed The Express: The Ernie Davis Story, which also featured several scenes in Pullman.\nThe Polar Express animated scenes at the North Pole were based on Pullman architecture. Santa Claus emerges from a building based on the Pullman Company Administration Building; other buildings are based on the architectural style in Pullman. Robert Zemeckis, who designed the movie, grew up in the Roseland neighborhood near Pullman.\nOn November 12, 2006, Historic Pullman was the topic of the HGTV television show National Open House, which featured a Pullman house at 112th Street and Langley.","Politics":"Pullman is a stronghold for the Democratic Party. In the Presidential Election of 2020.\nJoe Biden carried the Pullman District by a whopping margin (445--21) over Donald Trump, with five votes going to third\nparty candidates.  The percentage difference (94.47%--4.46%) mirrored that of the 9th ward, which gave Biden 94.46% of \nall ballots cast.  Only five Wards--Ward 21 (95.83%), Wards 8 and 9 (95.7, apiece), Ward 6 (95.47%), and Ward 7 (94.78%) \nexceeded this plurality; Ward 5 (94.22%) was 7th highest.   Biden carried all 50 Wards in Chicago, by an overall margin\nof 763,000+ votes (944,735--181,234), a plurality of 66.7% (82.53%--15.83%).  He carried Cook County by over 3-to 1, as \nwell (74.35%--24.05%).  Indeed, the last Republican candidate to carry the Windy City was Dwight Eisenhower, in 1952-56.\nIn the 2016 presidential election, Pullman cast 3,123 votes for Hillary Clinton and cast 100 votes Donald Trump. Despite winning 94.92% of the vote, it was Clinton's 25th largest share of the vote by percentage in the 76 community areas she won in heavily Democratic Chicago. In the 2012 presidential election, Pullman cast 3,521 votes for Barack Obama and 77 votes for Mitt Romney. Despite winning 97.43% of the vote, it was Obama's 25th largest share of the vote by percentage in the 76 community areas he won in heavily Democratic Chicago.At the local level, Pullman is located in Chicago's 8th and 9th wards represented by Democratic Alderwoman Michelle Harris and Democratic Alderman Anthony Beale respectively.","Transportation":"Pullman is served by two Metra Electric Line stations; Kensington\/115th Street station and Pullman\/111th Street station. Most Metra suburban express trains passing through the area stop at the 115th Street station, and only local train stop at the 111th Street station.","Notable people":"Robert Fioretti, member of the Chicago City Council (2007-2015). Fioretti, who represented a ward on the West Side, was born in Pullman.\nMark Konkol, journalist and winner of the 2011 Pulitzer Prize for Local Reporting. As of 2007, he resided in the Pullman community.\nDarrell Walker, professional basketball player. He attended school in Pullman.","Education":"Pullman is located in City of Chicago School District #299 and City Colleges of Chicago District #508. Pullman is zoned to the following elementary schools; Schmid Elementary School, Wendell Smith Elementary School, Edgar Allan Poe Classical School, and George M. Pullman School. The majority of Pullman is zoned to the Pullman located Corliss High School, while some the northeastern area is zoned to Harlan Community Academy High School in nearby Chatham The main campus of Olive-Harvey College, part of the City Colleges of Chicago system is located in Pullman.","See also":"Granite City, Illinois (another company town)\nMarktown (another company town)\nWest Pullman, Chicago (adjacent neighborhood where workers fled the Pullman town's grip)\nList of African-American neighborhoods\nHistory of African Americans in Chicago","Notes":"","References":"","Further reading":"Buder, Stanley. Pullman: An Experiment in Industrial Order and Community Planning, 1880 - 1930. New York: Oxford University Press, 1967.","External links":"I nventory of the Frank H. Beberdick Pullman Collection at the Newberry Library\nOfficial City of Chicago Pullman Community Map\nPullman State Historic Site"}]