[{"History":"The first non-native settler in the area was David Perriam who, in 1837, claimed land north of the horseshoe bend in the Calumet River in an area referred to as Wildwood.  This land was later acquired by Colonel James H. Bowen who was instrumental in construction of the Cal-Sag canal connecting the Calumet River to the Illinois River.  After he lost his home in the Chicago Fire, Bowen moved to Wildwood and made this a palatial summer home where Chicago's elite gathered in the 1870s.  Another early resident, George Dolton, settled near the Calumet River by the Chicago-Thornton Road (today's Indiana Avenue).  He operated a chain ferry across the river.  Levi Osterhoudt operated a tavern\/road house at 133rd and Thornton Road from 1840 and the area became known as the Riverdale Crossing.  In 1842, Dolton and Osterhoudt replaced the ferry with a toll bridge and called it the \"Dolton Bridge.In 1849, the Dolton family leased 50 acres of farmland on the north bank of the Calumet River to John Ton, a Dutch immigrant who was one of the founding fathers of the new settlement of Roseland to the north.  Ton was an abolitionist who operated a station on the Underground Railroad from this site until the Civil War.\nThe north end of Riverdale is more closely aligned with Roseland both historically and culturally.  In 1852, the Illinois Central Railroad opened a station at 115th Street where the Michigan Central Railroad joined the ICRR tracks calling it the Calumet Station, later renamed, \"Kensington\" after the palace and gardens in London.\nIn 1880, George Pullman began constructing his model city just north of 115th Street.  At Kensington, a small settlement of stores, boarding houses and saloons sprang up to serve the construction crews and immigrant tradesmen who came to work at the Pullman shops.  The notorious saloons prompted the modest Dutchmen of nearby Roseland to nickname Kensington, \"Bumtown.\"  Riverdale was annexed into Chicago in 1889.\nIn the aftermath of the Pullman Strike in 1894, hiring practices in the area opened up bringing many new industries to the area. Italian Americans flourished working not only at Pullman but Illinois Terra Cotta and other nearby industries.  The Pullman Land Association operated the Pullman Farm on the west bank of Lake Calumet.  The farm was fertilized by sewage waste from the town of Pullman.  The Calumet Paint Company started operations in an abandoned church between Pullman and the lake.  It was later acquired by the Sherwin-Williams Company and grew to one of the largest paint factories in America.  Other employers in the area included the Swift and Knickerbocker ice plants, Chicago Drop Forge, Acme Steel, Riverdale Distillery and construction material companies providing bricks and lumber to the area.\nBy the 1940s, more people worked in Riverdale than lived there but that was about to change.  In 1945, the Chicago Housing Authority began the massive effort to build low cost housing for veterans returning from the War.  Altgeld Gardens, the Philip Murray Homes and the Pacesetter section west of the Calumet River provided low rent and Section 8 housing.  Riverdale's population grew to over 15,000 by 1970.  Services were overtaxed or completely lacking, with city water and sewer service finally connected in 1980.  Carver High School at 131st and Doty Road transitioned into a military school, and efforts to shift the school population to nearby Roseland have led to sporadic gang violence.In 1953, Illinois established the Chicago Regional Port District to coordinate with the opening of the Saint Lawrence Seaway to deep water ships.  The Port of Chicago was moved from Navy Pier to Lake Calumet. The lake was converted to a deep water turning basin linked to huge grain elevators, petroleum storage tanks, and public and rail terminals.  The port opened to great fanfare in 1958 but never fully realized its expected potential.\nIn the 1960s and 1970s, the area's industries began to close and the population became predominantly African American.  The Pullman-Standard plant, once the employment center of the area, produced its last railcar in 1981.  Acme Steel, which employed almost 1,200 workers in 1929, has been shuttered several times.  The Sherwin Williams paint factory closed in 1980 and was torn down.  In Kensington, Saint Salomea Church, a vestige of European immigrants, now houses the Salem Baptist Church.  In 1998, several precincts in Kensington voted to ban the sale of alcohol making the once famous \"Bumtown\" dry.\nCurrently, the area has the highest \"hardship index\" of any Chicago community area.","Neighborhoods":"South of Kensington and north of 130th Street is the massive Calumet Water Reclamation Plant operated by the Metropolitan Water Reclamation District of Greater Chicago.  It treats wastewater from areas of Chicago and the south suburbs totalling approximately 300 square miles and is the oldest of seven such facilities in the region.  Over half of Riverdale's area is made up of the water reclamation plant, rail yards, land fills and industrial sites.  In addition to these industrial usages, the community area houses a number of residential neighborhoods.","Altgeld Gardens":"Named for the Altgeld Garden Homes, a CHA public housing project. A 1978 survey of Chicago residents performed by the Department of Planning gives the neighborhood boundaries for the Altgeld Gardens neighborhood as 130th Street in the north to the Calumet River in the south, and from approximately Langley Ave. in the west to the railroad tracks west of Doty Ave. in the east.","Eden Green":"Named for the housing development of the same name, the Eden Green neighborhood extends from 130th Street in the north to the Calumet River in the south, and from the Canadian National railroad tracks in the west to the Union Pacific tracks in east. The housing development, constructed in 1968, was one of the first black-owned and -operated developments.  It eventually included over 1000 townhouse and apartment units for low- to moderate-income families.","Golden Gate":"Named for Golden Gate Park, a park on S. Eberhart Ave. operated by the Chicago Park District, the Golden Gate neighborhood extends from 130th Street in the north to the Calumet River in the south, and from the Union Pacific railroad tracks in the west to approximately Langley Ave. in the east.","Riverdale":"The Riverdale neighborhood extends from the Calumet River in the north to 138th Street in the south, and from Indiana Ave. in the west to the Union Pacific railroad tracks in the east.","Demographics":"According to a 2018 analysis by the Chicago Metropolitan Agency for Planning, there were 7,262 people and 2,560 households in Riverdale. The racial makeup of the area was 1.8% White, 95.3% African American, 0.3% Asian, 0% from other races. Hispanic or Latino of any race were 2.6% of the population. In 1990, an approximated 63% of households in Riverdale lived in poverty.","Education":"Aldridge Elementary School\nCarver Military Academy High School\nCICS Lloyd Bond\nDubois Elementary School\nGeorge Washington Carver Elementary School","Politics":"The Riverdale community area is a stronghold for the Democratic Party. In the 2016 presidential election, Riverdale cast 2,140 votes for Hillary Clinton and cast 9 votes Donald Trump (98.85% to 0.42%). It was Clinton's best showing in the City of Chicago, which she won with 83.63% of the citywide vote. In the 2012 presidential election, Riverdale cast 2,537 votes for Barack Obama and cast 7 votes for Mitt Romney (99.69% to 0.28%). It was Obama's best showing in the City of Chicago, which he won with 84.01% of the citywide vote.The Riverdale community area is located in Illinois's 2nd congressional district and is represented by Congresswoman Robin Kelly (D-Matteson).\nAt the state-level, the majority of the Riverdale community area is located in the 15th Legislative District and 29th House District represented by Senator Emil Jones III (D-Chicago) and Representative Thaddeus Jones (D-Calumet City). The far eastern portion of Riverdale is in the 17th Legislative District and 34th House District represented by Senator Elgie Sims (D-Chicago) and Representative Nicholas Smith (D-Chicago).At the local level, Riverdale is located in the 9th Ward and is represented on the Chicago City Council by Alderman Anthony Beale who is also the 9th Ward's Democratic Committeeperson. As of September 2019, the 9th Ward does not have an elected or appointed Republican Committeeperson.","Transportation":"The Chicago Transit Authority provides bus service via the #34 South Michigan bus travels along 131st Street, Ellis Avenue, 133rd Street, and Langley Avenue. PACE Suburban Bus #353 has a stop near the neighborhood at Indiana  Avenue  and  130th  Street. However, as PACE is a suburban service, it runs express through the City of Chicago to the CTA Red Line Station at 95th Street. Residents report using these busses to access this station as a link to the Chicago Loop. The nearest Metra station is the Riverdale station located in the neighboring suburb of Riverdale, Illinois at 137th Street and Illinois Street. The area was served by the Wildwood station, located near 130th Street and Indiana Avenue, until the early 1960s. As part of the Red Line extension, the proposed 130th Street terminal would be near the Altgeld Gardens Homes.","Parks and Open Space":"Notable parks and open space within the Riverdale community area include Golden Gate Park (CPD), Kensington Marsh (MWRD), Little Calumet Marsh (private), and Beaubien Woods (FPDCC).","Notable residents":"Jason Avant (born 1983), professional American football wide receiver. He was a childhood resident of the Altgeld Garden Homes.\nLloyd Bond, researcher in the field of psychometrics. He was a childhood resident of the Altgeld Gardens Homes.\nTerry Cummings (born 1961), professional basketball player. He was a childhood resident of the Altgeld Garden Homes.\nTim Hardaway (born 1955), professional basketball player. He was a childhood resident of the Altgeld Garden Homes.\nScoop Jackson (born 1963), sports journalist, author and cultural critic. He was a childhood resident of the Altgeld Garden Homes.\nHazel M. Johnson (1935–2011), founder of People for Community Recovery and mother of modern-day environmental justice movement.\nPriest Lauderdale (born 1973), professional basketball player. He was a childhood resident of the Altgeld Garden Homes.\nCazzie Russell (born 1944), professional basketball player. He was a childhood resident of the Altgeld Garden Homes.","Notes":"","External links":"www.altgeldgardens.com\nOfficial City of Chicago Riverdale Community Map\nRiverdale Library Community History Page\nEncyclopaedia Chicago: Riverdale"}]