[{"History":"","19th century":"The Rogers Park area was colonized at the convergence of two Native American trails predating modern metropolitan Chicago, that evolved into Rogers Avenue and Ridge Boulevard. The Pottawatomi and other regional tribes settled in Rogers Park from season to season. The name of Indian Boundary Park west of Rogers Park reflects this history as does Pottawattomie Park near Clark Street and Rogers Avenue.\nIn 1809, the Karthauser Inn was established as stagecoach stop and tavern. Phillip Rogers of Ireland purchased 1,600 acres (650 ha) of land in the area from the 1830s to 1856. He operated a toll gate beside his home at what became Ridge and Lunt Avenues and often traded and worked with the local tribes.\nDuring the period 1844 to 1850 arriving colonizers started farms along a ridge in the western portion of Rogers Park, avoiding the often flooded lowlands to the east.  In 1870 Rogers' son-in-law, Patrick I. Touhy, sold 100 acres (40 ha) to land speculators, including John Farwell, Luther Greenleaf, Stephen Lunt, Charles Morse, and George Estes; all of whom contributed names to streets in the area.  With an additional purchase of 125 acres in 1873 these speculators together with Touhy formed the Rogers Park Building and Land Company.  Also in 1873, the Chicago & Northwestern Railway completed a line through the area and constructed a station at Greenleaf Ave.  The population was 200 and a post office was opened in July 1873.On April 29, 1878, voters incorporated Rogers Park as a village of Illinois governed by six trustees. In 1885, the Chicago, Evanston & Lake Superior Railroad, a predecessor of the Chicago, Milwaukee & St. Paul Railroad, built a combination freight and commuter line through eastern Rogers Park on the present \"L\" right-of-way with a stop at Morse Avenue. By 1893, the population was 3500, the North Shore Electric Railroad expanded its service into the area, and the village of Rogers Park was annexed to Chicago.The Rogers Park Women's Club opened the first library in 1894. In that year, the Great Fire of Rogers Park destroyed the business district.","20th century":"By 1904 the population had grown to 7,500.  The Northwestern elevated line was extended from Wilson (4600N) to Howard Street (7600N). St. Ignatius College moved to the lakefront in 1912 and changed its name to Loyola University in 1915. Successive generations brought about vast cultural changes to the former village. By 1930 the population was 57,094 making Rogers Park one of Chicago's most densely populated areas. Chicagoans began to move to new planned communities in the north suburbs by the 1930s, which ushered in the migration of German, English, Irish, and Jewish families to Rogers Park. With the devastation in Europe following World War II, many additional immigrants found their way to Chicago and the Rogers Park neighborhood. A growing and vibrant Hispanic community has grown along Clark Street since 2000.\nFor decades, most of the neighborhood has been within the 49th Ward of the City of Chicago. The ward covered much of Edgewater and went as far south as Hollywood in the 1960s, while the 50th ward extended east to Ashland Avenue (in some areas as late as 1990). But, through redistricting, a part of Rogers Park came within the 40th ward, and the 49th Ward encompasses part of West Rogers Park.","Geography":"Rogers Park is Community Area #1. It is on the far north side of the city, being 9 miles (14 km) from the Loop.","Demographics":"Rogers Park has a higher rate of residents with Master's, Professional, and Doctorate degrees than the state average. In addition, the rate of residents that work for non-profit institutions is almost twice as high as the state average.According to an analysis by the Chicago Metropolitan Agency for Planning, as of 2019 in Rogers Park, 43.9% of residents were White, 27.4% were Black, 19.6% were Hispanic or Latino, and 4.9% were Asian. 34% of residents are foreign-born.","Economy and culture":"The dominant educational institution in Rogers Park is Loyola University Chicago, located in the southeast corner of the neighborhood. Historic places of interest include Madonna Della Strada Chapel, the mother church of the Jesuit Province of Chicago (one of the largest Jesuit provinces) and Mundelein Center for the Fine and Performing Arts, one of the tallest Art Deco buildings in Chicago outside of the downtown area. The neighborhood continues to be home to many Jesuit religious-order institutions. However, modern Rogers Park contains many different religious institutions.\nThe presence of its diverse array of students and academics from Loyola University Chicago and Northwestern University, just a few miles to the north, has historically lent Rogers Park a high degree of liberalism and tolerance. The community also has a high Internet presence. In 2007, the Web site outside.in named Rogers Park one of the country's \"bloggiest neighborhoods.\"Rogers Park has over 130 restaurants plus coffee shops and cafes and has been ranked \"very walkable\" by Walk Score.\nRogers Park is also home to the Glenwood Sunday Market, a farmers market, a program of the Rogers Park Business Alliance, devoted to providing local, sustainable foods that are also organic whenever possible. The Chicago Comedy Film Festival calls Rogers Park home and is held annually at The New 400 Theaters. The international film festival brings over 500 filmmakers, actors and agents to the neighborhood from around the world.\nA plethora of beaches line the shores of Lake Michigan through much of the neighborhood. The Artists of the Wall festival at the Lake Michigan shoreline at Farwell Avenue pier (Hartigan Park on Albion Avenue on the streetmap above), in which community members paint murals on benches along the lake, has been held for over twenty years, the longest event of its kind in Chicago's history.\nThe Luxembourg Brotherhood of America has held an annual event called Schobermesse in Rogers Park in June. The event was discontinued between 1967-2001, but continues to this day.","Crime and policing":"In 1993, Chicago's 24th Police District, which includes Rogers Park and the adjacent Chicago neighborhood of West Ridge, was selected as one of five police districts to pilot a new concept for Chicago law enforcement called Chicago Alternative Policing Strategy (\"CAPS\"). A merger of police and community efforts was implemented, which resulted in a noticeable effect on crime statistics. Weekly beat meetings (planning and strategy sessions) were held across the 24th Police District. All of Chicago's police districts put the strategy into practice by 1996. Index crimes in the 24th police district fell by about half between 1996 and 2009. According to an e-mail from 49th Ward Alderman Joe Moore, between January 1, 2013, and February 26, 2013, the 24th Police District was the only police district in Chicago in which no one was shot. In that same eight week period, the 24th District reported fewer crimes than all but one of Chicago's 22 police districts.","Schools, libraries, and museum":"Chicago Public Schools operates zoned schools serving the community:\nZoned K-8 schools include: Gale Elementary Community Academy, Eugene Field Elementary School (including New Field), Joyce Kilmer Elementary School, George B. Swift Elementary Specialty School, George B. Armstrong School of International Studies, and Jordan Community Elementary School.\nRoger C. Sullivan High School serves most of Rogers Park while a small section is zoned to Senn High SchoolOther CPS schools:\n\nChicago Math and Science Academy\nPACTT Learning CenterCharter schools:\n\nUNO Rogers Park Charter School\nHoward Area Leadership Academy (Closed)Private schools:\n\nNorthside Catholic Academy Elementary School\nNorthside Catholic Academy Middle School (formerly St. Margaret Mary Catholic Elementary School)\nThe Family Matters SchoolColleges and universities:\n\nCity Colleges of Chicago provides community college services\nLoyola University Chicago\/Lake Shore CampusLibraries\n\nRogers Park Branch of the Chicago Public Library\nCudahy Library at Loyola University, which mainly serves students but is open to the public\nGerber\/Hart Library and Archives, dedicated to LGBT books and other materialsLastly, Rogers Park is also home to the Leather Archives and Museum, \"dedicated to the compilation, preservation, and maintenance of leather, kink, and fetish lifestyles. [The] museum galleries serve to present educational and historical material to an adult audience.\"","Transportation":"Public transportation in Rogers Park is provided by the Chicago Transit Authority (CTA) in the form of the Chicago 'L'. The CTA also operates bus routes in the area. A commuter rail service is provided by Metra. \nRogers Park is served by three 'L' lines - the Red, Yellow and Purple lines.  There are four Red Line stations: Howard, Jarvis, Morse, and Loyola.  The Yellow Line and the Purple Line connect at Howard Station, offering service westward to Skokie and north to Evanston and Wilmette, respectively. The Howard Street 'L' station, the northernmost Chicago Transit Authority rail stop in the city, experienced major renovation from 2006 to 2009 and is now a major transportation terminal for the northern Chicago region. Several bus routes allow travel to Chicago's Downtown, called the Loop, as well as the city's suburban areas. They consist of the 22 Clark, 96 Lunt, 97 Skokie, 147 Outer Drive Express, 151 Sheridan, 155 Devon, and 201 Central\/Ridge. The Metra commuter Rogers Park station, at the intersection of Lunt and Ravenswood Avenues, is centrally located in the Rogers Park neighborhood. Rogers Park is one of the Metra system's most heavily used stops.\nThe neighborhood has taken measures to improve bicycle and pedestrian travel. Participatory budgeting, community meetings, and task force efforts led to an extensive neighborhood greenway project to improve bicycle infrastructure. A combination of buffered bike lanes, raised crosswalks, traffic circles, curb extensions, and more have helped connect residents to the neighborhood's most popular destinations (Loyola University, CTA Red Line stations, schools) via bike.","Government and politics":"","Chicago City Council":"Rogers Park lies mainly within the 49th and 50th wards in Chicago City Council, with small areas in the 40th ward.","Politics":"Rogers Park has supported the Democratic Party in the past two presidential elections. In 2016, Hillary Clinton received 86.1% of the vote compared to 7.5% for Republican Donald Trump. In 2020, Democrat Joe Biden won 89.3% over Trump’s 8.5%.","In popular culture":"Grammy-nominated Irish-American fiddler and composer Liz Carroll lived for a time in Rogers Park, and Rogers Park street names are referenced in the titles of her compositions the Morse Avenue reel, included on the Cherish the Ladies debut recording Irish Women Musicians in America on Schanachie, and The Greenleaf Strathsprey, included on the eponymous Liz Carroll on Green Linnet; both tunes are collected in her 2010 book Collected.Rogers Park, an indie drama released in 2018, is set in the neighborhood and prominently features Pratt Beach.","Notable people":"Mitch Altman, hacker and inventor\nManda Aufochs Gillespie, author. She resided in Rogers Park in the mid-2000s with her husband Sadhu.\nSadhu Aufochs Johnston, city manager for Vancouver. He and his wife Manda resided in Rogers Park while employed in Richard M. Daley's administration.\nBetty Ford, former first lady\nLara Flynn Boyle, actress (childhood)\nEula Biss, author\nHerbert Blitzstein (1934–1997) member of the Chicago Outfit. He resided at 6720 North Damen Avenue for a time.\nShani Davis, Olympic speed skater\nG. Walter Dittmar, dentist\nHugh Downs, TV personality\nTom Dundee, folk singer\nLarry Eyler, serial killer\nTina Fey, actress (early to mid 90s)\nEdward Gorey, illustrator (childhood)\nShecky Greene, comedian (former Sullivan High School student)\nMarion Mahony Griffin (1876–1961), architect notable for designing Canberra, the capitol of Australia. She lived in Rogers Park from 1939 until her death in 1961.\nMary Maher, journalist, trade unionist and feminist\nNeil Hartigan, 40th Lieutenant Governor of Illinois. He was raised in Rogers Park and lived there during his political career.\nHampar Kelikian (1899–1983), orthopedic surgeon and Armenian American activist. He resided at 6921 North Ridge Boulevard for a time.\nDan Kotowski, state senator\nRobert Spencer Long, president of Shimer College\nMary Maher, journalist, trade unionist and feminist\nVivian Maier, street photographer\nClayton Moore, actor famous for The Lone Ranger\nMarisol Nichols, actress\nDavid Orr, politician\nFritz Pollard, coach, NFL Hall of Fame\nHarold Ramis, actor, writer, director\nDan Ronan, former CNN correspondent, business journalist in D.C.\nDan Savage, writer (childhood)\nJan Schakowsky, U.S. House of Representatives, grew up in Rogers Park.\nGenndy Tartakovsky, animator, director, producer\nBurr Tillstrom, puppeteer and the creator of Kukla, Fran and Ollie\nLaken Tomlinson, American football offensive lineman in the NFL\nLucas Jade Zumann, actor (20th century women, Sinister 2, Anne with an ‘E’.)","See also":"Citizens for the Adelphi Theater","References":"","External links":"Official City of Chicago Rogers Park Community Map\nRogers Park Chamber of Commerce\nRogers Park Community Council\nRogers Park Community Development Corporation\nHistory of Rogers Park on Encyclopedia of Chicago\nLakeside Community Development Corporation\nRogers Park Business Alliance\nRogers Park Parents Group\nForgottenChicago.com (little-known elements of Chicago's infrastructure, architecture, neighborhoods and general cityscape, existing and historical)\nRogers Park West Ridge Historical Society"}]