[{"Neighborhoods":"","Little Village":"Little Village, often referred to as the \"Mexico of the Midwest,\" is a dense community in the western and central areas of South Lawndale, with a major commercial district along 26th Street. The area was originally settled by Eastern European and Czech immigrants mainly from Bohemia in the late 19th century, after the Great Chicago Fire sent the population of Chicago rippling out from the city's center to the outlying countryside. Jobs created by industrial development in the early 20th century also attracted residents to the area. Little Village saw a marked increase in Polish immigrants in the mid-20th century.The Mexican population of the Near West Side moved southward into Pilsen and westward into South Lawndale after the expansion of the University of Illinois Chicago campus in the mid-1960s which razed numerous blocks of housing. Scholar Juan C. Guerra notes that \"the contiguous communities of Pilsen and Little Village merged and emerged as the newest and largest Mexican neighborhood in Chicago.\"Little Village celebrates Mexican Independence Day every September with a parade down 26th Street. It is the largest Hispanic parade in Chicago. The Parade attracts thousands of spectators each year who flock to the neighborhood to show support and pride for their heritage.Little Village also boasts its economic power in Chicago. Little Village's 26th Street is the second highest grossing shopping district in the city. In 2015, the 2 mile street created $900 million in sales. Its contender, Michigan Avenue, made approximately $1.8 billion that same year.For green spaces and recreation in Little Village, residents can make a visit to the community parks. Washtenaw Park has a baseball diamond and offers a variety of arts and crafts classes for adults as well as day camps for kids. Shedd Park is a little park in Little Village named for John G. Shedd (known to most Chicagoans as the founder of the Shedd Aquarium). Piotrowski Park is the neighborhood's largest public park and is the most popular outdoor retreat for Little Village residents.\nFamous past residents of Little Village include former Mayor Anton Cermak, who lived in the 2300 block of S. Millard Avenue, across the street from Lazaro Cardenas Elementary. Pat Sajak was also a Little Village resident. He attended Gary Elementary School and Farragut High School.\nThe bulk of Little Village falls within the aldermanic boundaries of the 22nd Ward, represented by Ricardo Muñoz.In 2011, a music festival called Villapalooza was founded to promote non-violent spaces for arts, culture, and community engagement. This festival has been held yearly and has grown into one of Chicago's most popular and diverse grassroots music festivals drawing both local and international musicians. The festival is free and open to the public.\n\nOn August 26, 2018, a fire began early that morning in Little Village. The fire killed ten children, including six children under the age of 12. Investigators stated that the fire started in the back of the building in a ground-floor apartment, which was vacant. The fire was the deadliest residential fire to have occurred in Chicago since 1958. In the aftermath of the fire, multiple violations were found in the apartment where the fire occurred with apartment owner, Merced Gutierrez, appearing in court for the 40 violations found at the site of the fire.\nOn April 11, 2020, the city of Chicago permitted the implosion of an old smokestack at the Crawford Coal plant in Little Village by Hilco Redevelopment Partners to proceed. This action sent a large cloud of dust particles into the neighborhood sparking outrage and plans for a class action lawsuit. As reported by Mauricio Peña, community activists in Little Village had called upon mayor Lori Lightfoot to stop the implosion before it was carried out, concerned with exposing residents to asbestos and lead, especially during the 2019-2020 coronavirus pandemic.","Crime and public safety":"Cook County Jail is in South Lawndale.","Politics":"The South Lawndale community area has supported the Democratic Party in the past two presidential elections. In the 2016 presidential election, South Lawndale cast 11,878 votes for Hillary Clinton and cast\n585 votes for Donald Trump (92.01% to 4.53%). In the 2012 presidential election, South Lawndale cast 9,391 votes for Barack Obama and cast 688 votes for Mitt Romney (91.88% to 6.73%).","Education":"Chicago Public Schools operates district public schools, including Farragut Career Academy (the zoned school), Little Village Lawndale High School Campus and [1] Spry Community Links High School and Joseph E. Gary Elementary.\nHarrison Technical High School was previously in South Lawndale.Enlace Chicago operates within eight Chicago Public Schools in Little Village: Farragut, World Language, Infinity, Social Justice and Multicultural Arts High Schools and at Rosario Castellanos and Madero Middle Schools and Eli Whitney grammar school. \"Enlace Chicago Community Schools.\"\nOur Lady of Tepeyac High School is in Little Village.\nThe United Neighborhood Organization operates the Octavio Paz School in Little Village.","Notable residents":"Stuart Dybek (born 1942), writer and poet. Dybek was a childhood resident of Little Village and nearby Pilsen.\nJesús \"Chuy\" García (born 1956), member of the United States House of Representatives from Illinois's 4th congressional district since 2019. He is a longtime resident of South Lawndale and represents it in Congress.\nPat Sajak (born 1946), television personality and host of Wheel of Fortune. He was a childhood resident of South Lawndale.","See also":"Mexicans in Chicago","References":"","Further reading":"Sanchez, Casey. \"Turf War: Little Village Fights for Park.\" Extra. (date unknown) 2005\nSpanish version: (in Spanish) Sanchez, Casey. Translator: Víctor Flores. \"GUERRA EN EL CÉSPED: LA Mexico LUCHA POR PARQUE.\" Extra. (date unknown) 2005.","External links":"Official City of Chicago South Lawndale Community Map\nEnlace Chicago on Facebook\nLittle Village Chamber of Commerce\nLa Villita Community on Facebook\nLa Villita Community on Twitter\nMarshall Square Online\nMaria Saucedo bio\nMarshall Square Theater\nAlbaugh-Dover\nSt. Agnes of Bohemia in Little Village\nSt. Agnes of Bohemia School in Little Village\nRestaurant Dennis B&k in Little Village"}]