[{"Neighborhoods":"","Irondale":"The original settlement of South Deering was named \"Irondale\" before 1903, founded when the Joseph H. Brown Iron & Steel Company (later Wisconsin Steel) was established in 1875. Irondale was concentrated along and west of Torrence Avenue from 103rd Street to 109th. Large numbers of taverns were located along Torrence Avenue south of 106th Street to serve factory workers at the end of their shifts.\nAerial photographs from the 1930s show that the areas that would become Jeffrey Manor and Vet's Park were platted in the 1920s during the Chicago real estate boom, but it would not be until the 1950s that these plots would have homes constructed upon them due to the effects of the Great Depression.The Trumbull Park Homes were built in 1937–38 immediately west of the original settlement, and were the site of major racial violence in July 1953 when the Chicago Housing Authority (CHA) accidentally gave permission to a black family to move into the segregated housing project (the applicant, Betty Howard, was an exceptionally light-skinned black woman). A police presence was maintained for nearly a year after, and in October 1953 the CHA gave further permission for 10 more black families to move into the project. Racial tensions continued, and black residents feared using the nearby park without police protection through 1963.","Jeffery Manor":"Jeffery Manor is located between 95th Street on the north, Torrence Avenue on the east, 103rd Street on the south, and the Chicago and Western Indiana Railroad on the west. Construction began in 1947. When the steel mills operated, this area was predominantly Jewish, populated by World War II veterans purchasing their first house. The homes in this area are primarily duplexes, with bungalows and stand-alone two-storey homes around the edges.\nThe neighborhood of Jeffery Manor also includes another, smaller neighborhood, called Merrionette Manor. This sub-neighborhood is a unique break from the Chicago grid system, as the streets curve and form loops, giving a suburban feel in the heart of an otherwise urban, industrial neighborhood.","Vet's Park":"The area from 95th to 103rd and from Torrence Avenue to the Norfolk Southern railroad tracks is named \"Vet's Park\", as many of the houses were built immediately after World War Two to house returning soldiers who wanted to work in industry.","Slag Valley":"The area along S. Commercial Avenue between 104th and 100th Streets has been nicknamed \"Slag Valley\" by the locals for nearly 100 years, since large mounds of slag, petroleum coke, salt and other substances are left out in the open near homes and businesses.In 2013, community activists have fought to have the mounds removed, since the dust can damage the health of residents, and succeeded in having a city ordinance passed banning open-air storage of petcoke in 2015. The piles were removed in June 2016, but in 2017, the Environmental Protection Agency (EPA) warned residents of high levels of airborne manganese blowing over from the same areas that stored petcoke. Manganese can lead to a permanent neurological disorder known as manganism, the symptoms of which include tremors, difficulty walking, facial muscle spasms and mood changes. In children, manganese can affect brain development, including changes in behavior and decreases in learning and memory capacities. As of December 2017, the EPA and city of Chicago still investigating.","History":"","Early history":"South Deering was originally settled in the 1870s by workers from England, Wales, and Ireland who were attracted by the industrial jobs in nearby factories. As more industries were set up along the Calumet River, immigrants from eastern and southern Europe arrived, in addition to a small Mexican community which formed by the 1910s.\nMajor employers included Wisconsin Steel, Illinois Slag and Ballast Company, and the Federal Furnace Company, as well as U.S. Steel Southworks in nearby South Chicago and the Ford Assembly Plant in Hegewisch. Additionally, a large railroad marshalling yard has been present in the northwest part of the neighborhood since the 1870s.","20th century":"The area prospered through World War One and the 1920s, but like other neighborhoods reliant on heavy industry, South Deering was devastated during the Great Depression. The decline in production led to mass unemployment, and by October 1933 some 20% of households were receiving relief from the city, state, or federal government.\nSouth Deering's fortunes improved with the onset of World War II, as the mills and other factories operated around-the-clock, even on holidays, to produce the steel, food products, and armored vehicles necessary to win the war. The segregated Trumbull Park Homes, a public housing project, and the Jeffery Manor subdivision were constructed beginning in 1938 and 1947, respectively, and the population increased from 7,900 in 1930 to 18,900 by 1960. Starting in 1953, racial tensions worsened as the existing white residents violently opposed a handful of black residents who were seeking suburban-style homes close to the factories. White flight occurred in South Deering in the 1960s and 1970s, as white families began to move to suburbs such as Dolton, Riverdale, Burnham, Calumet City, South Holland, and Lansing, but it never reached the levels of other neighborhoods such as Roseland, South Chicago, and South Shore.While the Calumet River was industrialized by the Great Depression, Lake Calumet itself was left mostly untouched until the 1950s, when the city of Chicago and state of Illinois began to infill parts of the lake to construct the International Port of Illinois (1959) and large slips for more steel mills, chemical plants, and oil refineries.\nHowever, the decline of heavy industry slammed South Deering in the 1970s and 1980s, as Wisconsin Steel (which employed over 3,000 workers during the 1960s) shuttered for good in 1980 and the nearby U.S. Steel Southworks laid off half of its workforce in the 1970s before also closing for good in 1992. The neighborhood has never recovered from these losses, and the population declined by nearly 20%.","Modern day":"Today, South Deering is a primarily black and Latino neighborhood, with some elderly white ethnic residents remaining. The average household income is 43% below the average for the city of Chicago as a whole, and about 25% of the population lives in poverty. Crime is somewhat higher than average, but South Deering has been spared the worst violence that has plagued nearby neighborhoods such as Pullman and South Chicago. The Insane King Cobras and Spanish Vice Lords were founded in this neighborhood in 1979 and 1980, respectively, though violent crime has significantly died down since the early 1990s. Petty crime does remain a problem, however.In recent years, many abandoned factories were demolished, leaving large tracts of polluted land behind. Community activists have fought to establish more natural parkland in the area, and have some former industrial sites designated as Superfund sites, citing the health hazards to residents, with varying degrees of success.","Demographics":"According to a June 2017 analysis by the Chicago Metropolitan Agency for Planning, there were 15,305 people and 5,068 households in South Deering. The racial makeup of the area was 3.9% White, 65.1% African American, 0.1% Asian, 1.0% from other races. Hispanic or Latino of any race were 29.9% of the population. In the area, the population was spread out, with 28.8% under the age of 19, 19.1% from 20 to 34, 16.4% from 35 to 49, 19.6% from 50 to 64, and 15% who were 65 years of age or older. The median age was 37 years.","Politics":"South Deering overwhelmingly voted for the Democratic Party in the past two presidential elections. In the 2016 presidential election, South Deering cast 5,980 votes for Hillary Clinton and cast 486 votes for Donald Trump. In the 2012 presidential election, South Deering cast 6,772 votes for Barack Obama and cast 462 votes for Mitt Romney.","Transportation":"South Deering is served by a number of CTA bus routes:\n\nN5 South Shore Night Bus\nJ14 Jeffery Jump\n15 Jeffery Local\n28 Stony Island\n71 71st\/South Shore\n95 95th\n100 Jeffery Manor Express (weekday rush hours only)\n106 East 103rd","Religion":"The Roman Catholic Archdiocese of Chicago operates Catholic churches. On July 1, 2020, Our Lady Gate of Heaven Church in Jeffery Manor, along with Our Lady of Peace, St. Bride, and St. Philip Neri in South Shore, will merge.","Notable residents":"Jon Burge (1947–2018), detective in the Chicago Police Department who was convicted of crimes related to torturing more than 200 criminal suspects between 1972 and 1991 in order to force confessions. He was a childhood resident of 9612 South Luella Avenue.\nGregory Mitchell (b. 1969), member of the Chicago City Council since 2015. He is a resident of Jeffery Manor.\nSherman Skolnick (1930–2006), conspiracy theorist and activist. He resided at 9800 South Oglesby Avenue from 1950 until his death.","References":"","External links":"Official City of Chicago South Deering Community Map\nNortheastern Illinois University community history project\nLake Calumet region Journey through Calumet, The Field Museum\nSouth Deering community area\nJeffery Manor neighborhood\nSouth Deering neighborhood\nVets Park neighborhood"}]