[{"History":"","Early years":"The historical, cultural, and commercial center of Uptown is Broadway, with Uptown Square at the center. In 1900, the Northwestern Elevated Railroad constructed its terminal at Wilson and Broadway (now part of the CTA Red Line). Uptown became a summer resort town for downtown dwellers, and derived its name from the Uptown Store, which was the commercial center for the community. For a time, all northbound elevated trains from downtown ended in Uptown.  Uptown became known as an entertainment destination. Charlie Chaplin, Gloria Swanson and other early film stars produced films at the Essanay Studios on Argyle Street. The Aragon Ballroom, Riviera Theater, Uptown Theatre, and Green Mill Jazz Club are all located within a half block of Lawrence and Broadway. Uptown is also home to one of Chicago's most celebrated final resting spots, Graceland Cemetery.\nThe Uptown neighborhood boundary once extended farther to the North, to Hollywood Avenue. Beginning at the turn of the 20th century, just after the World's Columbian Exposition, the entire area had experienced a housing construction boom. In the mid-1920s, construction of large and luxurious entertainment venues resulted in many of the ornate and historic Uptown Square buildings which exist today. The craftsmanship and artistry of those Uptown Square buildings reflects the ornate pavilions of the Exposition.\nFor over a century, Uptown has been a popular Chicago entertainment district, which played a significant role in ushering in the Gilded Age, the American Lyceum movement, the jazz age, the silent film era, the swing era, the big band era, the rock and roll era, has been a filming location for over 480 movies, has ties to significant spectator sport athletes and organizations, including the Chicago Blackhawks and three Olympic figure skaters, as well as theater, comedy clubs, dance performers who later became nationally famous, and even \"The People's Music School,\" a needs-based, tuition-free music school for formal classical music training.","Postwar era":"By the 1950s, the middle class was leaving Uptown for more distant suburbs, as commuter rail and elevated train lines were extended. Uptown's housing stock was aging, and old mansions were subdivided. Residential hotels which had housed wives of sailors attached to the Great Lakes Naval Station during World War II now served low-income migrants from the South and Appalachia. Uptown developed a reputation as \"Hillbilly Heaven\" in the 1950s and the 1960s. The Council of the Southern Mountains, headquartered in Berea, Kentucky, launched the Chicago Southern Center in 1963 in Uptown, with help from the Chicago philanthropist W. Clement Stone. Chicago's anti-poverty program opened the Montrose Urban Progress Center. Students for a Democratic Society initiated a community organizing project, JOIN (Jobs or Income Now) in 1963. Large-scale urban renewal projects like Harry S. Truman College eliminated much low-cost housing, and the low-income Southern white residents dispersed. New waves of Asian, Hispanic, and African-American migrants moved into the remaining neighborhoods.\nLatinos forced out from other near downtown and lakefront areas by urban renewal settled close to the border with Lakeview at Sheridan, near Irving Park Rd. In 1975 Young Lords founder Jose (Cha-Cha) Jimenez joined with a broad coalition of whites, blacks and Latinos and ran unsuccessfully against Daley-sponsored Christopher Cohen but still garnered 39% of the vote. His main campaign issue was housing corruption, which was displacing Latinos and the poor from prime real estate areas of Chicago.","21st century":"Most recently, since 2000, gentrification has spread north from neighboring Lakeview and south from Edgewater. Median condo prices jumped 69.1% from 2000-2005.In 2008, a group of residents sued the City of Chicago over its designation of the Wilson Yards lot as a Tax Increment Financing (\"TIF\") district.In December 2009, a Chicago Tribune story reported on the problem facing eastern sections of Uptown where several nursing homes clustered in the area house the mentally ill, including felons. Many of these residents have committed a variety of serious crimes including murder, and 11 nursing homes in the area house 318 convicted felons and 1350 mentally ill people.","Historical records":"Historical images of Uptown can be found in Explore Chicago Collections, a digital repository made available by Chicago Collections archives, libraries and other cultural institutions in the city.","Neighborhoods":"","Buena Park":"Buena Park is a neighborhood bounded by Montrose Avenue, Irving Park Road, Graceland Cemetery and Lake Shore Drive. At the core of the neighborhood is the Hutchinson Street Historic District, a tree-lined stretch several blocks long featuring mansions that make up \"one of the best collections of Prairie-style architecture in the city.\" It is in sharp contrast to the skyscrapers that populate the area around it. The neighborhood was listed on the National Register of Historic Places in 1984. It can be accessed from the Sheridan stop on the CTA's Red Line.\nRobert A. Waller developed Buena Park starting in 1887 by subdividing his property. The site of the original Waller home now holds St. Mary of the Lake church (built in 1917). Buena Park pre-dates the remainder of Uptown by a number of years. Buena Park is also home to one of the most active neighborhood organizations in Chicago: Buena Park Neighbors.\"The Delectable Ballad of the Waller Lot\" by Chicago poet Eugene Field:\nUp yonder in Buena ParkThere is a famous spot,In legend and in history(Known as) the Waller lot.","Sheridan Park":"Sheridan Park is a neighborhood roughly bounded by Lawrence Avenue on the north, Clark Street on the west, Montrose on the south, and Broadway on the east. It is mostly residential, containing six-flats, single family homes, and courtyard apartment buildings. There is a growing business district along Wilson Avenue, which bisects Sheridan Park. Truman College, one of the City Colleges of Chicago, is also located in Sheridan Park. The neighborhood can be accessed from either the Wilson or Lawrence stop on the CTA's Red Line.\nIn 1985, the Sheridan Park Historic District (a National Landmark District) was established to protect the unique single-family and smaller multi-family architecture of the area. According to the National Park Service, the district is roughly bounded by Lawrence Avenue on the north, Clark Street on the west, Montrose on the south, and Racine on the east. Some structures of Uptown Square were also added as contributing structures. \nIn December 2007, the Chicago City Council approved the Dover Street Historic District in Sheridan Park. This designation covered the three northern blocks of Dover Street and four single-family homes on the west side of adjacent Beacon Street just south of Lawrence Avenue. Unlike federal Landmark District status, City landmark status limits the demolition and modification of properties without the approval of the Chicago Landmarks Commission.","Argyle Street":"More recently known as \"Asia on Argyle,\" but also known as \"Little Saigon\", and \"Little Vietnam\", this neighborhood was mostly populated by residents of Vietnamese and Cambodian nationality. However, many, if not most, were from ethnic Chinese minorities, and for that reason became refugees during the Sino-Vietnamese War of the late 1970s. Many ethnic residents continue to migrate to other neighborhoods and to the suburbs while keeping their businesses in the span of just a few city blocks. Argyle Square hosts Asian grocery stores as well as ethnic Vietnamese, Thai, Laotian, and Chinese restaurants.\nThe neighborhood should not be confused with Chinatown, which is in the Armour Square community area on the South Side of the city.\nThe neighborhood is served by the Argyle stop on the CTA's Red Line and CTA busses on Sheridan Rd. and Broadway.","Margate Park":"Margate Park is situated in the extreme northeast corner of the Uptown community, nestled between the recently rejuvenated strip of new construction on Sheridan Road and the pleasantries of the northern reaches of Lincoln Park. It is bound by Lincoln Park and Sheridan Road to its east and west, and Foster Avenue and Lawrences Avenue to its north and south, respectively.\nIts tree-lined streets, historic mansions, and gilded mid-rises reflect the area's development in the bustle of Uptown's entertainment industry from the early 1900s, now undergoing a burgeoning revitalization. The diverse housing also includes ornate, imposing terra-cotta clad buildings, immortalized in the movies of early twentieth century Chicago as apartment hotels and boarding houses. Some of these 1920s, Jazz-Age hotels have since been converted to high-end condos and co-ops, adding to the tremendously diverse population of the area.  The Margate Park community, as well as much of the Uptown neighborhood of which it is a part, is a popular and thriving home to many of the city's LGBT residents.  On Margate Park's western edge is also one of the city's longest running gay bars, Big Chicks, owned and operated for the past 30 years.  Designed in 1937 by architect Charles Kristen, its asymmetrical facade, clearly influenced by the 1933-34 Century of Progress Exposition in Chicago, features dazzling decoration, with yellow vertical piers on a backdrop of cobalt blue, as well as splashes of aqua. The building itself is architecturally significant for its deco facade.Margate Park contains a Lake Shore Drive underpass near Argyle Avenue adjacent to the Margate Playground, just east of Marine Drive, which permits pedestrians and bikers easy access to the lakefront path and the Foster and Lawrence Avenue beaches.\nMany of the houses here were built from the 1890s to the 1920s. Although it has remained a mostly white and wealthy area throughout the 20th century, it is a fairly integrated community. In 1940 some blacks who lived as domestic workers resided in a single block of houses in close proximity to their employers. Those houses were described by Jacalyn D. Harden, author of Double Cross: Japanese Americans in Black and White Chicago, as being \"modest\".At 5000 North Marine Drive is The Aquitania, a co-op building constructed in 1923 and listed on the National Register of Historic Places since 2002.  The Aquitania was built by Ralph C. Harris and Byron H. Jillson in the Classical Revival style. It was developed by George K. Spoor, the co-founder of Essanay Studios, a producer of silent movies in the first decades of the twentieth century. At this time, Chicago rivaled both New York City and Hollywood in film production, and Spoor was able to use his considerable wealth to build an apartment he felt fitting for the film stars connected with Chicago's growing entertainment industry.","Landmarks":"","Uptown Entertainment District":"Historically a very popular tourist destination, the Uptown Entertainment District is home to various music venues, nightclubs, restaurants and shops. The Uptown Entertainment District is now experiencing a revival, with new restaurants and shops opening every year. Uptown Square, at the center of the Uptown Entertainment District, was designated as a National Historic District on the National Register of Historic Places in 2000. Uptown is also a stop for Chicago Gangster tours, with many locations tied to infamous gangsters such as John Dillinger, Al Capone, Machine Gun Jack McGurn, Roger Touhy  (\"Terrible Touhy\")  and others.","Aragon Ballroom":"","Riviera Theater":"","Uptown Theatre":"","Green Mill Cocktail Lounge":"","Baton Show Lounge and Double Door":"","Former venues":"","The Rainbo":"","Arcadia Ballroom":"","5100 Club":"","Argyle Street Asian restaurants and shops":"Argyle Street, from Sheridan to Broadway and spilling onto Broadway, features Chinese, Vietnamese, Thai, Laotian, French Vietnamese and Cambodian ethnic restaurants and bakeries. There are also many Asian groceries, shops and trading companies that sell unique Asian merchandise. This area is locally called by many different names, including New Chinatown, North Chinatown, Little Chinatown, Little Saigon, New Saigon, Little Cambodia, Vietnamese Town, Little Vietnam, or by many in the Asian community simply as \"Argyle\". The surrounding neighborhood, which has attracted Asian immigrants and refugees for the past several decades, is listed on the National Register of Historic Places as the West Argyle Street Historic District. It is easily reached by the Argyle stop on the Red Line 'L.'\nOne block east of the Argyle 'L' stop, at the corner of Argyle and Winthrop is The Roots of Argyle mural, a community-produced painting depicting 100 years of immigration and daily life on Argyle Street.","Graceland Cemetery":"In southwestern Uptown is historic Graceland Cemetery.  Visitors here can find the elaborate tombs of Chicago's famed dead.  Because some of Chicago's famous architects designed memorials and are buried here, the Chicago Architecture Foundation offers several walking tours of the cemetery during the spring, summer, and fall.","Amenities":"","Parks, beaches and boating":"Chicago's Lincoln Park straddles Uptown—providing soccer and athletic fields, a segment of the Chicago lakefront bicycle\/running path, Montrose Point Bird Sanctuary (\"The Magic Hedge\"), a sledding hill, Puptown Dog Park, Wilson Skatepark and Waveland (Marovitz) Golf Course to the south. Also in the Uptown portion of Lincoln Park is Montrose Beach, which includes a dog beach at its northern edge, and Montrose Harbor, a marina for local and transient boaters and home to the Chicago Corinthian Yacht Club.One park, which is an inland part of lakefront Lincoln Park, is located just west of Lake Shore Drive, called Clarendon Park, and the Margate Field House in North Lincoln Park both feature athletic fields, children's playgrounds and indoor sports facilities. Chase Park, located on the west side of Clark Street at Leland Avenue, has indoor and outdoor athletic facilities, as well as an outdoor pool and tennis courts.","Hospitals":"Chicago Lakeshore Hospital\nMethodist Hospital of Chicago\nThorek Memorial Hospital\nLouis A. Weiss Memorial Hospital","Schools":"Chicago Public Schools operates district public schools:K-8 schools serving sections of Uptown:\nBrennemann Elementary School\nGoudy Elementary School\nMcCutcheon Elementary School\nMcPherson Elementary School\nRavenswood Elementary School\nStockton Elementary School\nCourtenay Language Arts CenterMost residents are zoned to Senn High School while those west of Ashland are zoned to Amundsen High School.CPS magnet schools:\n\nWalt Disney Magnet SchoolHigh schools:\n\nUplift Community High SchoolPrivate schools:\n\nOur Lady of Lourdes Elementary School (closed 2004)\nSt. Mary of the Lake Elementary School\nSt. Thomas of Canterbury Elementary SchoolThe previous campus of the Lycée Français de Chicago was located in Uptown Chicago.Colleges and universities:\n\nHarry S Truman College\nSt. Augustine College\nAmerican Islamic College","Cultural":"The Haitian American Museum of Chicago\nThe American Indian Center was located for decades in Uptown and moved to nearby Albany Park in 2017","Politics and government":"","United States Congress":"Most of Uptown is located in Illinois's 9th congressional district, and some of the westernmost part of the community area is located in the 5th congressional district.","Politics":"Uptown has supported the Democratic Party in the past two presidential elections. In 2016, Democrat Hillary Clinton received 23,815 votes, 85.6% over Republican Donald Trump’s 2,481 votes, or 8.9%. In 2020, Democrat Joe Biden won 27,009 votes, 88.0%, and Trump received 3,154 votes, 10.3%.","Chicago City Council":"Uptown is divided into multiple wards, which are the districts from which aldermen in the Chicago City Council are drawn. Most of the community area lies in the 46th and 48th wards, with small portions of the neighborhood's west side located in the 47th and 40th wards.","Transportation":"Uptown is served by the Argyle station, Lawrence station, and Wilson station, on the Chicago Transit Authority's Red Line, which provides 24-hour service between Rogers Park and Roseland. Just to the west of the neighborhood is Ravenswood station on Metra's Union Pacific \/ North Line, which provides commuter rail service between Kenosha station and Ogilvie Transportation Center. The Chicago Transit Authority's #92 Foster, #81 Lawrence, #78 Montrose, #80 Irving Park, #22 Clark, #36 Broadway, #146 Inner Drive Express & #151 Sheridan bus lines serve the neighborhood. For cyclists, the neighborhood is best traversed by Broadway (North\/South) and Lawrence Avenue (East\/West), both of which have bicycle lanes on all or some of the road. For motorists, Lake Shore Drive has exit ramps at Foster Avenue, Lawrence Avenue, Wilson Avenue, Montrose Avenue, and Irving Park Road.","Notable people":"Eric Gunnar Gibson (1919–1944), soldier in the United States Army and recipient of the Medal of Honor for his actions in World War II. He was a childhood resident of Uptown and lived at 4040 North Broadway.\nHarold Ernest Goettler (1890–1918), aviator in the United States Army Air Service awarded the Medal of Honor for valor during the search for the Lost Battalion. He was raised at 4630 North Dover Street.\nTalen Horton-Tucker (born 2000), NBA player.\nWilliam C. Marland (1918–1965), politician and 24th Governor of West Virginia. After his time as Governor, he lived at a YMCA at 1725 West Wilson Avenue from 1961 to 1965 while working as a taxi cab driver and recovering from alcoholism.\nGeorge R. R. Martin (born 1948), novelist and short story writer best known for A Song of Ice and Fire. He lived in Uptown while performing alternative service work as a VISTA volunteer attached to the Cook County Legal Assistance Foundation.\nAyanna Pressley (born 1974), member of the United States House of Representatives from Massachusetts's 7th congressional district since 2019. Pressley was a childhood resident of Uptown, moving to attend college at Boston University.\nIva Toguri D'Aquino (1916–2006), English-language radio broadcaster who transmitted Radio Tokyo's propaganda to Allied soldiers in the South Pacific during World War II on The Zero Hour radio show. Toguri lived in a three-flat in Uptown after the War.","Notes":"","References":"Balaban, David (2006). The Chicago Movie Palaces of Balaban and Katz. Chicago: Arcadia Publishing. ISBN 0-7385-3986-4.\nGitlin, Todd; Hollander, Nanci (1970). Uptown: Poor Whites in Chicago. Evanston: Harper & Row. OCLC 96088.\nGuy, Roger (2007). From Diversity to Unity: Southern and Appalachian Migrants to Chicago, 1950-1970. Lanham, MD: Lexington Books. ISBN 978-0-7391-1833-7.\nStacewicz, Richard; McNeill, Robert (1995). \"Uptown\". Local community fact book : Chicago metropolitan area, 1990. Chicago: University of Illinois at Chicago. ISBN 0-914091-60-3.","External links":"Official City of Chicago Uptown Community Map\nLakeside Community Development Corporation\nBusiness Partners- The Chamber for Uptown\nUptown Chicago Commission\nBuena Park Neighbors\nMagnolia Malden Neighbors\nCompass Rose Cultural Crossroads Collection of articles, some of which relate to Uptown history\nUptown History Blog Blog with images from Uptown's past.\nUptown Update News and Commentary from the 46th Ward of Chicago\nSeeClickFix Report non-emergency issues in the Uptown neighborhood"}]