[{"History":"In the mid-to-late 19th century, a large number of Irish and German railroad workers and meatpackers made Washington Park home. There was a sprinkling of African American residents in the working-class district south of Garfield Boulevard\/55th Street. Affluent American-born European Americans settled the wide north-south avenues that provided a direct route into the Loop 7 miles (11 km) to the north. Cable cars, the Chicago 'L' and wide boulevards contributed to late 19th century prosperity. The wide avenues, especially Grand Boulevard (now named Dr. Martin Luther King Jr. Memorial Drive), provided popular locations for mansions and grand apartments built by many wealthy Chicagoans.The park in this community area was named for President George Washington in 1880. In the 1920s, the University of Chicago created the community area system of city subdivision with the current names that continue to be used today. The community areas although not formally adopted by the United States Census Bureau are largely consistent with census tract boundaries. The Washington Park community area and its census tracts have been unchanged.","Changing demographics":"A turn-of-the-20th-century housing construction boom along with increases in the African American population of the midwest during the Great Migration resulted in the movement of lower-income and predominantly African American Chicagoans southward. Soon, the European-American inhabitants mostly left the area, in a phenomenon often termed \"white flight\". The transition was rapid and marked with conflicts such as the Race Riot of 1919. Some white Protestants left to form an exclusive residential community in the South Shore community area. In 1906 they formed the South Shore Country Club, which excluded Black people and Jews from membership.The area rapidly changed from European American to African-American in the 1920s. By 1930, the population was only 7.8% white. By 1960, the population was 0.5% white. From 1950 to 2000 the total population of the neighborhood declined from 57,000 to 14,146. This population decline is partly due to initiatives of the Chicago Land Clearance Commission, who acted under the 1955 Amendment to the Blighted Areas Redevelopment Act, which allowed redevelopment authorities that acquired land by condemnation or otherwise to redevelop such lands for non-residential uses. A good example of the Land Clearing commission activities is the Lake Meadows Park to the north of Washington Park. The failure of the evolution of industry and commerce in the community, the above-mentioned white flight and land redevelopment for non-residential use combined lead to population decline.","Religion":"Religion and worship are cornerstones of the South Side communities. The nearby hub of Bronzeville at 47th and Dr. Martin Luther King, Jr. Drive (known as King Drive and formerly Grand Boulevard) was a cultural hub of the neighborhood that fostered a cultural identity. In keeping with the racial transformation, the cultural and religious institutions, including those of Irish Catholics, Greek Orthodoxy and the Jewish faith, converted to African American institutions.","Structures":"The neighborhood once contained many public housing complexes including about a third of the nation's largest, the Robert Taylor Homes. The Taylor homes have been demolished because of the socioeconomic problems that they perpetuated. The area has minimal industry or commerce at the current time. The other property on the NRHP in the area is the Schulze Baking Company Plant.\nThe DuSable Museum of African American History, founded in 1961, moved to Washington Park in 1973. It is a Washington Park landmark and one of the largest African American museums in the country.","Namesakes":"Several nearby regions and institutions use Washington Park in their name. Immediately to the south, Washington Park Subdivision exists where Washington Park Race Track once stood. One city block to the north, Washington Park Court District is a neighborhood that has become a Chicago Landmark.","In literature and culture":"The Washington Park neighborhood has been the setting for works of popular literature. James T. Farrell's Studs Lonigan trilogy is set in Washington Park. In Richard Wright's novel Native Son, Bigger Thomas drives the drunken Jan Erlone and Mary Dalton around Washington Park, as the two embrace. In addition to hosting the DuSable Museum, the park hosts Fountain of Time, the world's earliest concrete finished art work.Additionally, the aforementioned adjacent Washington Park Subdivision has been the subject of notable literature. The conditions of this neighborhood are described in a section of Black Metropolis by St. Clair Drake and Horace Roscoe Cayton.The play Raisin in the Sun was inspired by Lorraine Hansberry's time in the neighborhood after her father won the repeal of restrictive covenants. The Hansberry house, the red brick three-flat at 6140 S. Rhodes Avenue which they bought in 1937, is up for landmark status before the Chicago City Council's Committee on Historical Landmarks Preservation.","Notable people":"Dayvon Daquan Bennett (1994–2020), alias \"King Von\", rapper and songwriter\nJesse Binga (1865–1950), founder of the first privately owned African American bank in Chicago. He moved to the then-white neighborhood in 1917.\nChief Keef (born 1995), rapper and record producer.\nGrover C. Nash (1911–1970), aviator and first Black pilot to fly mail for the United States Postal Service. He resided at 6109 South Calumet Avenue at the time of his feat.\nCecil A. Partee (1921–1994), 31st and 33rd President of the Illinois Senate. He resided at 6032 South Michigan Avenue while serving as a member of the Illinois House of Representatives.\nDeval Patrick (born 1956), 71st Governor of Massachusetts (2007-2015). He was raised in Washington Park.\nHarry Mark Petrakis (1923–2021), novelist known for depictions of Greek-American life. He was a childhood resident of Washington Park.\nMelvin Van Peebles (1932–2021), actor, filmmaker, playwright, novelist and composer. He was a childhood resident of the Washington Park community area at 58th and Calumet.","See also":"Washington Park (Chicago park)","Notes":"","External links":"Official City of Chicago Washington Park Neighborhood Map\nChicago Park District: Washington Park\nWashington Park Quality-of-Life Neighborhood Planning"}]