[{"Neighborhood boundaries":"The boundaries of West Garfield Park are NORTH: W. Kinzie St. EAST: Hamlin Blvd\/ S. Independence Blvd. SOUTH: W. Taylor St. from S. Independence Blvd to S. Kildare Ave., S. Kildare Ave. from W. Taylor St. to W. 5th Ave, W. 5th Ave. from S. Kildare Ave. to S. Kolmar Ave. WEST: S. Kolmar Ave from W. 5th Ave. to W. Jackson Blvd., W. Jackson Blvd. from S. Kolmar Ave. to S. Kenton Ave., S. Kenton Ave. from W. Jackson Blvd. to W. Madison St., W. Madison St. from S. Kenton Ave. to N. Kenton Ave., N. Kenton Ave. to W. Kinzie St.","K-Town":"K-Town is a nickname for an area in Humboldt Park, North Lawndale, and West Garfield Park. Although these long streets extend beyond the bounds of North Lawndale, and West Garfield Park, published sources identify the name K-Town as referring specifically to an area of North Lawndale, and West Garfield Park, i.e. the area through which these streets pass. between Pulaski Road and Cicero Avenue in which the names of many north-south avenues begin with the letter K (Keystone, Karlov, Kedvale, Keeler, Kenneth, Kilbourn, Kildare, Kolin, Kolmar, Komensky, Kostner, Kilpatrick, Kenton, Knox, and Keating). The pattern is a historical relic of a 1913 street-naming proposal, by which streets were to be systematically named according to their distance from the Illinois-Indiana border; K, the eleventh letter, was to be assigned to streets within the eleventh mile, counting west from the state line. The eleventh mile is the easternmost area in which the plan was widely implemented, as many neighborhoods to the east were already developed and had street names in place. The portion of K-Town bounded by W. Kinzie St,  W. Cermak Rd, S. Kostner Ave, and S. Pulaski Rd was listed as a historic district on the National Register of Historic Places on September 9, 2010.","Government and infrastructure":"The United States Postal Service operates the Mary Alice Henry Post Office at 4222 West Madison Street.Bethel New Life, Inc. is a main community service provider to the area.The Chicago Tool Library is headquartered in the area.","Transportation":"Two of the Chicago Transit Authority's train lines, the Blue Line and the Green Line, serve this neighborhood. The Green Line has an elevated station at Pulaski, and the Blue Line has a station in the median of the Eisenhower Expressway, also at Pulaski.","Crime":"The neighborhood's 21 murders in 2014 occurred at a rate of 116 per 100,000, giving this neighborhood the highest murder rate in Chicago. In a city that sees 2,000 shootings per annum, they occur in West Garfield Park at a rate of 411 per 100,000.\nIn 2016, the violence increased further, with a total of 31 murders, resulting in a murder rate of 172 per 100,000. Additionally, at least 172 people were shot during 2016, resulting in a shooting rate of 950 per 100,000 people.","References":"","External links":"Official City of Chicago West Garfield Park Community Map"}]