[{"Neighborhoods":"","Pulaski Park":"Pulaski Park is a neighborhood directly west of Goose Island and east of Wicker Park. The generally accepted boundaries of Pulaski Park are Ashland (1600 W) to the west, the Chicago River and Elston Avenue to the east, the Bloomingdale Line on the north, and Chicago (800 N) on the south (although some people extend the southern border only to Division Street).\nPulaski Park derives its name from the historic park and fieldhouse that was designed by Jens Jensen between 1912 and 1914.  1,200 people were displaced, leading to the razing of a number of buildings while others were moved to nearby locations in the neighborhood. The park and fieldhouse were listed on the National Register of Historic Places on August 13, 1981. It became an official Chicago Landmark on July 29, 2003.The neighborhood borders on Polonia Triangle which was considered to be the center of Chicago's Polish Downtown, the city's oldest and most prominent Polish settlement, functioning as the capital of American Polonia. Because of this, the headquarters of many major Polish organizations in the United States were found in Pulaski Park such as the Polish National Alliance, the Polish Daily News and the Polish Women's Alliance. Pulaski Park is listed within \"Polonia Triangle\" as one of the 11 neighborhoods included in The Labor Trail which chronicles Chicago's history of working class life and struggle. The neighborhood is also home to two of Chicago's Polish Cathedrals: St. Stanislaus Kostka and Holy Trinity Polish Mission.\nPulaski Park was the area of West Town that served as Chicago Congressman Dan Rostenkowski's base of operations. The family still owns the building opposite St. Stanislaus Kostka church at 1372 Evergreen from which he ran his operations. Although Pulaski Park has declined from its heyday days as part of the city's Polish Downtown, the entire West Town area has undergone a renaissance as gentrification has transformed the area.This area's higher population density gave it a more working-class population than Wicker Park. As opposed to other areas of West Town, much of the original housing stock of Pulaski Park has not been torn down for new construction in recent years.","Wicker Park":"Wicker Park is a Chicago neighborhood northwest of the Loop, south of Bucktown and west of Pulaski Park. Charles and Joel Wicker purchased 80 acres (32 ha) of land along Milwaukee Avenue in 1870 and laid out a subdivision with a mix of lot sizes surrounding a 4-acre (1.6 ha) park. The Great Chicago Fire of 1871 spurred the first wave of development, as homeless Chicagoans looked to build new houses.\nBefore the turn of the twentieth century, Germans and Scandinavians tended to live in the area's north and northwestern sections. Wicker Park became the abode of Chicago's wealthy Northern European immigrants.  The district proved especially popular with merchants, who built large mansions along the neighborhood's choicest streets—particularly on Hoyne and Pierce, just southwest of North & Damen, known then as Robey.  Hoyne was known as \"Beer Baron Row,\" as many of Chicago's wealthiest brewers built mansions there.With the end of the 19th century the area was subsumed into the surrounding Polish Downtown and the area adjacent to the park which gave the neighborhood its name became known as \"the Polish Gold Coast\". In the 1890s and 1900s, immigration from Poland and the completion of the Metropolitan West Side Elevated Lines greatly boosted the population density of West Town, especially in areas east of Wicker Park. The area around Division, Milwaukee, and Ashland was once known as 'Kostkaville', and the intersection retains the moniker \"Polish Triangle\" to this day. The provisional government of Poland met in Wicker Park during World War I. The near Northwest Side is home to many of the most opulent churches in the Archdiocese of Chicago, built in the so-called 'Polish Cathedral style'.\n\nPolish immigration into the area accelerated during and after World War II when as many as 150,000 Poles are estimated to have arrived between 1939 and 1959 as Displaced Persons (DPs). Like the Ukrainians in neighboring Ukrainian Village, they clustered in established ethnic enclaves like this one that offered shops, restaurants, and banks where people spoke their language. Division Street was referred to as Polish Broadway. Poet John Guzlowski whose parents first came to the area as DPs commented on growing up in the area in the 1950s that \"it felt like everyone was a Pole\", a place where the local store owners, priests, cops, trash men, teachers, librarians all either spoke Polish or had family that did.Nelson Algren's literary output lionized the Division Street strip in his books such as The Man With The Golden Arm and Never Come Morning focusing on the stories of junkies, gamblers, hookers, and drunks in the Polish ghetto. Writing about the area's Polish American underclass against the background of prevalent anti-immigrant xenophobia was taken by Poles as blatant Anti-Polonism. and resulted in the book Never Come Morning being banned for decades from the Chicago Public Library system over the massive outcry by Chicago Polonia. Later controversies to commemorate Algren would bring these old wounds back to surface, most recently when Polonia Triangle was to be renamed to honor the deceased author.Beginning in the 1960s, Wicker Park began to change radically. Completion of the Kennedy Expressway in 1960, whose construction had displaced many residents and torn holes in the sustaining network of Polish-American churches, settlement houses, and neighborhood groups. Additionally Puerto Ricans and other Latinos displaced by urban renewal in Old Town and Lincoln Park began moving in. In 1960 Latinos comprised less than 1 percent of West Town's population, but by 1970 that number was up to 39 percent. Split from the Lincoln Park neighborhood only by the Kennedy Expressway in the late 1950s and 1960s, it contained the second-largest concentration of Puerto Ricans in Chicago. It was the original home to the largest Latino gang at the time, the Latin Kings. The Young Lords, a human rights movement, held sit-ins with L.A.D.O. at the Wicker Park Welfare Office and large nonviolent marches to city hall. Urban renewal projects were undertaken to combat \"urban blight\" in some parts of the neighborhood, but disinvestment continued at a rapid clip as downtown banks redlined West Town for much of the mid-20th century. Wicker Park was also promoted by the city's urban renewal plans, as a good \"suburb within the city\" because of its easy access to downtown, via Milwaukee and the elevated train (via Damen and Division stations). Chicago and Wicker Park reached a nadir in the 1970s, a decade when the city overall lost 11% of its population. During the 1970s, hundreds of cases of insurance-motivated arson were reported in Wicker Park, near St. Elizabeth Hospital. Many small factories near the area (many in woodworking) also closed or moved away.\nEfforts by community development groups like Northwest Community Organization (NCO) to stabilize the community through new affordable-housing construction in the 1980s coincided with the arrival of artists attracted by the neighborhood's easy access to the Loop, cheap loft space in the abandoned factories, and distinctly urban feel.\nIn 1989, the \"Around the Coyote\" festival was launched to help the hundreds of working artists and micro-galleries in the neighborhood to gain a level of local and international prominence. This 501(c)3 non-profit was established with the mission to \"bring to the art community a professional organization that will help artists network and exhibit their art.\" For decades, the festival centered on the Flatiron Arts Building and was typically held during the month of October, Chicago's Artist Month. As of 2008 \"Around the Coyote\" revised its preferred locations for the annual festival, which in 2008 was held coincidentally with Looptopia in May in Chicago's Loop.\n\nToday, the neighborhood is best known for its numerous commercial and entertainment establishments and being a convenient place to live for downtown workers due to its proximity to public transportation and the Loop. Gentrification has made the area much more attractive to college-educated white-collar workers, although it faced considerable resistance from the working-class Puerto Rican community it displaced. Crime has drastically decreased and many new homes have been built as well as older homes being restored. The area has become a desirable neighborhood and this has led to increased business activity, with many new bars, restaurants, and stores opening to serve individuals. The neighborhood is known for hosting local art stores and independent businesses.  Property values have gone up, increasing the wealth of property owners and making the neighborhood attractive to real estate investors.\nThe borders of the neighborhood are generally accepted to be North Avenue to the north (at 1600 N) (but the official boundary is the Bloomingdale Trail train tracks just north of North), the Kennedy Expressway on the east north of North Avenue and the Chicago River south of North Avenue, Division to the south (at 1200 N), and Western Avenue to the west (2400 W). Both the East Village and Ukrainian Village are to the south, Humboldt Park is to the west, and Bucktown is to the north.\nNotable past and current residents include Nelson Algren, who lived on the third floor at 1958 W. Evergreen Ave between 1959–1975, Liz Phair, who penned her first album Exile in Guyville in and about Wicker Park, Smashing Pumpkins guitarist James Iha, Pro Wrestler Colt Cabana who can be seen on WWE Smackdown as Scotty Goldman, and singer\/guitarist Matt Skiba of The Alkaline Trio. Pro wrestler CM Punk of World Wrestling Entertainment currently resides in Wicker Park. Much of Wicker Park was designated as a Chicago Landmark District in 1991.Wicker Park is the setting of a 2004 film by the same name. However, the filming of this movie was done on location in Montreal, Quebec. Another film of note that uses Wicker Park as its background is High Fidelity (2000) directed by Stephen Frears and starring Evanston-born John Cusack. Former independent record company Wax Trax! Records, a pioneer in releasing industrial music, had its offices in Wicker Park.","Ukrainian Village":"Ukrainian Village is a Chicago neighborhood located west of Chicago's downtown and south of Wicker Park. Its boundaries are Division Street to the north, Grand Avenue to the south, Western Avenue to the west, and Damen Avenue to the east.\nUkrainian Village, like neighboring East Village began as farmland. Originally German Americans formed the largest ethnic group in the vicinity; however, by the turn of the century the neighborhood was largely Slavic. Similarly to the Lithuanian Downtown in the Chicago neighborhood of Bridgeport, Ukrainians settled in the district because of their familiarity with Poles who lived in the surrounding Polish Downtown. Dense settlement of the neighborhood was largely spurred by the 1895 construction of the elevated Logan Square branch along Paulina Street that would close in 1951 and be demolished in 1964.\nOver the past half century, it has remained a middle-class neighborhood, populated largely by older citizens of Eastern European ethnicity, bordered (and affected) on many sides by more dangerous areas. It was insulated somewhat from surrounding socioeconomic change in the large industrial areas on its south and west borders by the strong fabric of ethnic institutions as well as the staying power of the Orthodox and Ukrainian Catholic congregations.  These local ethnic institutions include the Ukrainian Institute of Modern Art, the Ukrainian National Museum, and the Ukrainian Cultural Center. Although Ukrainian Village continues to be the center of Chicago's large Ukrainian community, the gentrification of West Town is rapidly changing the demographic. Ukrainian Village continues to be home to approximately 10,000 ethnic Ukrainians.\nOther notable local landmarks include Ss. Volodymyr and Olha Ukrainian Catholic Church, St. Nicholas Ukrainian Catholic Cathedral, St. Volodymyr Ukrainian Orthodox Cathedral, Roberto Clemente High School, St Mary's Hospital, and Holy Trinity Russian Orthodox Cathedral, the latter having been commissioned by St. John Kochurov and designed by famed architect Louis Sullivan.\nOn December 4, 2002, the Ukrainian Village District, centering on Haddon Avenue, Thomas Street, and Cortez Street between Damen and Leavitt Avenues, including portions of Damen, Hoyne and Leavitt Avenues, was designated a Chicago Landmark District. Extensions to the district were designated in 2005 and on April 11, 2007.Neighboring \"East Village\", the area east of Ukrainian Village extending from Damen to Ashland, was originally known as \"East Ukrainian Village\".\nA few scenes from the popular Russian movie from the 1990s, Brother 2, were filmed in and around Ukrainian Village.","East Village":"East Village or \"East Ukrainian Village\" is a neighborhood directly east of Ukrainian Village. The generally accepted boundaries of East Village are Ashland (1600 W) on the east, Damen (2000 W) on the west, Division (1200 N) on the north, and Chicago (800 N) on the south (although some people extend the southern border to Grand Ave). The East Village Association neighborhood group in 1984 identify the boundaries as Division Street to Chicago Avenue and Damen Avenue to Milwaukee Avenue (800 – 1600 W).Although German-Americans were initially the largest ethnic group in the area, by 1890 Poles were the clear majority, organized around a dense network of Roman Catholic churches such as Holy Innocents and other institutions within the vicinity of Polish Downtown. These local fraternal and religious organizations helped new immigrants get their bearings. The first home of the Sisters of the Holy Family of Nazareth, a Catholic order founded by a Polish nun, was on West Division. While the convent moved to Des Plaines in 1908, Saint Mary of Nazareth Hospital which the sisters founded still remains.East Village's ethnic turnover coincided with a change in the scale of real estate development, with a host of large residential buildings constructed between Damen and Ashland to create densely packed blocks. East Village's varied built environment juxtaposed ornamented Queen Anne two-flats alongside frame cottages, brick tenements, and greystone three-flats.Polish immigration into the area accelerated during and after World War II when as many as 150,000 Poles are estimated to have arrived between 1939 and 1959 as Displaced Persons. Like the Ukrainians in neighboring Ukrainian Village, they clustered in established ethnic enclaves like this one that offered shops, restaurants, and banks where people spoke their language. Division Street was referred to as Polish Broadway, \"teeming with flophouses and gambling dens and polka clubs and workingman's bars like the Gold Star and Phyllis' Musical Inn\".Nelson Algren's literary output lionized the Division Street strip in his books such as The Man With The Golden Arm and Never Come Morning focusing on the stories of junkies, gamblers, hookers, and drunks in the Polish ghetto. Writing about the area's Polish American underclass against the background of prevalent anti-immigrant xenophobia was taken by Poles as blatant Anti-Polonism. and resulted in the book Never Come Morning being banned for decades from the Chicago Public Library system over the massive outcry by Chicago Polonia. Later controversies to commemorate Algren would bring these old wounds back to surface, most recently when Polonia Triangle was to be renamed to honor the deceased author.In the 1960s East Village began to change radically. One major reason was the completion of the Kennedy Expressway in 1960, whose construction had displaced many residents and torn holes in the sustaining network of Polish-American churches, settlement houses, and neighborhood groups. Additionally, Puerto Ricans and other Latinos displaced by urban renewal in Old Town and Lincoln Park began moving in. In 1960 Latinos comprised less than 1 percent of West Town's population, but by 1970 that number was up to 39 percent.Downtown banks redlined West Town for much of the mid-20th century. Real estate values plummeted as landlords neglected their buildings and speculators sat on vacant land and abandoned property. Small businesses along Chicago Avenues closed, and the arson rate in East Village was so high that in 1976 Mayor Richard J. Daley convened a task force to address the crisis. The Polish exodus out of the neighborhood followed the Kennedy Expressway into the suburbs. The Northwest Community Organization was founded in 1962 to stem white flight by promoting home ownership and integration between longtime Eastern European residents and the newcomers. The institutional infrastructure that held Ukrainian Village together during the 1970s and 1980s was lacking in East Village. Much of the Polish population had moved northwestward to Avondale and beyond, while the Latino community which had begun to organize around issues of affordable housing and other redevelopment strategies designed to stave off displacement increasingly came into conflict with the mostly white artists and other urban-pioneer types who by the early 1980s constituted a minor but significant presence.Today this neighborhood has been largely gentrified. East Village's historic proximity to the elevated train and higher population density gave it a more working-class population than Ukrainian Village, and much of the original housing stock has been torn down for new construction in recent years. Blocks bounded by Division Street and Chicago, Hermitage and Damen Avenues were designated a Chicago Landmark District in 2006 and to the National Register of Historic Places in 2009 to preserve its character with these development pressures.","River West":"The small area within West Town east of the Kennedy Expressway and west of the North Branch of the Chicago River, between Division Street (1200N) and Grand Avenue (500N) is referred to as River West, complementing the River North area of the Near North Side. The small area is bisected by the elevated Union Pacific Railroad tracks. It contains several large loft buildings, most converted in the mid-1980s for residential use; several housing developments; St. John Cantius church; The Chicago Academy for the Arts located in St. John Cantius' former school; the Chicago Tribune's Freedom Center printing facility; some nightclubs and restaurants, and a few blocks of historic residential areas.","Noble Square":"Noble Square is directly east of East Village. The generally accepted boundaries of Noble Square are the Kennedy Expressway on the east, Ashland (1600 W) on the west, Division (1200 N) on the north, and Chicago (800 N) or Grand (500 N) on the south. The name apparently refers to Eckhart Park, a one-block square park at the northeast corner of Chicago and Noble (1400 W). Its identity may be disappearing: real estate agents have been including its northern half as an eastern section of Wicker Park, while the southern end of this neighborhood has been identified as West Town since around 2000. This neighborhood was listed as \"West Town\" in 19th-century census records.Erie Neighborhood House, a social service agency tracing its roots to the settlement house movement of the 19th century, has operated in the neighborhood since 1870, providing services ranging from early childhood education and after-school programming to ESL and citizenship classes for adults. Its historic location is near the intersection of Erie (632 N) and Noble (1400 W).","East Humboldt Park":"The western portion of the West Town community area is commonly referred to as \"Humboldt Park\" or \"East Humboldt Park,\" even though it is not in the Community Area of that name. The 104-block area's boundaries are Western Avenue to the east, Chicago Avenue to the south, North Avenue to the north, and Humboldt Park, the 208 acre park that gives the area its name, to the west.  This area has recently become known as \"East Humboldt Park\/West Town\" to indicate its distinction from the Humboldt Park Community Area to the west of the park itself.[1]  It is perhaps best known for Paseo Boricua, a half-mile stretch of Division Street between Western and California Avenues. This stretch of Division is bookended by two 59-foot (18 m)-tall steel Puerto Rican flags, and contains many Puerto Rican stores and restaurants. The community that resides here has made efforts, through community improvement work, to resist the forces of gentrification that have moved them further west from West Town, Wicker Park, and Ukrainian Village. However, as creatives, young professionals, and families are priced out of adjacent Wicker Park and Bucktown, Humboldt Park has increasingly become a target of gentrification, and was named the \"tenth-hottest\" neighborhood in the country by Redfin in 2014. Additional commercial areas are along North Avenue, which is home to a large number of vintage clothing and mid-century furniture boutiques, and Augusta Avenue, which has seen the opening of a number of destination restaurants.","Smith Park":"Smith Park or \"The Patch\" lies within Chicago's West Town community. Its formal name comes from the city park on its south border. Bounded by Chicago Avenue (800N) on the north, Grand Avenue (550N) on the south, Western Avenue (2400W) on the east and Washtenaw Avenue (2700W) on the west; the majority of the neighborhood sits within Chicago's 26th Ward, with a small portion a part of the 1st Ward.\nOriginally settled primarily by Italian immigrants of various old country locales who moved west from the \"Little Sicily\" area on Sedgwick Street, near where the Cabrini–Green housing projects were built, and from the Italian neighborhood along the Grand Avenue corridor, it is a very old community with many families that have lived in the neighborhood for over six generations.\nIn 1929, when a quarry that had been converted to a large city dump in the West Town neighborhood had been completely filled, the Bureau of Sanitation transferred part of the site to the Bureau of Parks and Recreation. The city named the area Smith Athletic Field for Joseph Higgins Smith, alderman of the surrounding 32nd ward from 1914 to 1933. In 1959, the city transferred Smith Park to the Chicago Park District, at which time an artillery piece was placed in the park. A WWII tank was moved to the southeast corner of the park in the early 1990s from its former home at Grand and Western Avenues. This is the landmark by which most Chicagoans recognize Smith Park. The Park District added a spraypool, swimming pool, and bathhouse in the late 1960s and in 1979 a large, modern fieldhouse was constructed. Nine years later, the Park District dedicated its gymnasium to Tom Positano, a high school student who had been active at the park and who posthumously received a Junior Citizenship Award.","Transportation":"The Kennedy Expressway, part of Interstate 90, passes through West Town. The area is also served by four stops on the CTA Blue Line, providing direct access to O'Hare International Airport and the Chicago Loop. From southeast to northwest, the stations are at Grand Avenue, Chicago Avenue, Division Street, and Damen Avenue.","Education":"West Town residents are assigned to schools in the Chicago Public Schools.\nComprehensive high schools located in the West Town community area include:\nClemente High School\nWells Community Academy High SchoolMagnet high schools include:\n\nOgden International School West Campus (high school; previously both middle and high school)Charter high schools include:\n\nNoble Street College Prep\nGolder College PrepPrivate high schools include:\n\nHoly Trinity High School\nThe Chicago Academy for the Arts, a private, independent high school located in River West\nDr. Pedro Albizu Campos High School, an alternative high school near Division Street and California Avenue where the staff use critical pedagogy in their collective work with the Puerto Rican community.Catholic elementary and pre-schools include:\n\nSt. Nicholas Cathedral School, located in Ukrainian Village\nSt. Helen School, located in Ukrainian Village. This school is where former Duke  coach Mike Krzyzewski. This school is known by many as a LGBTQ+ unfriendly school, with the current principal, Dr. Shirley Morris, creating controversy for her transphobia.","Notable people":"L. Frank Baum (1856–1919), author of the Oz book series. He and his family resided at 1667 North Humboldt Boulevard when he wrote The Wonderful Wizard of Oz.\nHarry Neal Baum (1889–1967), author and historian. He was raised at 1667 North Humboldt Boulevard.\nFrank Joslyn Baum (1883–1958), lawyer, soldier, writer, and film producer. He was raised at 1667 North Humboldt Boulevard.\nSaul Bellow (1915-2005), writer and winner of the Pulitzer Prize and the Nobel Prize in Literature. His family moved to 2629 West Augusta Boulevard when he was nine years old.\nJessica Camacho (born 1982), actress. She was a childhood resident of West Town, living at the corner of West Division Street and North Mozart Street.\nStephen Colbert (born 1964), comedian and television host. He resided in Ukrainian Village during the early 1990s.","Landmarks":"Holy Trinity Russian Orthodox Cathedral\nDivision Street Russian and Turkish Baths","See also":"Chopin Theatre\nPolish Americans\nPolish Cathedral style","References":"","External links":""}]