[{"Demographics":"According to a June 2017 analysis by the Chicago Metropolitan Agency for Planning, there were 27,982 people and 9,058 households in West Pullman. From 2000 to 2015, the area lost more than 20% of its residents. The racial makeup of the area was 1% White, 93.39% African American, 0.24% Asian, 0.54% from other races. Residents who identify as Hispanic or Latino of any race were 4.83% of the population. The age distribution was 29.7% under the age of 19, 19.3% from 20 to 34, 17.7% from 35 to 49, 18.5% from 50 to 64, and 14.8% 65 or older. The median age was 35 years.","Economy":"The median income is $33,898.\nWest Pullman residents were victimized by predatory lenders during the 1970s. In the 1980s, West Pullman residents lost both industrial and professional jobs making unemployment an extra hurdle for the community.  Habitat for Humanity has built and is continuing to build homes in the community of West Pullman.  The residents are working hard to turn their economy around.\nWest Pullman recently overcame the industrial legacy of toxic waste with the help of the EPA.  There is now a community garden in place of the former \"toxic zone.\"West Pullman is also home to the largest urban photovoltaic solar plant in the United States. The 10 MW plant utilizes 32,800 SunPower solar panels, spans 39 acres (160,000 m2), and generates enough power to supply energy to approximately 1500 homes in the Midwest. It is owned and operated by Exelon and came online in early 2010.","History":"After the expulsion of the Potawatomi as part of the 1833 Treaty of Chicago, the area that is now West Pullman was settled by westbound settlers. In the 1880s, real estate speculators created the West Pullman Land Association to develop land between Wentworth and Ashland Avenues. The Association was successful in industrial development, and later residential development before the Panic of 1893, the Pullman Strike of 1894 dealt an economic blow that resulted in bankruptcy.The University of Chicago sociologists created the West Pullman community area in the 1920s. They did this by merging several existing communities. The first of these communities was Kensington which grew alongside the town Pullman.  The second of these communities was the former village of Gano.  The area of Gano was populated by Pullman workers who desired to own their own homes and escape from the corporate control of George Pullman's company town. West Pullman was launched as an industrial and residential subdivision in 1891 by the West Pullman Land Association.  West Pullman was the largest of the identifiable communities in the nation where a type of fusion between residential and factory life existed in the same space.","Parks":"West Pullman Park - Indoor Pool\nKensington Park - Basketball Court with Seating. Playground equipment.\n\nMajor Taylor Trail - 6 Miles\nGano Park\nMorgan Field Park\nCooper Park (Jack Leroy)","Sports \/ Community Facilities":"Salvation Army Ray & Joan Kroc Community Center CorpsLion's Field Kroc Community Center","Healthcare":"According to the Pritzker School of Medicine, fourteen percent (14%) of the West Pullman population is uninsured, though ninety-two percent (92%) report having a consistent primary care provider. The obesity rate is fifty-three percent (53%).","Politics":"West Pullman is a stronghold of the Democratic Party. In the 2016 presidential election, West Pullman cast 12,473 votes for Hillary Clinton and cast 217 votes Donald Trump. It was Clinton's 11th largest margin of victory in the 76 community areas she won. In the 2012 presidential election, West Pullman cast 14,496 votes for Barack Obama and 86 votes for Mitt Romney. It was Obama's 8th largest margin of victory in the 76 community areas he won.At the local level, West Pullman is located in Chicago's 9th and 34th wards represented by Democrats Anthony Beale and Carrie Austin respectively.","Transportation":"West Pullman is home to four stations on the Metra Electric District's  Blue Island branch; Racine, State Street, Stewart Ridge, and West Pullman. Red Ahead, a program to extend the Red Line south to 130th Street, would result in a new station at Michigan Avenue in West Pullman. In 2020, it was estimated that this project would begin construction in 2025 and would be completed in 2029.","Improvement Projects":"Habitat For Humanity is interjecting single-family homes throughout the neighborhood for improvement.\nCottage Grove Ave is being extended Southbound from E 115th St. to E 130th St. with light and visual improvements.\nE 115th St. and S. Cottage Grove Ave will see train station improvements along with retail improvements.","Notable people":"Robert A. Clifford (born 1950 or 1951), trial lawyer notable for representing Rachel Barton Pine in her lawsuit against Metra and representing the families of the victims of the respective Alaska Airlines Flight 261 and American Eagle Flight 4184 crashes. He was raised in West Pullman near 121st Street and South Laflin Street.\nEd Derwinski (1926–2012), 1st United States Secretary of Veterans Affairs. He resided at 12109 South Parnell Avenue during his time as a Congressman.\nArthur Swanson (1926–2010), member of the Illinois Senate from 1963 to 1971. He resided at 12556 South Harvard Avenue while serving as a legislator.","References":"","External links":"Official City of Chicago West Pullman Community Map\nExelon and SunPower together In US Largest Solar Power Plant\nEncyclopaedia Chicago: West Pullman"}]