[{"History":"Chicago Lawn, to the east, was settled while the marshy land of West Lawn remained unsettled. Some housing was built during the 1920s, but it still remained swampy land. Houses were built during the 1930s which then reported German-Americans, Irish-Americans, Polish-Americans, Czech-Americans and Italian-Americans living in the area. The area had been growing until the Great Depression, when the economy declined. After World War II, growth continued and new houses and streets were built. The Airport Homes race riots of 60th & Karlov in 1946 were intended to keep black people out of the area. After the 1970s, more Mexican-Americans, Irish-Americans, and Polish immigrants started settling the area.","Notability":"One small business in the neighborhood, the Capitol Cigar Store at 63rd and Pulaski, features a tall Native American statue as the landmark of West Lawn. The statue is most notable for being seen in the movie Wayne's World. West Lawn is also the home of the Balzekas Museum of Lithuanian Culture along Pulaski. It was founded by Lithuanian-American businessman Stanley Balzekas Jr., and is the only museum in the US devoted to the subjects of Lithuania, the Lithuanian language, history, culture and politics, and to the Lithuanian-American experience.","Education":"West Lawn is part of City of Chicago School District #299 and City Colleges of Chicago District #508.","Ford City":"Ford City is a neighborhood on the southwest side of Chicago which immediately surrounds the Ford City Mall, in turn named for the Ford Aircraft plant which previously occupied the site; the location was also the site of the Dodge Chicago Plant, which after World War II became the factory for the Tucker Car Corporation. In the future, the Orange Line of the Chicago \"L\" might be extended here.","Notable people":"Michael Madigan, 67th and 69th Speaker of the Illinois House of Representatives. He is a current resident of, and incumbent member of the Illinois House of Representatives for, West Lawn.\nFrank Savickas, member of the Illinois Senate from 1970 until 1992. He resided in West Lawn during his political career, later moving to Venice, Florida.\nLeo Stefanos, inventor of the DoveBar.","Politics":"West Lawn has supported the Democratic nominee by large margins in the past two presidential elections. In the 2016 presidential election, West Lawn cast 8,429 votes for Hillary Clinton and cast 1,328 votes for Donald Trump (83.12% to 13.10%). In the 2012 presidential election, West Lawn cast 6,715 votes for Barack Obama and cast 1,443 votes for Mitt Romney (81.37% to 17.49%).West Lawn is split between the 13th ward represented by Marty Quinn, and 23rd represented by Silvana Tabares on the Chicago City Council.","See also":"South Side Irish","References":"","External links":"Official City of Chicago West Lawn Community Map\nFord City Mall\nWest Lawn Chamber Of Commerce\nBalzekas Museum of Lithuanian Culture\nChicago Park District\nWest Lawn Park"}]