[{"Neighborhoods and sub-areas":"","Golden Ghetto":"The Golden Ghetto is bounded on the north by Warren Park and Pratt Avenue and on the south by Peterson Avenue. It acquired its name from the thriving Jewish community there from about 1930 to the mid-1970s. The Jewish community peaked at over 47,000 in the 1960s. That community began to drift into the suburbs in the 1960s, and the neighborhood began to be home to South Asians and Russian Jews from about that time.\nThe heyday of the area is the topic of Adam Langer's Crossing California, told from the perspective of the second-generation residents during their middle school and teenage years. There has been a recent resurgence in Jewish residents, up from a nadir of 20,000 to around 25,000 in the late 2010s, due to increased Orthodox residents.","Rogers Park Manor Bungalow Historic District":"The Rogers Park Manor Bungalow Historic District is a residential historic district in the West Ridge neighborhood of Chicago, Illinois. The district includes 329 buildings, 247 of which are Chicago bungalows built in the 1920s. The district was added to the National Register of Historic Places on November 15, 2005.","Talman West Ridge Bungalow Historic District":"The Talman West Ridge Bungalow Historic District is a residential historic district in the West Ridge neighborhood of Chicago, Illinois. 181 of the district's 272 buildings are either brick Chicago bungalows or older stucco bungalows built from 1919 to 1930.","Schools":"","Public schools":"Chicago Public Schools operates public schools.\n\nClinton Elementary School\nJamieson Elementary School\nDaniel Boone Elementary School\nStephen Decatur Classical School\nGeorge Armstrong Elementary School\nPhilip Rogers Elementary School\nStone Scholastic Academy\nWest Ridge Elementary School\nStephen Tyng Mather High School","Private schools":"ABC Academy\nBais Yaakov High School\nBethesda Evangelical Lutheran School\nBnos Rabbeinu High School\nCheder Lubavitch Girls Elementary \/ High School\nHanna Sacks Bais Yaakov High School\nJoan Dachs Bais Yaakov \/ Tiferes Tzvi Elementary School\nKeshet High School\nLubavitch Mesivta of Chicago\nNative American Educational Services College\nVictor C. Neumann School\nSofer Nathan's Vocational College\nSt. Hilary Elementary School\nSt. Margaret Mary School\nSt. Philips Evangelical Lutheran School\nTzemach Tzedek Elementary School (Opened 2002)\nYeshivas Brisk \/ Brisk Rabbinical College\nYeshiva Migdal Torah School\nYeshiva Ohr Boruch-Veitzener Cheder","Politics":"West Ridge has supported the Democratic Party in the past three presidential elections, though relative support declined slightly from 2016 to 2020. In the 2020 presidential election, West Ridge cast 17,222 votes for Joe Biden (69.8%) and cast 7,281 votes for Donald Trump (28.9%). In the 2016 presidential election, West Ridge cast 16,712 votes for Hillary Clinton and cast 4,772 votes for Donald Trump, a relatively larger victory of 73.5% to 21.5%. In the 2012 presidential election, West Ridge cast 14,446 votes for Barack Obama and cast 5,345 votes for Mitt Romney.It had been represented in the Chicago City Council by Alderman Bernard Stone from 1973 until May 2011. On April 5, 2011, Alderman Debra Silverstein defeated Stone in a runoff election and now represents the 50th Ward, which encompasses West Ridge.","Religion":"The Roman Catholic Archdiocese of Chicago operates Catholic churches. On July 1, 2020, St. Henry, St. Margaret Mary, and St. Timothy churches have merged.","Historical population":"Source:","Transportation":"","Bus":"CTA:\n\n11 Lincoln\n49B North Western\n82 Kimball-Homan\n84 Peterson\n93 California\/Dodge (Monday–Saturday only)\n96 Lunt (Weekdays only)\n97 Skokie\n155 Devon\n206 Evanston Circulator (Weekday rush hours only)Pace:\n\n215 Crawford-Howard\n290 Touhy","Rail":"Peterson Ridge station","Notable people":"Sidney Blumenthal (born 1948), journalist, political operative, and Senior Advisor to President Bill Clinton. He resided at West Birchwood Avenue in West Rogers Park as a child.\nHoward W. Carroll (1942–2021), member of the Illinois Senate from 1973 to 1999. He resided at 6014 North Francisco Avenue during his political career.\nPhilip H. Corboy (1924–2012), trial lawyer. He was a childhood resident of West Rogers Park, living at 2836 West Lunt Street.\nLeo Lerner (1907–1965), newspaper publisher. According to the 1940 United States Census, he resided at 2120 West Lunt Avenue.\nLouis A. Lerner (1935–1984), United States Ambassador to Norway during the Carter administration. According to the 1940 United States Census, he resided at 2120 West Lunt Avenue.\nJohn H. Leims (1921–1985), Captain in the United States Marine Corps and recipient of the Medal of Honor. He resided in West Ridge at 5837 North Talman Avenue.\nLouis Trinca-Pasat, American football player, raised in West Rogers Park","References":"","External links":"Official City of Chicago West Ridge Community Map\nChicago Park District: Indian Boundary Park\nLakeside Community Development Corporation\nPhotographs of Devon Avenue by Jordan Bettis\nRogers Park West Ridge Historical Society"}]