[{"Early history":"The first European settlers to the area that developed as West Englewood were predominantly German and Swedish farmers who arrived in the 1840s. After construction of rail lines for the Rock Island and Wabash Railroads, the area became known as Chicago Junction, which soon changed to Junction Grove. This is commemorated today with the Junction Grove Playlot Park, which is maintained by the Chicago Park District. By 1865, Junction Grove became the unincorporated town of Lake, which was later renamed Englewood.\nTwo events led to population increases for the Englewood and West Englewood neighborhoods. In 1871 the Great Chicago Fire destroyed many neighborhoods to the north. The combination of open spaces for housing and the presence of railroad lines made these neighborhoods ideal for Chicagoans looking for less crowding and moving from the urban center destroyed in the fire. In 1889 the neighborhoods of Englewood and West Englewood became part of the City of Chicago after the town of Lake was annexed by the city.\nWith annexation came Chicago street cars, the second factor to encourage development. In 1903 the Englewood Elevated Railway Company built a branch running roughly along 63rd Street to Loomis, which was connected to the South Side Elevated Railroad. These improvements in transportation made the Englewood area an easy commute for workers traveling north to the stockyards, a major employer, and downtown.","Economic and racial change":"At the same time that hundreds of thousands of European immigrants were coming to Chicago, where unskilled labor jobs in the stockyards and steel mills enabled them to support families, Blacks from the rural South started migrating to the industrial city. Beginning during World War I, when they replaced workers who were drafted, Blacks migrated to the city in great number before 1940. They were escaping oppressive social and political conditions:  lynchings, disfranchisement across the South that prevented them from voting, segregated education in underfunded systems, and legal racial segregation. Initially, they competed with immigrants primarily for unskilled jobs and housing; Blacks were restricted by discrimination in housing practices to narrow areas of older housing on the South Side, known as the Black Belt.\nEuropean immigrants and ethnic whites dominated separate territories on the South Side: the Irish, Polish, Italians and others had their own centers of population which they protected against each other and against blacks. According to statistics compiled by the Encyclopedia of Chicago, the West Englewood area had 63,845 residents in 1930, 98% of whom were white and almost 23% foreign born. It reached its peak population in 1940, with more than 64,000 residents.\nIndustrial restructuring after World War II led to the massive loss of jobs that residents had depended on: the stockyard operations were moved west, first to Kansas City, Kansas, and eventually the good-paying jobs in the steel mills also shifted out of the region. Railroads also restructured, causing more loss of union jobs among both whites and African Americans.\nIn 1960 the median income was close to the Chicago median income, $6,738 ($66652.39 adjusted for inflation), and 12% of the residents were black.During the 1960s and after, advances in civil rights opened more areas of housing to blacks, and they followed other Americans into the further reaches of the city, settling in West Englewood and other southern neighborhoods. The changes in industry, however, meant that skilled workers could no longer achieve middle-class lives. Although union jobs were no longer racially restricted, fewer were to be had. Many workers left the area to seek employment, and neighborhoods declined in population and services. Other residents moved further out into suburban towns to seek newer housing.\nBy 2000 due to the loss of jobs, the population of West Englewood had dropped to 45,282. By that time, with demographic changes, 98% of residents were black. According to the 2000 census, only 1% of the population was foreign born. Late 20th-century immigrants have been primarily from Latin America and Asia, and have created concentrated settlements in other neighborhoods. By the 2020 census, the population had fallen below 30,000, down more than 50% from the peak.\nThe precipitous population declines in the decades since 1980 led to widespread abandonment of houses and apartment buildings throughout West Englewood. The abandoned structures attracted squatters and criminals, prompting the city government to begin buying up and demolishing vacant structures on a large scale. This program affected many neighborhoods across Chicago, but Englewood and West Englewood, taken together, had by far the highest number of demolitions in the city. Unlike other areas where many abandoned buildings have been demolished by the city, there has been very little interest in redevelopment in West Englewood. Virtually all of the lots cleared in the area remain vacant and the neighborhood's population has continued to rapidly decline.","Government":"The headquarters for the Chicago Police Department's 7th district are located in West Englewood.","Education":"Chicago Public Schools:\nZoned K-8 schools serving sections of West Englewood: Raldolph, O'Toole, Goodlow, Earle, Henderson, Langford, Bontemps, Woods, Bass, Bong, Guggenheim, and Stagg.\nMost residents are zoned to the area high school, William Rainey Harper High School, which has served the community for over 100 years; some are zoned to Hope High School or Robeson High School. A small segment to the southwest is zoned to a different high school.\nMagnet school: Robert Lindblom Math & Science Academy - 6130 S. Wolcott Ave, has received preliminary landmark status from City of ChicagoChicago Public Library:\n\nWest Englewood Public Library - 1745 W. 63rd Street","Notable people":"Esther Golar (1944-2015), member of the Illinois House of Representatives from 2006 until her death in 2015. She was raised in West Englewood.\nMichael E. Hannigan (1888-????), member of the Illinois House of Representatives from 1932 until 1969. He resided at 6646 South Honore Street during his legislative tenure.\nBenn Jordan (born 1979), modern jazz and electronic musician. He was raised in West Englewood.\nFrancis X. Lawlor (1917-2013), priest and politician notable for his segregationist activism. He resided at 6629 South Paulina Street in 1969.\nMichael H. McDermott (1901-????), member of the Illinois House of Representatives from during the 1950s and 1960s. He resided at 6706 South Wood Street during his legislative tenure.","References":"","External links":"Official City of Chicago West Englewood Community Map"}]