[{"History":"Before the early 20th century, the area now designated West Elsdon was a marshy remnant of an ancient lake. The early settlers were German-Americans and Irish-Americans. During the 1930s, housing was built and Polish-Americans and other Central Europeans settled the area. The land remained rural until World War II, when growth resumed and brick houses were built. After World War II, West Elsdon was the site of the Airport Homes race riots, the worst episode of racial inspired violence that the city faced in some thirty years. The West Elsdon Civic Association became one of the first vocal political enemies of the CHA and its first executive secretary, Elizabeth Wood. Opposition to public housing remained strong in the area. In the early 1970s the West Elsdon Civic Association was an active participant in the \"No-CHA\" citywide coalition opposing scattered-site public housing in predominantly middle-class white neighborhoods.Later, Mexican-Americans settled in the eastern part of the community. Soon public schools were registering more Hispanic-Americans, and the CTA Orange Line was built to connect Midway Airport to Downtown.","Politics":"The West Elsdon community has supported the Democratic Party in the past two presidential elections by large margins. In the 2016 presidential election, West Elsdon cast 3,910 votes for Hillary Clinton and cast 685 votes for Donald Trump (82.18% to 14.40%). In the 2012 presidential election, West Elsdon cast 3,015 votes for Barack Obama and cast 736 votes for Mitt Romney (79.45% to 19.39%).","Notable people":"Anne M. Burke, Illinois Supreme Court Justice and wife of Alderman Ed Burke.\nDaniel J. Burke, Democratic member of the Illinois House of Representatives since 1991. He is a West Elsdon resident and alderman Ed Burke's brother.\nEd Burke, longtime 14th ward alderman representing West Elsdon and the surrounding area on the Chicago City Council. He is the husband of Justice Anne Burke.\nJenny McCarthy, actress, Playboy model and anti-vaccine activist. She was raised in West Elsdon.\nJoanne McCarthy, professional athlete who played for the Chicago Condors of the American Basketball League during the 1998 season. Jenny McCarthy's sister, she was also raised in West Elsdon.","References":"Encyclopedia of Chicago \"West Elsdon\"","External links":"West Elsdon map & neighborhood guide on ExploreChicago.org\nOfficial City of Chicago West Elsdon Community Map"}]